(()=>{var Gc=Object.create;var tu=Object.defineProperty;var $c=Object.getOwnPropertyDescriptor;var Qc=Object.getOwnPropertyNames;var Yc=Object.getPrototypeOf,Xc=Object.prototype.hasOwnProperty;var We=(e,t)=>()=>(t||e((t={exports:{}}).exports,t),t.exports);var Kc=(e,t,n,r)=>{if(t&&typeof t=="object"||typeof t=="function")for(let o of Qc(t))!Xc.call(e,o)&&o!==n&&tu(e,o,{get:()=>t[o],enumerable:!(r=$c(t,o))||r.enumerable});return e};var Dt=(e,t,n)=>(n=e!=null?Gc(Yc(e)):{},Kc(t||!e||!e.__esModule?tu(n,"default",{value:e,enumerable:!0}):n,e));var fu=We(P=>{"use strict";var fn=Symbol.for("react.element"),qc=Symbol.for("react.portal"),Zc=Symbol.for("react.fragment"),Jc=Symbol.for("react.strict_mode"),bc=Symbol.for("react.profiler"),ed=Symbol.for("react.provider"),td=Symbol.for("react.context"),nd=Symbol.for("react.forward_ref"),rd=Symbol.for("react.suspense"),od=Symbol.for("react.memo"),ld=Symbol.for("react.lazy"),nu=Symbol.iterator;function id(e){return e===null||typeof e!="object"?null:(e=nu&&e[nu]||e["@@iterator"],typeof e=="function"?e:null)}var lu={isMounted:function(){return!1},enqueueForceUpdate:function(){},enqueueReplaceState:function(){},enqueueSetState:function(){}},iu=Object.assign,uu={};function Mt(e,t,n){this.props=e,this.context=t,this.refs=uu,this.updater=n||lu}Mt.prototype.isReactComponent={};Mt.prototype.setState=function(e,t){if(typeof e!="object"&&typeof e!="function"&&e!=null)throw Error("setState(...): takes an object of state variables to update or a function which returns an object of state variables.");this.updater.enqueueSetState(this,e,t,"setState")};Mt.prototype.forceUpdate=function(e){this.updater.enqueueForceUpdate(this,e,"forceUpdate")};function su(){}su.prototype=Mt.prototype;function Do(e,t,n){this.props=e,this.context=t,this.refs=uu,this.updater=n||lu}var Mo=Do.prototype=new su;Mo.constructor=Do;iu(Mo,Mt.prototype);Mo.isPureReactComponent=!0;var ru=Array.isArray,au=Object.prototype.hasOwnProperty,jo={current:null},cu={key:!0,ref:!0,__self:!0,__source:!0};function du(e,t,n){var r,o={},l=null,i=null;if(t!=null)for(r in t.ref!==void 0&&(i=t.ref),t.key!==void 0&&(l=""+t.key),t)au.call(t,r)&&!cu.hasOwnProperty(r)&&(o[r]=t[r]);var u=arguments.length-2;if(u===1)o.children=n;else if(1<u){for(var s=Array(u),c=0;c<u;c++)s[c]=arguments[c+2];o.children=s}if(e&&e.defaultProps)for(r in u=e.defaultProps,u)o[r]===void 0&&(o[r]=u[r]);return{$$typeof:fn,type:e,key:l,ref:i,props:o,_owner:jo.current}}function ud(e,t){return{$$typeof:fn,type:e.type,key:t,ref:e.ref,props:e.props,_owner:e._owner}}function Uo(e){return typeof e=="object"&&e!==null&&e.$$typeof===fn}function sd(e){var t={"=":"=0",":":"=2"};return"$"+e.replace(/[=:]/g,function(n){return t[n]})}var ou=/\/+/g;function zo(e,t){return typeof e=="object"&&e!==null&&e.key!=null?sd(""+e.key):t.toString(36)}function sr(e,t,n,r,o){var l=typeof e;(l==="undefined"||l==="boolean")&&(e=null);var i=!1;if(e===null)i=!0;else switch(l){case"string":case"number":i=!0;break;case"object":switch(e.$$typeof){case fn:case qc:i=!0}}if(i)return i=e,o=o(i),e=r===""?"."+zo(i,0):r,ru(o)?(n="",e!=null&&(n=e.replace(ou,"$&/")+"/"),sr(o,t,n,"",function(c){return c})):o!=null&&(Uo(o)&&(o=ud(o,n+(!o.key||i&&i.key===o.key?"":(""+o.key).replace(ou,"$&/")+"/")+e)),t.push(o)),1;if(i=0,r=r===""?".":r+":",ru(e))for(var u=0;u<e.length;u++){l=e[u];var s=r+zo(l,u);i+=sr(l,t,n,s,o)}else if(s=id(e),typeof s=="function")for(e=s.call(e),u=0;!(l=e.next()).done;)l=l.value,s=r+zo(l,u++),i+=sr(l,t,n,s,o);else if(l==="object")throw t=String(e),Error("Objects are not valid as a React child (found: "+(t==="[object Object]"?"object with keys {"+Object.keys(e).join(", ")+"}":t)+"). If you meant to render a collection of children, use an array instead.");return i}function ur(e,t,n){if(e==null)return e;var r=[],o=0;return sr(e,r,"","",function(l){return t.call(n,l,o++)}),r}function ad(e){if(e._status===-1){var t=e._result;t=t(),t.then(function(n){(e._status===0||e._status===-1)&&(e._status=1,e._result=n)},function(n){(e._status===0||e._status===-1)&&(e._status=2,e._result=n)}),e._status===-1&&(e._status=0,e._result=t)}if(e._status===1)return e._result.default;throw e._result}var oe={current:null},ar={transition:null},cd={ReactCurrentDispatcher:oe,ReactCurrentBatchConfig:ar,ReactCurrentOwner:jo};function pu(){throw Error("act(...) is not supported in production builds of React.")}P.Children={map:ur,forEach:function(e,t,n){ur(e,function(){t.apply(this,arguments)},n)},count:function(e){var t=0;return ur(e,function(){t++}),t},toArray:function(e){return ur(e,function(t){return t})||[]},only:function(e){if(!Uo(e))throw Error("React.Children.only expected to receive a single React element child.");return e}};P.Component=Mt;P.Fragment=Zc;P.Profiler=bc;P.PureComponent=Do;P.StrictMode=Jc;P.Suspense=rd;P.__SECRET_INTERNALS_DO_NOT_USE_OR_YOU_WILL_BE_FIRED=cd;P.act=pu;P.cloneElement=function(e,t,n){if(e==null)throw Error("React.cloneElement(...): The argument must be a React element, but you passed "+e+".");var r=iu({},e.props),o=e.key,l=e.ref,i=e._owner;if(t!=null){if(t.ref!==void 0&&(l=t.ref,i=jo.current),t.key!==void 0&&(o=""+t.key),e.type&&e.type.defaultProps)var u=e.type.defaultProps;for(s in t)au.call(t,s)&&!cu.hasOwnProperty(s)&&(r[s]=t[s]===void 0&&u!==void 0?u[s]:t[s])}var s=arguments.length-2;if(s===1)r.children=n;else if(1<s){u=Array(s);for(var c=0;c<s;c++)u[c]=arguments[c+2];r.children=u}return{$$typeof:fn,type:e.type,key:o,ref:l,props:r,_owner:i}};P.createContext=function(e){return e={$$typeof:td,_currentValue:e,_currentValue2:e,_threadCount:0,Provider:null,Consumer:null,_defaultValue:null,_globalName:null},e.Provider={$$typeof:ed,_context:e},e.Consumer=e};P.createElement=du;P.createFactory=function(e){var t=du.bind(null,e);return t.type=e,t};P.createRef=function(){return{current:null}};P.forwardRef=function(e){return{$$typeof:nd,render:e}};P.isValidElement=Uo;P.lazy=function(e){return{$$typeof:ld,_payload:{_status:-1,_result:e},_init:ad}};P.memo=function(e,t){return{$$typeof:od,type:e,compare:t===void 0?null:t}};P.startTransition=function(e){var t=ar.transition;ar.transition={};try{e()}finally{ar.transition=t}};P.unstable_act=pu;P.useCallback=function(e,t){return oe.current.useCallback(e,t)};P.useContext=function(e){return oe.current.useContext(e)};P.useDebugValue=function(){};P.useDeferredValue=function(e){return oe.current.useDeferredValue(e)};P.useEffect=function(e,t){return oe.current.useEffect(e,t)};P.useId=function(){return oe.current.useId()};P.useImperativeHandle=function(e,t,n){return oe.current.useImperativeHandle(e,t,n)};P.useInsertionEffect=function(e,t){return oe.current.useInsertionEffect(e,t)};P.useLayoutEffect=function(e,t){return oe.current.useLayoutEffect(e,t)};P.useMemo=function(e,t){return oe.current.useMemo(e,t)};P.useReducer=function(e,t,n){return oe.current.useReducer(e,t,n)};P.useRef=function(e){return oe.current.useRef(e)};P.useState=function(e){return oe.current.useState(e)};P.useSyncExternalStore=function(e,t,n){return oe.current.useSyncExternalStore(e,t,n)};P.useTransition=function(){return oe.current.useTransition()};P.version="18.3.1"});var cr=We((Of,mu)=>{"use strict";mu.exports=fu()});var xu=We(L=>{"use strict";function Bo(e,t){var n=e.length;e.push(t);e:for(;0<n;){var r=n-1>>>1,o=e[r];if(0<dr(o,t))e[r]=t,e[n]=o,n=r;else break e}}function Te(e){return e.length===0?null:e[0]}function fr(e){if(e.length===0)return null;var t=e[0],n=e.pop();if(n!==t){e[0]=n;e:for(var r=0,o=e.length,l=o>>>1;r<l;){var i=2*(r+1)-1,u=e[i],s=i+1,c=e[s];if(0>dr(u,n))s<o&&0>dr(c,u)?(e[r]=c,e[s]=n,r=s):(e[r]=u,e[i]=n,r=i);else if(s<o&&0>dr(c,n))e[r]=c,e[s]=n,r=s;else break e}}return t}function dr(e,t){var n=e.sortIndex-t.sortIndex;return n!==0?n:e.id-t.id}typeof performance=="object"&&typeof performance.now=="function"?(vu=performance,L.unstable_now=function(){return vu.now()}):(Fo=Date,hu=Fo.now(),L.unstable_now=function(){return Fo.now()-hu});var vu,Fo,hu,ze=[],Je=[],dd=1,Se=null,b=3,mr=!1,St=!1,vn=!1,Su=typeof setTimeout=="function"?setTimeout:null,wu=typeof clearTimeout=="function"?clearTimeout:null,gu=typeof setImmediate!="undefined"?setImmediate:null;typeof navigator!="undefined"&&navigator.scheduling!==void 0&&navigator.scheduling.isInputPending!==void 0&&navigator.scheduling.isInputPending.bind(navigator.scheduling);function Vo(e){for(var t=Te(Je);t!==null;){if(t.callback===null)fr(Je);else if(t.startTime<=e)fr(Je),t.sortIndex=t.expirationTime,Bo(ze,t);else break;t=Te(Je)}}function Go(e){if(vn=!1,Vo(e),!St)if(Te(ze)!==null)St=!0,Qo($o);else{var t=Te(Je);t!==null&&Yo(Go,t.startTime-e)}}function $o(e,t){St=!1,vn&&(vn=!1,wu(hn),hn=-1),mr=!0;var n=b;try{for(Vo(t),Se=Te(ze);Se!==null&&(!(Se.expirationTime>t)||e&&!Cu());){var r=Se.callback;if(typeof r=="function"){Se.callback=null,b=Se.priorityLevel;var o=r(Se.expirationTime<=t);t=L.unstable_now(),typeof o=="function"?Se.callback=o:Se===Te(ze)&&fr(ze),Vo(t)}else fr(ze);Se=Te(ze)}if(Se!==null)var l=!0;else{var i=Te(Je);i!==null&&Yo(Go,i.startTime-t),l=!1}return l}finally{Se=null,b=n,mr=!1}}var vr=!1,pr=null,hn=-1,Eu=5,ku=-1;function Cu(){return!(L.unstable_now()-ku<Eu)}function Wo(){if(pr!==null){var e=L.unstable_now();ku=e;var t=!0;try{t=pr(!0,e)}finally{t?mn():(vr=!1,pr=null)}}else vr=!1}var mn;typeof gu=="function"?mn=function(){gu(Wo)}:typeof MessageChannel!="undefined"?(Ho=new MessageChannel,yu=Ho.port2,Ho.port1.onmessage=Wo,mn=function(){yu.postMessage(null)}):mn=function(){Su(Wo,0)};var Ho,yu;function Qo(e){pr=e,vr||(vr=!0,mn())}function Yo(e,t){hn=Su(function(){e(L.unstable_now())},t)}L.unstable_IdlePriority=5;L.unstable_ImmediatePriority=1;L.unstable_LowPriority=4;L.unstable_NormalPriority=3;L.unstable_Profiling=null;L.unstable_UserBlockingPriority=2;L.unstable_cancelCallback=function(e){e.callback=null};L.unstable_continueExecution=function(){St||mr||(St=!0,Qo($o))};L.unstable_forceFrameRate=function(e){0>e||125<e?console.error("forceFrameRate takes a positive int between 0 and 125, forcing frame rates higher than 125 fps is not supported"):Eu=0<e?Math.floor(1e3/e):5};L.unstable_getCurrentPriorityLevel=function(){return b};L.unstable_getFirstCallbackNode=function(){return Te(ze)};L.unstable_next=function(e){switch(b){case 1:case 2:case 3:var t=3;break;default:t=b}var n=b;b=t;try{return e()}finally{b=n}};L.unstable_pauseExecution=function(){};L.unstable_requestPaint=function(){};L.unstable_runWithPriority=function(e,t){switch(e){case 1:case 2:case 3:case 4:case 5:break;default:e=3}var n=b;b=e;try{return t()}finally{b=n}};L.unstable_scheduleCallback=function(e,t,n){var r=L.unstable_now();switch(typeof n=="object"&&n!==null?(n=n.delay,n=typeof n=="number"&&0<n?r+n:r):n=r,e){case 1:var o=-1;break;case 2:o=250;break;case 5:o=1073741823;break;case 4:o=1e4;break;default:o=5e3}return o=n+o,e={id:dd++,callback:t,priorityLevel:e,startTime:n,expirationTime:o,sortIndex:-1},n>r?(e.sortIndex=n,Bo(Je,e),Te(ze)===null&&e===Te(Je)&&(vn?(wu(hn),hn=-1):vn=!0,Yo(Go,n-r))):(e.sortIndex=o,Bo(ze,e),St||mr||(St=!0,Qo($o))),e};L.unstable_shouldYield=Cu;L.unstable_wrapCallback=function(e){var t=b;return function(){var n=b;b=t;try{return e.apply(this,arguments)}finally{b=n}}}});var Tu=We((Lf,_u)=>{"use strict";_u.exports=xu()});var Ic=We(ye=>{"use strict";var pd=cr(),he=Tu();function g(e){for(var t="https://reactjs.org/docs/error-decoder.html?invariant="+e,n=1;n<arguments.length;n++)t+="&args[]="+encodeURIComponent(arguments[n]);return"Minified React error #"+e+"; visit "+t+" for the full message or use the non-minified dev environment for full errors and additional helpful warnings."}var Ls=new Set,Un={};function At(e,t){rn(e,t),rn(e+"Capture",t)}function rn(e,t){for(Un[e]=t,e=0;e<t.length;e++)Ls.add(t[e])}var Qe=!(typeof window=="undefined"||typeof window.document=="undefined"||typeof window.document.createElement=="undefined"),hl=Object.prototype.hasOwnProperty,fd=/^[:A-Z_a-z\u00C0-\u00D6\u00D8-\u00F6\u00F8-\u02FF\u0370-\u037D\u037F-\u1FFF\u200C-\u200D\u2070-\u218F\u2C00-\u2FEF\u3001-\uD7FF\uF900-\uFDCF\uFDF0-\uFFFD][:A-Z_a-z\u00C0-\u00D6\u00D8-\u00F6\u00F8-\u02FF\u0370-\u037D\u037F-\u1FFF\u200C-\u200D\u2070-\u218F\u2C00-\u2FEF\u3001-\uD7FF\uF900-\uFDCF\uFDF0-\uFFFD\-.0-9\u00B7\u0300-\u036F\u203F-\u2040]*$/,Nu={},Ru={};function md(e){return hl.call(Ru,e)?!0:hl.call(Nu,e)?!1:fd.test(e)?Ru[e]=!0:(Nu[e]=!0,!1)}function vd(e,t,n,r){if(n!==null&&n.type===0)return!1;switch(typeof t){case"function":case"symbol":return!0;case"boolean":return r?!1:n!==null?!n.acceptsBooleans:(e=e.toLowerCase().slice(0,5),e!=="data-"&&e!=="aria-");default:return!1}}function hd(e,t,n,r){if(t===null||typeof t=="undefined"||vd(e,t,n,r))return!0;if(r)return!1;if(n!==null)switch(n.type){case 3:return!t;case 4:return t===!1;case 5:return isNaN(t);case 6:return isNaN(t)||1>t}return!1}function ue(e,t,n,r,o,l,i){this.acceptsBooleans=t===2||t===3||t===4,this.attributeName=r,this.attributeNamespace=o,this.mustUseProperty=n,this.propertyName=e,this.type=t,this.sanitizeURL=l,this.removeEmptyString=i}var J={};"children dangerouslySetInnerHTML defaultValue defaultChecked innerHTML suppressContentEditableWarning suppressHydrationWarning style".split(" ").forEach(function(e){J[e]=new ue(e,0,!1,e,null,!1,!1)});[["acceptCharset","accept-charset"],["className","class"],["htmlFor","for"],["httpEquiv","http-equiv"]].forEach(function(e){var t=e[0];J[t]=new ue(t,1,!1,e[1],null,!1,!1)});["contentEditable","draggable","spellCheck","value"].forEach(function(e){J[e]=new ue(e,2,!1,e.toLowerCase(),null,!1,!1)});["autoReverse","externalResourcesRequired","focusable","preserveAlpha"].forEach(function(e){J[e]=new ue(e,2,!1,e,null,!1,!1)});"allowFullScreen async autoFocus autoPlay controls default defer disabled disablePictureInPicture disableRemotePlayback formNoValidate hidden loop noModule noValidate open playsInline readOnly required reversed scoped seamless itemScope".split(" ").forEach(function(e){J[e]=new ue(e,3,!1,e.toLowerCase(),null,!1,!1)});["checked","multiple","muted","selected"].forEach(function(e){J[e]=new ue(e,3,!0,e,null,!1,!1)});["capture","download"].forEach(function(e){J[e]=new ue(e,4,!1,e,null,!1,!1)});["cols","rows","size","span"].forEach(function(e){J[e]=new ue(e,6,!1,e,null,!1,!1)});["rowSpan","start"].forEach(function(e){J[e]=new ue(e,5,!1,e.toLowerCase(),null,!1,!1)});var si=/[\-:]([a-z])/g;function ai(e){return e[1].toUpperCase()}"accent-height alignment-baseline arabic-form baseline-shift cap-height clip-path clip-rule color-interpolation color-interpolation-filters color-profile color-rendering dominant-baseline enable-background fill-opacity fill-rule flood-color flood-opacity font-family font-size font-size-adjust font-stretch font-style font-variant font-weight glyph-name glyph-orientation-horizontal glyph-orientation-vertical horiz-adv-x horiz-origin-x image-rendering letter-spacing lighting-color marker-end marker-mid marker-start overline-position overline-thickness paint-order panose-1 pointer-events rendering-intent shape-rendering stop-color stop-opacity strikethrough-position strikethrough-thickness stroke-dasharray stroke-dashoffset stroke-linecap stroke-linejoin stroke-miterlimit stroke-opacity stroke-width text-anchor text-decoration text-rendering underline-position underline-thickness unicode-bidi unicode-range units-per-em v-alphabetic v-hanging v-ideographic v-mathematical vector-effect vert-adv-y vert-origin-x vert-origin-y word-spacing writing-mode xmlns:xlink x-height".split(" ").forEach(function(e){var t=e.replace(si,ai);J[t]=new ue(t,1,!1,e,null,!1,!1)});"xlink:actuate xlink:arcrole xlink:role xlink:show xlink:title xlink:type".split(" ").forEach(function(e){var t=e.replace(si,ai);J[t]=new ue(t,1,!1,e,"http://www.w3.org/1999/xlink",!1,!1)});["xml:base","xml:lang","xml:space"].forEach(function(e){var t=e.replace(si,ai);J[t]=new ue(t,1,!1,e,"http://www.w3.org/XML/1998/namespace",!1,!1)});["tabIndex","crossOrigin"].forEach(function(e){J[e]=new ue(e,1,!1,e.toLowerCase(),null,!1,!1)});J.xlinkHref=new ue("xlinkHref",1,!1,"xlink:href","http://www.w3.org/1999/xlink",!0,!1);["src","href","action","formAction"].forEach(function(e){J[e]=new ue(e,1,!1,e.toLowerCase(),null,!0,!0)});function ci(e,t,n,r){var o=J.hasOwnProperty(t)?J[t]:null;(o!==null?o.type!==0:r||!(2<t.length)||t[0]!=="o"&&t[0]!=="O"||t[1]!=="n"&&t[1]!=="N")&&(hd(t,n,o,r)&&(n=null),r||o===null?md(t)&&(n===null?e.removeAttribute(t):e.setAttribute(t,""+n)):o.mustUseProperty?e[o.propertyName]=n===null?o.type===3?!1:"":n:(t=o.attributeName,r=o.attributeNamespace,n===null?e.removeAttribute(t):(o=o.type,n=o===3||o===4&&n===!0?"":""+n,r?e.setAttributeNS(r,t,n):e.setAttribute(t,n))))}var qe=pd.__SECRET_INTERNALS_DO_NOT_USE_OR_YOU_WILL_BE_FIRED,hr=Symbol.for("react.element"),Ft=Symbol.for("react.portal"),Wt=Symbol.for("react.fragment"),di=Symbol.for("react.strict_mode"),gl=Symbol.for("react.profiler"),zs=Symbol.for("react.provider"),Ds=Symbol.for("react.context"),pi=Symbol.for("react.forward_ref"),yl=Symbol.for("react.suspense"),Sl=Symbol.for("react.suspense_list"),fi=Symbol.for("react.memo"),et=Symbol.for("react.lazy");Symbol.for("react.scope");Symbol.for("react.debug_trace_mode");var Ms=Symbol.for("react.offscreen");Symbol.for("react.legacy_hidden");Symbol.for("react.cache");Symbol.for("react.tracing_marker");var Pu=Symbol.iterator;function gn(e){return e===null||typeof e!="object"?null:(e=Pu&&e[Pu]||e["@@iterator"],typeof e=="function"?e:null)}var W=Object.assign,Xo;function _n(e){if(Xo===void 0)try{throw Error()}catch(n){var t=n.stack.trim().match(/\n( *(at )?)/);Xo=t&&t[1]||""}return`
`+Xo+e}var Ko=!1;function qo(e,t){if(!e||Ko)return"";Ko=!0;var n=Error.prepareStackTrace;Error.prepareStackTrace=void 0;try{if(t)if(t=function(){throw Error()},Object.defineProperty(t.prototype,"props",{set:function(){throw Error()}}),typeof Reflect=="object"&&Reflect.construct){try{Reflect.construct(t,[])}catch(c){var r=c}Reflect.construct(e,[],t)}else{try{t.call()}catch(c){r=c}e.call(t.prototype)}else{try{throw Error()}catch(c){r=c}e()}}catch(c){if(c&&r&&typeof c.stack=="string"){for(var o=c.stack.split(`
`),l=r.stack.split(`
`),i=o.length-1,u=l.length-1;1<=i&&0<=u&&o[i]!==l[u];)u--;for(;1<=i&&0<=u;i--,u--)if(o[i]!==l[u]){if(i!==1||u!==1)do if(i--,u--,0>u||o[i]!==l[u]){var s=`
`+o[i].replace(" at new "," at ");return e.displayName&&s.includes("<anonymous>")&&(s=s.replace("<anonymous>",e.displayName)),s}while(1<=i&&0<=u);break}}}finally{Ko=!1,Error.prepareStackTrace=n}return(e=e?e.displayName||e.name:"")?_n(e):""}function gd(e){switch(e.tag){case 5:return _n(e.type);case 16:return _n("Lazy");case 13:return _n("Suspense");case 19:return _n("SuspenseList");case 0:case 2:case 15:return e=qo(e.type,!1),e;case 11:return e=qo(e.type.render,!1),e;case 1:return e=qo(e.type,!0),e;default:return""}}function wl(e){if(e==null)return null;if(typeof e=="function")return e.displayName||e.name||null;if(typeof e=="string")return e;switch(e){case Wt:return"Fragment";case Ft:return"Portal";case gl:return"Profiler";case di:return"StrictMode";case yl:return"Suspense";case Sl:return"SuspenseList"}if(typeof e=="object")switch(e.$$typeof){case Ds:return(e.displayName||"Context")+".Consumer";case zs:return(e._context.displayName||"Context")+".Provider";case pi:var t=e.render;return e=e.displayName,e||(e=t.displayName||t.name||"",e=e!==""?"ForwardRef("+e+")":"ForwardRef"),e;case fi:return t=e.displayName||null,t!==null?t:wl(e.type)||"Memo";case et:t=e._payload,e=e._init;try{return wl(e(t))}catch{}}return null}function yd(e){var t=e.type;switch(e.tag){case 24:return"Cache";case 9:return(t.displayName||"Context")+".Consumer";case 10:return(t._context.displayName||"Context")+".Provider";case 18:return"DehydratedFragment";case 11:return e=t.render,e=e.displayName||e.name||"",t.displayName||(e!==""?"ForwardRef("+e+")":"ForwardRef");case 7:return"Fragment";case 5:return t;case 4:return"Portal";case 3:return"Root";case 6:return"Text";case 16:return wl(t);case 8:return t===di?"StrictMode":"Mode";case 22:return"Offscreen";case 12:return"Profiler";case 21:return"Scope";case 13:return"Suspense";case 19:return"SuspenseList";case 25:return"TracingMarker";case 1:case 0:case 17:case 2:case 14:case 15:if(typeof t=="function")return t.displayName||t.name||null;if(typeof t=="string")return t}return null}function mt(e){switch(typeof e){case"boolean":case"number":case"string":case"undefined":return e;case"object":return e;default:return""}}function js(e){var t=e.type;return(e=e.nodeName)&&e.toLowerCase()==="input"&&(t==="checkbox"||t==="radio")}function Sd(e){var t=js(e)?"checked":"value",n=Object.getOwnPropertyDescriptor(e.constructor.prototype,t),r=""+e[t];if(!e.hasOwnProperty(t)&&typeof n!="undefined"&&typeof n.get=="function"&&typeof n.set=="function"){var o=n.get,l=n.set;return Object.defineProperty(e,t,{configurable:!0,get:function(){return o.call(this)},set:function(i){r=""+i,l.call(this,i)}}),Object.defineProperty(e,t,{enumerable:n.enumerable}),{getValue:function(){return r},setValue:function(i){r=""+i},stopTracking:function(){e._valueTracker=null,delete e[t]}}}}function gr(e){e._valueTracker||(e._valueTracker=Sd(e))}function Us(e){if(!e)return!1;var t=e._valueTracker;if(!t)return!0;var n=t.getValue(),r="";return e&&(r=js(e)?e.checked?"true":"false":e.value),e=r,e!==n?(t.setValue(e),!0):!1}function $r(e){if(e=e||(typeof document!="undefined"?document:void 0),typeof e=="undefined")return null;try{return e.activeElement||e.body}catch{return e.body}}function El(e,t){var n=t.checked;return W({},t,{defaultChecked:void 0,defaultValue:void 0,value:void 0,checked:n!=null?n:e._wrapperState.initialChecked})}function Iu(e,t){var n=t.defaultValue==null?"":t.defaultValue,r=t.checked!=null?t.checked:t.defaultChecked;n=mt(t.value!=null?t.value:n),e._wrapperState={initialChecked:r,initialValue:n,controlled:t.type==="checkbox"||t.type==="radio"?t.checked!=null:t.value!=null}}function Fs(e,t){t=t.checked,t!=null&&ci(e,"checked",t,!1)}function kl(e,t){Fs(e,t);var n=mt(t.value),r=t.type;if(n!=null)r==="number"?(n===0&&e.value===""||e.value!=n)&&(e.value=""+n):e.value!==""+n&&(e.value=""+n);else if(r==="submit"||r==="reset"){e.removeAttribute("value");return}t.hasOwnProperty("value")?Cl(e,t.type,n):t.hasOwnProperty("defaultValue")&&Cl(e,t.type,mt(t.defaultValue)),t.checked==null&&t.defaultChecked!=null&&(e.defaultChecked=!!t.defaultChecked)}function Ou(e,t,n){if(t.hasOwnProperty("value")||t.hasOwnProperty("defaultValue")){var r=t.type;if(!(r!=="submit"&&r!=="reset"||t.value!==void 0&&t.value!==null))return;t=""+e._wrapperState.initialValue,n||t===e.value||(e.value=t),e.defaultValue=t}n=e.name,n!==""&&(e.name=""),e.defaultChecked=!!e._wrapperState.initialChecked,n!==""&&(e.name=n)}function Cl(e,t,n){(t!=="number"||$r(e.ownerDocument)!==e)&&(n==null?e.defaultValue=""+e._wrapperState.initialValue:e.defaultValue!==""+n&&(e.defaultValue=""+n))}var Tn=Array.isArray;function Zt(e,t,n,r){if(e=e.options,t){t={};for(var o=0;o<n.length;o++)t["$"+n[o]]=!0;for(n=0;n<e.length;n++)o=t.hasOwnProperty("$"+e[n].value),e[n].selected!==o&&(e[n].selected=o),o&&r&&(e[n].defaultSelected=!0)}else{for(n=""+mt(n),t=null,o=0;o<e.length;o++){if(e[o].value===n){e[o].selected=!0,r&&(e[o].defaultSelected=!0);return}t!==null||e[o].disabled||(t=e[o])}t!==null&&(t.selected=!0)}}function xl(e,t){if(t.dangerouslySetInnerHTML!=null)throw Error(g(91));return W({},t,{value:void 0,defaultValue:void 0,children:""+e._wrapperState.initialValue})}function Au(e,t){var n=t.value;if(n==null){if(n=t.children,t=t.defaultValue,n!=null){if(t!=null)throw Error(g(92));if(Tn(n)){if(1<n.length)throw Error(g(93));n=n[0]}t=n}t==null&&(t=""),n=t}e._wrapperState={initialValue:mt(n)}}function Ws(e,t){var n=mt(t.value),r=mt(t.defaultValue);n!=null&&(n=""+n,n!==e.value&&(e.value=n),t.defaultValue==null&&e.defaultValue!==n&&(e.defaultValue=n)),r!=null&&(e.defaultValue=""+r)}function Lu(e){var t=e.textContent;t===e._wrapperState.initialValue&&t!==""&&t!==null&&(e.value=t)}function Hs(e){switch(e){case"svg":return"http://www.w3.org/2000/svg";case"math":return"http://www.w3.org/1998/Math/MathML";default:return"http://www.w3.org/1999/xhtml"}}function _l(e,t){return e==null||e==="http://www.w3.org/1999/xhtml"?Hs(t):e==="http://www.w3.org/2000/svg"&&t==="foreignObject"?"http://www.w3.org/1999/xhtml":e}var yr,Bs=function(e){return typeof MSApp!="undefined"&&MSApp.execUnsafeLocalFunction?function(t,n,r,o){MSApp.execUnsafeLocalFunction(function(){return e(t,n,r,o)})}:e}(function(e,t){if(e.namespaceURI!=="http://www.w3.org/2000/svg"||"innerHTML"in e)e.innerHTML=t;else{for(yr=yr||document.createElement("div"),yr.innerHTML="<svg>"+t.valueOf().toString()+"</svg>",t=yr.firstChild;e.firstChild;)e.removeChild(e.firstChild);for(;t.firstChild;)e.appendChild(t.firstChild)}});function Fn(e,t){if(t){var n=e.firstChild;if(n&&n===e.lastChild&&n.nodeType===3){n.nodeValue=t;return}}e.textContent=t}var Pn={animationIterationCount:!0,aspectRatio:!0,borderImageOutset:!0,borderImageSlice:!0,borderImageWidth:!0,boxFlex:!0,boxFlexGroup:!0,boxOrdinalGroup:!0,columnCount:!0,columns:!0,flex:!0,flexGrow:!0,flexPositive:!0,flexShrink:!0,flexNegative:!0,flexOrder:!0,gridArea:!0,gridRow:!0,gridRowEnd:!0,gridRowSpan:!0,gridRowStart:!0,gridColumn:!0,gridColumnEnd:!0,gridColumnSpan:!0,gridColumnStart:!0,fontWeight:!0,lineClamp:!0,lineHeight:!0,opacity:!0,order:!0,orphans:!0,tabSize:!0,widows:!0,zIndex:!0,zoom:!0,fillOpacity:!0,floodOpacity:!0,stopOpacity:!0,strokeDasharray:!0,strokeDashoffset:!0,strokeMiterlimit:!0,strokeOpacity:!0,strokeWidth:!0},wd=["Webkit","ms","Moz","O"];Object.keys(Pn).forEach(function(e){wd.forEach(function(t){t=t+e.charAt(0).toUpperCase()+e.substring(1),Pn[t]=Pn[e]})});function Vs(e,t,n){return t==null||typeof t=="boolean"||t===""?"":n||typeof t!="number"||t===0||Pn.hasOwnProperty(e)&&Pn[e]?(""+t).trim():t+"px"}function Gs(e,t){e=e.style;for(var n in t)if(t.hasOwnProperty(n)){var r=n.indexOf("--")===0,o=Vs(n,t[n],r);n==="float"&&(n="cssFloat"),r?e.setProperty(n,o):e[n]=o}}var Ed=W({menuitem:!0},{area:!0,base:!0,br:!0,col:!0,embed:!0,hr:!0,img:!0,input:!0,keygen:!0,link:!0,meta:!0,param:!0,source:!0,track:!0,wbr:!0});function Tl(e,t){if(t){if(Ed[e]&&(t.children!=null||t.dangerouslySetInnerHTML!=null))throw Error(g(137,e));if(t.dangerouslySetInnerHTML!=null){if(t.children!=null)throw Error(g(60));if(typeof t.dangerouslySetInnerHTML!="object"||!("__html"in t.dangerouslySetInnerHTML))throw Error(g(61))}if(t.style!=null&&typeof t.style!="object")throw Error(g(62))}}function Nl(e,t){if(e.indexOf("-")===-1)return typeof t.is=="string";switch(e){case"annotation-xml":case"color-profile":case"font-face":case"font-face-src":case"font-face-uri":case"font-face-format":case"font-face-name":case"missing-glyph":return!1;default:return!0}}var Rl=null;function mi(e){return e=e.target||e.srcElement||window,e.correspondingUseElement&&(e=e.correspondingUseElement),e.nodeType===3?e.parentNode:e}var Pl=null,Jt=null,bt=null;function zu(e){if(e=rr(e)){if(typeof Pl!="function")throw Error(g(280));var t=e.stateNode;t&&(t=wo(t),Pl(e.stateNode,e.type,t))}}function $s(e){Jt?bt?bt.push(e):bt=[e]:Jt=e}function Qs(){if(Jt){var e=Jt,t=bt;if(bt=Jt=null,zu(e),t)for(e=0;e<t.length;e++)zu(t[e])}}function Ys(e,t){return e(t)}function Xs(){}var Zo=!1;function Ks(e,t,n){if(Zo)return e(t,n);Zo=!0;try{return Ys(e,t,n)}finally{Zo=!1,(Jt!==null||bt!==null)&&(Xs(),Qs())}}function Wn(e,t){var n=e.stateNode;if(n===null)return null;var r=wo(n);if(r===null)return null;n=r[t];e:switch(t){case"onClick":case"onClickCapture":case"onDoubleClick":case"onDoubleClickCapture":case"onMouseDown":case"onMouseDownCapture":case"onMouseMove":case"onMouseMoveCapture":case"onMouseUp":case"onMouseUpCapture":case"onMouseEnter":(r=!r.disabled)||(e=e.type,r=!(e==="button"||e==="input"||e==="select"||e==="textarea")),e=!r;break e;default:e=!1}if(e)return null;if(n&&typeof n!="function")throw Error(g(231,t,typeof n));return n}var Il=!1;if(Qe)try{jt={},Object.defineProperty(jt,"passive",{get:function(){Il=!0}}),window.addEventListener("test",jt,jt),window.removeEventListener("test",jt,jt)}catch{Il=!1}var jt;function kd(e,t,n,r,o,l,i,u,s){var c=Array.prototype.slice.call(arguments,3);try{t.apply(n,c)}catch(v){this.onError(v)}}var In=!1,Qr=null,Yr=!1,Ol=null,Cd={onError:function(e){In=!0,Qr=e}};function xd(e,t,n,r,o,l,i,u,s){In=!1,Qr=null,kd.apply(Cd,arguments)}function _d(e,t,n,r,o,l,i,u,s){if(xd.apply(this,arguments),In){if(In){var c=Qr;In=!1,Qr=null}else throw Error(g(198));Yr||(Yr=!0,Ol=c)}}function Lt(e){var t=e,n=e;if(e.alternate)for(;t.return;)t=t.return;else{e=t;do t=e,t.flags&4098&&(n=t.return),e=t.return;while(e)}return t.tag===3?n:null}function qs(e){if(e.tag===13){var t=e.memoizedState;if(t===null&&(e=e.alternate,e!==null&&(t=e.memoizedState)),t!==null)return t.dehydrated}return null}function Du(e){if(Lt(e)!==e)throw Error(g(188))}function Td(e){var t=e.alternate;if(!t){if(t=Lt(e),t===null)throw Error(g(188));return t!==e?null:e}for(var n=e,r=t;;){var o=n.return;if(o===null)break;var l=o.alternate;if(l===null){if(r=o.return,r!==null){n=r;continue}break}if(o.child===l.child){for(l=o.child;l;){if(l===n)return Du(o),e;if(l===r)return Du(o),t;l=l.sibling}throw Error(g(188))}if(n.return!==r.return)n=o,r=l;else{for(var i=!1,u=o.child;u;){if(u===n){i=!0,n=o,r=l;break}if(u===r){i=!0,r=o,n=l;break}u=u.sibling}if(!i){for(u=l.child;u;){if(u===n){i=!0,n=l,r=o;break}if(u===r){i=!0,r=l,n=o;break}u=u.sibling}if(!i)throw Error(g(189))}}if(n.alternate!==r)throw Error(g(190))}if(n.tag!==3)throw Error(g(188));return n.stateNode.current===n?e:t}function Zs(e){return e=Td(e),e!==null?Js(e):null}function Js(e){if(e.tag===5||e.tag===6)return e;for(e=e.child;e!==null;){var t=Js(e);if(t!==null)return t;e=e.sibling}return null}var bs=he.unstable_scheduleCallback,Mu=he.unstable_cancelCallback,Nd=he.unstable_shouldYield,Rd=he.unstable_requestPaint,V=he.unstable_now,Pd=he.unstable_getCurrentPriorityLevel,vi=he.unstable_ImmediatePriority,ea=he.unstable_UserBlockingPriority,Xr=he.unstable_NormalPriority,Id=he.unstable_LowPriority,ta=he.unstable_IdlePriority,ho=null,Ue=null;function Od(e){if(Ue&&typeof Ue.onCommitFiberRoot=="function")try{Ue.onCommitFiberRoot(ho,e,void 0,(e.current.flags&128)===128)}catch{}}var Oe=Math.clz32?Math.clz32:zd,Ad=Math.log,Ld=Math.LN2;function zd(e){return e>>>=0,e===0?32:31-(Ad(e)/Ld|0)|0}var Sr=64,wr=4194304;function Nn(e){switch(e&-e){case 1:return 1;case 2:return 2;case 4:return 4;case 8:return 8;case 16:return 16;case 32:return 32;case 64:case 128:case 256:case 512:case 1024:case 2048:case 4096:case 8192:case 16384:case 32768:case 65536:case 131072:case 262144:case 524288:case 1048576:case 2097152:return e&4194240;case 4194304:case 8388608:case 16777216:case 33554432:case 67108864:return e&130023424;case 134217728:return 134217728;case 268435456:return 268435456;case 536870912:return 536870912;case 1073741824:return 1073741824;default:return e}}function Kr(e,t){var n=e.pendingLanes;if(n===0)return 0;var r=0,o=e.suspendedLanes,l=e.pingedLanes,i=n&268435455;if(i!==0){var u=i&~o;u!==0?r=Nn(u):(l&=i,l!==0&&(r=Nn(l)))}else i=n&~o,i!==0?r=Nn(i):l!==0&&(r=Nn(l));if(r===0)return 0;if(t!==0&&t!==r&&!(t&o)&&(o=r&-r,l=t&-t,o>=l||o===16&&(l&4194240)!==0))return t;if(r&4&&(r|=n&16),t=e.entangledLanes,t!==0)for(e=e.entanglements,t&=r;0<t;)n=31-Oe(t),o=1<<n,r|=e[n],t&=~o;return r}function Dd(e,t){switch(e){case 1:case 2:case 4:return t+250;case 8:case 16:case 32:case 64:case 128:case 256:case 512:case 1024:case 2048:case 4096:case 8192:case 16384:case 32768:case 65536:case 131072:case 262144:case 524288:case 1048576:case 2097152:return t+5e3;case 4194304:case 8388608:case 16777216:case 33554432:case 67108864:return-1;case 134217728:case 268435456:case 536870912:case 1073741824:return-1;default:return-1}}function Md(e,t){for(var n=e.suspendedLanes,r=e.pingedLanes,o=e.expirationTimes,l=e.pendingLanes;0<l;){var i=31-Oe(l),u=1<<i,s=o[i];s===-1?(!(u&n)||u&r)&&(o[i]=Dd(u,t)):s<=t&&(e.expiredLanes|=u),l&=~u}}function Al(e){return e=e.pendingLanes&-1073741825,e!==0?e:e&1073741824?1073741824:0}function na(){var e=Sr;return Sr<<=1,!(Sr&4194240)&&(Sr=64),e}function Jo(e){for(var t=[],n=0;31>n;n++)t.push(e);return t}function tr(e,t,n){e.pendingLanes|=t,t!==536870912&&(e.suspendedLanes=0,e.pingedLanes=0),e=e.eventTimes,t=31-Oe(t),e[t]=n}function jd(e,t){var n=e.pendingLanes&~t;e.pendingLanes=t,e.suspendedLanes=0,e.pingedLanes=0,e.expiredLanes&=t,e.mutableReadLanes&=t,e.entangledLanes&=t,t=e.entanglements;var r=e.eventTimes;for(e=e.expirationTimes;0<n;){var o=31-Oe(n),l=1<<o;t[o]=0,r[o]=-1,e[o]=-1,n&=~l}}function hi(e,t){var n=e.entangledLanes|=t;for(e=e.entanglements;n;){var r=31-Oe(n),o=1<<r;o&t|e[r]&t&&(e[r]|=t),n&=~o}}var A=0;function ra(e){return e&=-e,1<e?4<e?e&268435455?16:536870912:4:1}var oa,gi,la,ia,ua,Ll=!1,Er=[],it=null,ut=null,st=null,Hn=new Map,Bn=new Map,nt=[],Ud="mousedown mouseup touchcancel touchend touchstart auxclick dblclick pointercancel pointerdown pointerup dragend dragstart drop compositionend compositionstart keydown keypress keyup input textInput copy cut paste click change contextmenu reset submit".split(" ");function ju(e,t){switch(e){case"focusin":case"focusout":it=null;break;case"dragenter":case"dragleave":ut=null;break;case"mouseover":case"mouseout":st=null;break;case"pointerover":case"pointerout":Hn.delete(t.pointerId);break;case"gotpointercapture":case"lostpointercapture":Bn.delete(t.pointerId)}}function yn(e,t,n,r,o,l){return e===null||e.nativeEvent!==l?(e={blockedOn:t,domEventName:n,eventSystemFlags:r,nativeEvent:l,targetContainers:[o]},t!==null&&(t=rr(t),t!==null&&gi(t)),e):(e.eventSystemFlags|=r,t=e.targetContainers,o!==null&&t.indexOf(o)===-1&&t.push(o),e)}function Fd(e,t,n,r,o){switch(t){case"focusin":return it=yn(it,e,t,n,r,o),!0;case"dragenter":return ut=yn(ut,e,t,n,r,o),!0;case"mouseover":return st=yn(st,e,t,n,r,o),!0;case"pointerover":var l=o.pointerId;return Hn.set(l,yn(Hn.get(l)||null,e,t,n,r,o)),!0;case"gotpointercapture":return l=o.pointerId,Bn.set(l,yn(Bn.get(l)||null,e,t,n,r,o)),!0}return!1}function sa(e){var t=kt(e.target);if(t!==null){var n=Lt(t);if(n!==null){if(t=n.tag,t===13){if(t=qs(n),t!==null){e.blockedOn=t,ua(e.priority,function(){la(n)});return}}else if(t===3&&n.stateNode.current.memoizedState.isDehydrated){e.blockedOn=n.tag===3?n.stateNode.containerInfo:null;return}}}e.blockedOn=null}function Dr(e){if(e.blockedOn!==null)return!1;for(var t=e.targetContainers;0<t.length;){var n=zl(e.domEventName,e.eventSystemFlags,t[0],e.nativeEvent);if(n===null){n=e.nativeEvent;var r=new n.constructor(n.type,n);Rl=r,n.target.dispatchEvent(r),Rl=null}else return t=rr(n),t!==null&&gi(t),e.blockedOn=n,!1;t.shift()}return!0}function Uu(e,t,n){Dr(e)&&n.delete(t)}function Wd(){Ll=!1,it!==null&&Dr(it)&&(it=null),ut!==null&&Dr(ut)&&(ut=null),st!==null&&Dr(st)&&(st=null),Hn.forEach(Uu),Bn.forEach(Uu)}function Sn(e,t){e.blockedOn===t&&(e.blockedOn=null,Ll||(Ll=!0,he.unstable_scheduleCallback(he.unstable_NormalPriority,Wd)))}function Vn(e){function t(o){return Sn(o,e)}if(0<Er.length){Sn(Er[0],e);for(var n=1;n<Er.length;n++){var r=Er[n];r.blockedOn===e&&(r.blockedOn=null)}}for(it!==null&&Sn(it,e),ut!==null&&Sn(ut,e),st!==null&&Sn(st,e),Hn.forEach(t),Bn.forEach(t),n=0;n<nt.length;n++)r=nt[n],r.blockedOn===e&&(r.blockedOn=null);for(;0<nt.length&&(n=nt[0],n.blockedOn===null);)sa(n),n.blockedOn===null&&nt.shift()}var en=qe.ReactCurrentBatchConfig,qr=!0;function Hd(e,t,n,r){var o=A,l=en.transition;en.transition=null;try{A=1,yi(e,t,n,r)}finally{A=o,en.transition=l}}function Bd(e,t,n,r){var o=A,l=en.transition;en.transition=null;try{A=4,yi(e,t,n,r)}finally{A=o,en.transition=l}}function yi(e,t,n,r){if(qr){var o=zl(e,t,n,r);if(o===null)ll(e,t,r,Zr,n),ju(e,r);else if(Fd(o,e,t,n,r))r.stopPropagation();else if(ju(e,r),t&4&&-1<Ud.indexOf(e)){for(;o!==null;){var l=rr(o);if(l!==null&&oa(l),l=zl(e,t,n,r),l===null&&ll(e,t,r,Zr,n),l===o)break;o=l}o!==null&&r.stopPropagation()}else ll(e,t,r,null,n)}}var Zr=null;function zl(e,t,n,r){if(Zr=null,e=mi(r),e=kt(e),e!==null)if(t=Lt(e),t===null)e=null;else if(n=t.tag,n===13){if(e=qs(t),e!==null)return e;e=null}else if(n===3){if(t.stateNode.current.memoizedState.isDehydrated)return t.tag===3?t.stateNode.containerInfo:null;e=null}else t!==e&&(e=null);return Zr=e,null}function aa(e){switch(e){case"cancel":case"click":case"close":case"contextmenu":case"copy":case"cut":case"auxclick":case"dblclick":case"dragend":case"dragstart":case"drop":case"focusin":case"focusout":case"input":case"invalid":case"keydown":case"keypress":case"keyup":case"mousedown":case"mouseup":case"paste":case"pause":case"play":case"pointercancel":case"pointerdown":case"pointerup":case"ratechange":case"reset":case"resize":case"seeked":case"submit":case"touchcancel":case"touchend":case"touchstart":case"volumechange":case"change":case"selectionchange":case"textInput":case"compositionstart":case"compositionend":case"compositionupdate":case"beforeblur":case"afterblur":case"beforeinput":case"blur":case"fullscreenchange":case"focus":case"hashchange":case"popstate":case"select":case"selectstart":return 1;case"drag":case"dragenter":case"dragexit":case"dragleave":case"dragover":case"mousemove":case"mouseout":case"mouseover":case"pointermove":case"pointerout":case"pointerover":case"scroll":case"toggle":case"touchmove":case"wheel":case"mouseenter":case"mouseleave":case"pointerenter":case"pointerleave":return 4;case"message":switch(Pd()){case vi:return 1;case ea:return 4;case Xr:case Id:return 16;case ta:return 536870912;default:return 16}default:return 16}}var ot=null,Si=null,Mr=null;function ca(){if(Mr)return Mr;var e,t=Si,n=t.length,r,o="value"in ot?ot.value:ot.textContent,l=o.length;for(e=0;e<n&&t[e]===o[e];e++);var i=n-e;for(r=1;r<=i&&t[n-r]===o[l-r];r++);return Mr=o.slice(e,1<r?1-r:void 0)}function jr(e){var t=e.keyCode;return"charCode"in e?(e=e.charCode,e===0&&t===13&&(e=13)):e=t,e===10&&(e=13),32<=e||e===13?e:0}function kr(){return!0}function Fu(){return!1}function ge(e){function t(n,r,o,l,i){this._reactName=n,this._targetInst=o,this.type=r,this.nativeEvent=l,this.target=i,this.currentTarget=null;for(var u in e)e.hasOwnProperty(u)&&(n=e[u],this[u]=n?n(l):l[u]);return this.isDefaultPrevented=(l.defaultPrevented!=null?l.defaultPrevented:l.returnValue===!1)?kr:Fu,this.isPropagationStopped=Fu,this}return W(t.prototype,{preventDefault:function(){this.defaultPrevented=!0;var n=this.nativeEvent;n&&(n.preventDefault?n.preventDefault():typeof n.returnValue!="unknown"&&(n.returnValue=!1),this.isDefaultPrevented=kr)},stopPropagation:function(){var n=this.nativeEvent;n&&(n.stopPropagation?n.stopPropagation():typeof n.cancelBubble!="unknown"&&(n.cancelBubble=!0),this.isPropagationStopped=kr)},persist:function(){},isPersistent:kr}),t}var dn={eventPhase:0,bubbles:0,cancelable:0,timeStamp:function(e){return e.timeStamp||Date.now()},defaultPrevented:0,isTrusted:0},wi=ge(dn),nr=W({},dn,{view:0,detail:0}),Vd=ge(nr),bo,el,wn,go=W({},nr,{screenX:0,screenY:0,clientX:0,clientY:0,pageX:0,pageY:0,ctrlKey:0,shiftKey:0,altKey:0,metaKey:0,getModifierState:Ei,button:0,buttons:0,relatedTarget:function(e){return e.relatedTarget===void 0?e.fromElement===e.srcElement?e.toElement:e.fromElement:e.relatedTarget},movementX:function(e){return"movementX"in e?e.movementX:(e!==wn&&(wn&&e.type==="mousemove"?(bo=e.screenX-wn.screenX,el=e.screenY-wn.screenY):el=bo=0,wn=e),bo)},movementY:function(e){return"movementY"in e?e.movementY:el}}),Wu=ge(go),Gd=W({},go,{dataTransfer:0}),$d=ge(Gd),Qd=W({},nr,{relatedTarget:0}),tl=ge(Qd),Yd=W({},dn,{animationName:0,elapsedTime:0,pseudoElement:0}),Xd=ge(Yd),Kd=W({},dn,{clipboardData:function(e){return"clipboardData"in e?e.clipboardData:window.clipboardData}}),qd=ge(Kd),Zd=W({},dn,{data:0}),Hu=ge(Zd),Jd={Esc:"Escape",Spacebar:" ",Left:"ArrowLeft",Up:"ArrowUp",Right:"ArrowRight",Down:"ArrowDown",Del:"Delete",Win:"OS",Menu:"ContextMenu",Apps:"ContextMenu",Scroll:"ScrollLock",MozPrintableKey:"Unidentified"},bd={8:"Backspace",9:"Tab",12:"Clear",13:"Enter",16:"Shift",17:"Control",18:"Alt",19:"Pause",20:"CapsLock",27:"Escape",32:" ",33:"PageUp",34:"PageDown",35:"End",36:"Home",37:"ArrowLeft",38:"ArrowUp",39:"ArrowRight",40:"ArrowDown",45:"Insert",46:"Delete",112:"F1",113:"F2",114:"F3",115:"F4",116:"F5",117:"F6",118:"F7",119:"F8",120:"F9",121:"F10",122:"F11",123:"F12",144:"NumLock",145:"ScrollLock",224:"Meta"},ep={Alt:"altKey",Control:"ctrlKey",Meta:"metaKey",Shift:"shiftKey"};function tp(e){var t=this.nativeEvent;return t.getModifierState?t.getModifierState(e):(e=ep[e])?!!t[e]:!1}function Ei(){return tp}var np=W({},nr,{key:function(e){if(e.key){var t=Jd[e.key]||e.key;if(t!=="Unidentified")return t}return e.type==="keypress"?(e=jr(e),e===13?"Enter":String.fromCharCode(e)):e.type==="keydown"||e.type==="keyup"?bd[e.keyCode]||"Unidentified":""},code:0,location:0,ctrlKey:0,shiftKey:0,altKey:0,metaKey:0,repeat:0,locale:0,getModifierState:Ei,charCode:function(e){return e.type==="keypress"?jr(e):0},keyCode:function(e){return e.type==="keydown"||e.type==="keyup"?e.keyCode:0},which:function(e){return e.type==="keypress"?jr(e):e.type==="keydown"||e.type==="keyup"?e.keyCode:0}}),rp=ge(np),op=W({},go,{pointerId:0,width:0,height:0,pressure:0,tangentialPressure:0,tiltX:0,tiltY:0,twist:0,pointerType:0,isPrimary:0}),Bu=ge(op),lp=W({},nr,{touches:0,targetTouches:0,changedTouches:0,altKey:0,metaKey:0,ctrlKey:0,shiftKey:0,getModifierState:Ei}),ip=ge(lp),up=W({},dn,{propertyName:0,elapsedTime:0,pseudoElement:0}),sp=ge(up),ap=W({},go,{deltaX:function(e){return"deltaX"in e?e.deltaX:"wheelDeltaX"in e?-e.wheelDeltaX:0},deltaY:function(e){return"deltaY"in e?e.deltaY:"wheelDeltaY"in e?-e.wheelDeltaY:"wheelDelta"in e?-e.wheelDelta:0},deltaZ:0,deltaMode:0}),cp=ge(ap),dp=[9,13,27,32],ki=Qe&&"CompositionEvent"in window,On=null;Qe&&"documentMode"in document&&(On=document.documentMode);var pp=Qe&&"TextEvent"in window&&!On,da=Qe&&(!ki||On&&8<On&&11>=On),Vu=" ",Gu=!1;function pa(e,t){switch(e){case"keyup":return dp.indexOf(t.keyCode)!==-1;case"keydown":return t.keyCode!==229;case"keypress":case"mousedown":case"focusout":return!0;default:return!1}}function fa(e){return e=e.detail,typeof e=="object"&&"data"in e?e.data:null}var Ht=!1;function fp(e,t){switch(e){case"compositionend":return fa(t);case"keypress":return t.which!==32?null:(Gu=!0,Vu);case"textInput":return e=t.data,e===Vu&&Gu?null:e;default:return null}}function mp(e,t){if(Ht)return e==="compositionend"||!ki&&pa(e,t)?(e=ca(),Mr=Si=ot=null,Ht=!1,e):null;switch(e){case"paste":return null;case"keypress":if(!(t.ctrlKey||t.altKey||t.metaKey)||t.ctrlKey&&t.altKey){if(t.char&&1<t.char.length)return t.char;if(t.which)return String.fromCharCode(t.which)}return null;case"compositionend":return da&&t.locale!=="ko"?null:t.data;default:return null}}var vp={color:!0,date:!0,datetime:!0,"datetime-local":!0,email:!0,month:!0,number:!0,password:!0,range:!0,search:!0,tel:!0,text:!0,time:!0,url:!0,week:!0};function $u(e){var t=e&&e.nodeName&&e.nodeName.toLowerCase();return t==="input"?!!vp[e.type]:t==="textarea"}function ma(e,t,n,r){$s(r),t=Jr(t,"onChange"),0<t.length&&(n=new wi("onChange","change",null,n,r),e.push({event:n,listeners:t}))}var An=null,Gn=null;function hp(e){_a(e,0)}function yo(e){var t=Gt(e);if(Us(t))return e}function gp(e,t){if(e==="change")return t}var va=!1;Qe&&(Qe?(xr="oninput"in document,xr||(nl=document.createElement("div"),nl.setAttribute("oninput","return;"),xr=typeof nl.oninput=="function"),Cr=xr):Cr=!1,va=Cr&&(!document.documentMode||9<document.documentMode));var Cr,xr,nl;function Qu(){An&&(An.detachEvent("onpropertychange",ha),Gn=An=null)}function ha(e){if(e.propertyName==="value"&&yo(Gn)){var t=[];ma(t,Gn,e,mi(e)),Ks(hp,t)}}function yp(e,t,n){e==="focusin"?(Qu(),An=t,Gn=n,An.attachEvent("onpropertychange",ha)):e==="focusout"&&Qu()}function Sp(e){if(e==="selectionchange"||e==="keyup"||e==="keydown")return yo(Gn)}function wp(e,t){if(e==="click")return yo(t)}function Ep(e,t){if(e==="input"||e==="change")return yo(t)}function kp(e,t){return e===t&&(e!==0||1/e===1/t)||e!==e&&t!==t}var Le=typeof Object.is=="function"?Object.is:kp;function $n(e,t){if(Le(e,t))return!0;if(typeof e!="object"||e===null||typeof t!="object"||t===null)return!1;var n=Object.keys(e),r=Object.keys(t);if(n.length!==r.length)return!1;for(r=0;r<n.length;r++){var o=n[r];if(!hl.call(t,o)||!Le(e[o],t[o]))return!1}return!0}function Yu(e){for(;e&&e.firstChild;)e=e.firstChild;return e}function Xu(e,t){var n=Yu(e);e=0;for(var r;n;){if(n.nodeType===3){if(r=e+n.textContent.length,e<=t&&r>=t)return{node:n,offset:t-e};e=r}e:{for(;n;){if(n.nextSibling){n=n.nextSibling;break e}n=n.parentNode}n=void 0}n=Yu(n)}}function ga(e,t){return e&&t?e===t?!0:e&&e.nodeType===3?!1:t&&t.nodeType===3?ga(e,t.parentNode):"contains"in e?e.contains(t):e.compareDocumentPosition?!!(e.compareDocumentPosition(t)&16):!1:!1}function ya(){for(var e=window,t=$r();t instanceof e.HTMLIFrameElement;){try{var n=typeof t.contentWindow.location.href=="string"}catch{n=!1}if(n)e=t.contentWindow;else break;t=$r(e.document)}return t}function Ci(e){var t=e&&e.nodeName&&e.nodeName.toLowerCase();return t&&(t==="input"&&(e.type==="text"||e.type==="search"||e.type==="tel"||e.type==="url"||e.type==="password")||t==="textarea"||e.contentEditable==="true")}function Cp(e){var t=ya(),n=e.focusedElem,r=e.selectionRange;if(t!==n&&n&&n.ownerDocument&&ga(n.ownerDocument.documentElement,n)){if(r!==null&&Ci(n)){if(t=r.start,e=r.end,e===void 0&&(e=t),"selectionStart"in n)n.selectionStart=t,n.selectionEnd=Math.min(e,n.value.length);else if(e=(t=n.ownerDocument||document)&&t.defaultView||window,e.getSelection){e=e.getSelection();var o=n.textContent.length,l=Math.min(r.start,o);r=r.end===void 0?l:Math.min(r.end,o),!e.extend&&l>r&&(o=r,r=l,l=o),o=Xu(n,l);var i=Xu(n,r);o&&i&&(e.rangeCount!==1||e.anchorNode!==o.node||e.anchorOffset!==o.offset||e.focusNode!==i.node||e.focusOffset!==i.offset)&&(t=t.createRange(),t.setStart(o.node,o.offset),e.removeAllRanges(),l>r?(e.addRange(t),e.extend(i.node,i.offset)):(t.setEnd(i.node,i.offset),e.addRange(t)))}}for(t=[],e=n;e=e.parentNode;)e.nodeType===1&&t.push({element:e,left:e.scrollLeft,top:e.scrollTop});for(typeof n.focus=="function"&&n.focus(),n=0;n<t.length;n++)e=t[n],e.element.scrollLeft=e.left,e.element.scrollTop=e.top}}var xp=Qe&&"documentMode"in document&&11>=document.documentMode,Bt=null,Dl=null,Ln=null,Ml=!1;function Ku(e,t,n){var r=n.window===n?n.document:n.nodeType===9?n:n.ownerDocument;Ml||Bt==null||Bt!==$r(r)||(r=Bt,"selectionStart"in r&&Ci(r)?r={start:r.selectionStart,end:r.selectionEnd}:(r=(r.ownerDocument&&r.ownerDocument.defaultView||window).getSelection(),r={anchorNode:r.anchorNode,anchorOffset:r.anchorOffset,focusNode:r.focusNode,focusOffset:r.focusOffset}),Ln&&$n(Ln,r)||(Ln=r,r=Jr(Dl,"onSelect"),0<r.length&&(t=new wi("onSelect","select",null,t,n),e.push({event:t,listeners:r}),t.target=Bt)))}function _r(e,t){var n={};return n[e.toLowerCase()]=t.toLowerCase(),n["Webkit"+e]="webkit"+t,n["Moz"+e]="moz"+t,n}var Vt={animationend:_r("Animation","AnimationEnd"),animationiteration:_r("Animation","AnimationIteration"),animationstart:_r("Animation","AnimationStart"),transitionend:_r("Transition","TransitionEnd")},rl={},Sa={};Qe&&(Sa=document.createElement("div").style,"AnimationEvent"in window||(delete Vt.animationend.animation,delete Vt.animationiteration.animation,delete Vt.animationstart.animation),"TransitionEvent"in window||delete Vt.transitionend.transition);function So(e){if(rl[e])return rl[e];if(!Vt[e])return e;var t=Vt[e],n;for(n in t)if(t.hasOwnProperty(n)&&n in Sa)return rl[e]=t[n];return e}var wa=So("animationend"),Ea=So("animationiteration"),ka=So("animationstart"),Ca=So("transitionend"),xa=new Map,qu="abort auxClick cancel canPlay canPlayThrough click close contextMenu copy cut drag dragEnd dragEnter dragExit dragLeave dragOver dragStart drop durationChange emptied encrypted ended error gotPointerCapture input invalid keyDown keyPress keyUp load loadedData loadedMetadata loadStart lostPointerCapture mouseDown mouseMove mouseOut mouseOver mouseUp paste pause play playing pointerCancel pointerDown pointerMove pointerOut pointerOver pointerUp progress rateChange reset resize seeked seeking stalled submit suspend timeUpdate touchCancel touchEnd touchStart volumeChange scroll toggle touchMove waiting wheel".split(" ");function ht(e,t){xa.set(e,t),At(t,[e])}for(Tr=0;Tr<qu.length;Tr++)Nr=qu[Tr],Zu=Nr.toLowerCase(),Ju=Nr[0].toUpperCase()+Nr.slice(1),ht(Zu,"on"+Ju);var Nr,Zu,Ju,Tr;ht(wa,"onAnimationEnd");ht(Ea,"onAnimationIteration");ht(ka,"onAnimationStart");ht("dblclick","onDoubleClick");ht("focusin","onFocus");ht("focusout","onBlur");ht(Ca,"onTransitionEnd");rn("onMouseEnter",["mouseout","mouseover"]);rn("onMouseLeave",["mouseout","mouseover"]);rn("onPointerEnter",["pointerout","pointerover"]);rn("onPointerLeave",["pointerout","pointerover"]);At("onChange","change click focusin focusout input keydown keyup selectionchange".split(" "));At("onSelect","focusout contextmenu dragend focusin keydown keyup mousedown mouseup selectionchange".split(" "));At("onBeforeInput",["compositionend","keypress","textInput","paste"]);At("onCompositionEnd","compositionend focusout keydown keypress keyup mousedown".split(" "));At("onCompositionStart","compositionstart focusout keydown keypress keyup mousedown".split(" "));At("onCompositionUpdate","compositionupdate focusout keydown keypress keyup mousedown".split(" "));var Rn="abort canplay canplaythrough durationchange emptied encrypted ended error loadeddata loadedmetadata loadstart pause play playing progress ratechange resize seeked seeking stalled suspend timeupdate volumechange waiting".split(" "),_p=new Set("cancel close invalid load scroll toggle".split(" ").concat(Rn));function bu(e,t,n){var r=e.type||"unknown-event";e.currentTarget=n,_d(r,t,void 0,e),e.currentTarget=null}function _a(e,t){t=(t&4)!==0;for(var n=0;n<e.length;n++){var r=e[n],o=r.event;r=r.listeners;e:{var l=void 0;if(t)for(var i=r.length-1;0<=i;i--){var u=r[i],s=u.instance,c=u.currentTarget;if(u=u.listener,s!==l&&o.isPropagationStopped())break e;bu(o,u,c),l=s}else for(i=0;i<r.length;i++){if(u=r[i],s=u.instance,c=u.currentTarget,u=u.listener,s!==l&&o.isPropagationStopped())break e;bu(o,u,c),l=s}}}if(Yr)throw e=Ol,Yr=!1,Ol=null,e}function D(e,t){var n=t[Hl];n===void 0&&(n=t[Hl]=new Set);var r=e+"__bubble";n.has(r)||(Ta(t,e,2,!1),n.add(r))}function ol(e,t,n){var r=0;t&&(r|=4),Ta(n,e,r,t)}var Rr="_reactListening"+Math.random().toString(36).slice(2);function Qn(e){if(!e[Rr]){e[Rr]=!0,Ls.forEach(function(n){n!=="selectionchange"&&(_p.has(n)||ol(n,!1,e),ol(n,!0,e))});var t=e.nodeType===9?e:e.ownerDocument;t===null||t[Rr]||(t[Rr]=!0,ol("selectionchange",!1,t))}}function Ta(e,t,n,r){switch(aa(t)){case 1:var o=Hd;break;case 4:o=Bd;break;default:o=yi}n=o.bind(null,t,n,e),o=void 0,!Il||t!=="touchstart"&&t!=="touchmove"&&t!=="wheel"||(o=!0),r?o!==void 0?e.addEventListener(t,n,{capture:!0,passive:o}):e.addEventListener(t,n,!0):o!==void 0?e.addEventListener(t,n,{passive:o}):e.addEventListener(t,n,!1)}function ll(e,t,n,r,o){var l=r;if(!(t&1)&&!(t&2)&&r!==null)e:for(;;){if(r===null)return;var i=r.tag;if(i===3||i===4){var u=r.stateNode.containerInfo;if(u===o||u.nodeType===8&&u.parentNode===o)break;if(i===4)for(i=r.return;i!==null;){var s=i.tag;if((s===3||s===4)&&(s=i.stateNode.containerInfo,s===o||s.nodeType===8&&s.parentNode===o))return;i=i.return}for(;u!==null;){if(i=kt(u),i===null)return;if(s=i.tag,s===5||s===6){r=l=i;continue e}u=u.parentNode}}r=r.return}Ks(function(){var c=l,v=mi(n),h=[];e:{var m=xa.get(e);if(m!==void 0){var w=wi,k=e;switch(e){case"keypress":if(jr(n)===0)break e;case"keydown":case"keyup":w=rp;break;case"focusin":k="focus",w=tl;break;case"focusout":k="blur",w=tl;break;case"beforeblur":case"afterblur":w=tl;break;case"click":if(n.button===2)break e;case"auxclick":case"dblclick":case"mousedown":case"mousemove":case"mouseup":case"mouseout":case"mouseover":case"contextmenu":w=Wu;break;case"drag":case"dragend":case"dragenter":case"dragexit":case"dragleave":case"dragover":case"dragstart":case"drop":w=$d;break;case"touchcancel":case"touchend":case"touchmove":case"touchstart":w=ip;break;case wa:case Ea:case ka:w=Xd;break;case Ca:w=sp;break;case"scroll":w=Vd;break;case"wheel":w=cp;break;case"copy":case"cut":case"paste":w=qd;break;case"gotpointercapture":case"lostpointercapture":case"pointercancel":case"pointerdown":case"pointermove":case"pointerout":case"pointerover":case"pointerup":w=Bu}var C=(t&4)!==0,B=!C&&e==="scroll",d=C?m!==null?m+"Capture":null:m;C=[];for(var a=c,p;a!==null;){p=a;var y=p.stateNode;if(p.tag===5&&y!==null&&(p=y,d!==null&&(y=Wn(a,d),y!=null&&C.push(Yn(a,y,p)))),B)break;a=a.return}0<C.length&&(m=new w(m,k,null,n,v),h.push({event:m,listeners:C}))}}if(!(t&7)){e:{if(m=e==="mouseover"||e==="pointerover",w=e==="mouseout"||e==="pointerout",m&&n!==Rl&&(k=n.relatedTarget||n.fromElement)&&(kt(k)||k[Ye]))break e;if((w||m)&&(m=v.window===v?v:(m=v.ownerDocument)?m.defaultView||m.parentWindow:window,w?(k=n.relatedTarget||n.toElement,w=c,k=k?kt(k):null,k!==null&&(B=Lt(k),k!==B||k.tag!==5&&k.tag!==6)&&(k=null)):(w=null,k=c),w!==k)){if(C=Wu,y="onMouseLeave",d="onMouseEnter",a="mouse",(e==="pointerout"||e==="pointerover")&&(C=Bu,y="onPointerLeave",d="onPointerEnter",a="pointer"),B=w==null?m:Gt(w),p=k==null?m:Gt(k),m=new C(y,a+"leave",w,n,v),m.target=B,m.relatedTarget=p,y=null,kt(v)===c&&(C=new C(d,a+"enter",k,n,v),C.target=p,C.relatedTarget=B,y=C),B=y,w&&k)t:{for(C=w,d=k,a=0,p=C;p;p=Ut(p))a++;for(p=0,y=d;y;y=Ut(y))p++;for(;0<a-p;)C=Ut(C),a--;for(;0<p-a;)d=Ut(d),p--;for(;a--;){if(C===d||d!==null&&C===d.alternate)break t;C=Ut(C),d=Ut(d)}C=null}else C=null;w!==null&&es(h,m,w,C,!1),k!==null&&B!==null&&es(h,B,k,C,!0)}}e:{if(m=c?Gt(c):window,w=m.nodeName&&m.nodeName.toLowerCase(),w==="select"||w==="input"&&m.type==="file")var x=gp;else if($u(m))if(va)x=Ep;else{x=Sp;var _=yp}else(w=m.nodeName)&&w.toLowerCase()==="input"&&(m.type==="checkbox"||m.type==="radio")&&(x=wp);if(x&&(x=x(e,c))){ma(h,x,n,v);break e}_&&_(e,m,c),e==="focusout"&&(_=m._wrapperState)&&_.controlled&&m.type==="number"&&Cl(m,"number",m.value)}switch(_=c?Gt(c):window,e){case"focusin":($u(_)||_.contentEditable==="true")&&(Bt=_,Dl=c,Ln=null);break;case"focusout":Ln=Dl=Bt=null;break;case"mousedown":Ml=!0;break;case"contextmenu":case"mouseup":case"dragend":Ml=!1,Ku(h,n,v);break;case"selectionchange":if(xp)break;case"keydown":case"keyup":Ku(h,n,v)}var T;if(ki)e:{switch(e){case"compositionstart":var N="onCompositionStart";break e;case"compositionend":N="onCompositionEnd";break e;case"compositionupdate":N="onCompositionUpdate";break e}N=void 0}else Ht?pa(e,n)&&(N="onCompositionEnd"):e==="keydown"&&n.keyCode===229&&(N="onCompositionStart");N&&(da&&n.locale!=="ko"&&(Ht||N!=="onCompositionStart"?N==="onCompositionEnd"&&Ht&&(T=ca()):(ot=v,Si="value"in ot?ot.value:ot.textContent,Ht=!0)),_=Jr(c,N),0<_.length&&(N=new Hu(N,e,null,n,v),h.push({event:N,listeners:_}),T?N.data=T:(T=fa(n),T!==null&&(N.data=T)))),(T=pp?fp(e,n):mp(e,n))&&(c=Jr(c,"onBeforeInput"),0<c.length&&(v=new Hu("onBeforeInput","beforeinput",null,n,v),h.push({event:v,listeners:c}),v.data=T))}_a(h,t)})}function Yn(e,t,n){return{instance:e,listener:t,currentTarget:n}}function Jr(e,t){for(var n=t+"Capture",r=[];e!==null;){var o=e,l=o.stateNode;o.tag===5&&l!==null&&(o=l,l=Wn(e,n),l!=null&&r.unshift(Yn(e,l,o)),l=Wn(e,t),l!=null&&r.push(Yn(e,l,o))),e=e.return}return r}function Ut(e){if(e===null)return null;do e=e.return;while(e&&e.tag!==5);return e||null}function es(e,t,n,r,o){for(var l=t._reactName,i=[];n!==null&&n!==r;){var u=n,s=u.alternate,c=u.stateNode;if(s!==null&&s===r)break;u.tag===5&&c!==null&&(u=c,o?(s=Wn(n,l),s!=null&&i.unshift(Yn(n,s,u))):o||(s=Wn(n,l),s!=null&&i.push(Yn(n,s,u)))),n=n.return}i.length!==0&&e.push({event:t,listeners:i})}var Tp=/\r\n?/g,Np=/\u0000|\uFFFD/g;function ts(e){return(typeof e=="string"?e:""+e).replace(Tp,`
`).replace(Np,"")}function Pr(e,t,n){if(t=ts(t),ts(e)!==t&&n)throw Error(g(425))}function br(){}var jl=null,Ul=null;function Fl(e,t){return e==="textarea"||e==="noscript"||typeof t.children=="string"||typeof t.children=="number"||typeof t.dangerouslySetInnerHTML=="object"&&t.dangerouslySetInnerHTML!==null&&t.dangerouslySetInnerHTML.__html!=null}var Wl=typeof setTimeout=="function"?setTimeout:void 0,Rp=typeof clearTimeout=="function"?clearTimeout:void 0,ns=typeof Promise=="function"?Promise:void 0,Pp=typeof queueMicrotask=="function"?queueMicrotask:typeof ns!="undefined"?function(e){return ns.resolve(null).then(e).catch(Ip)}:Wl;function Ip(e){setTimeout(function(){throw e})}function il(e,t){var n=t,r=0;do{var o=n.nextSibling;if(e.removeChild(n),o&&o.nodeType===8)if(n=o.data,n==="/$"){if(r===0){e.removeChild(o),Vn(t);return}r--}else n!=="$"&&n!=="$?"&&n!=="$!"||r++;n=o}while(n);Vn(t)}function at(e){for(;e!=null;e=e.nextSibling){var t=e.nodeType;if(t===1||t===3)break;if(t===8){if(t=e.data,t==="$"||t==="$!"||t==="$?")break;if(t==="/$")return null}}return e}function rs(e){e=e.previousSibling;for(var t=0;e;){if(e.nodeType===8){var n=e.data;if(n==="$"||n==="$!"||n==="$?"){if(t===0)return e;t--}else n==="/$"&&t++}e=e.previousSibling}return null}var pn=Math.random().toString(36).slice(2),je="__reactFiber$"+pn,Xn="__reactProps$"+pn,Ye="__reactContainer$"+pn,Hl="__reactEvents$"+pn,Op="__reactListeners$"+pn,Ap="__reactHandles$"+pn;function kt(e){var t=e[je];if(t)return t;for(var n=e.parentNode;n;){if(t=n[Ye]||n[je]){if(n=t.alternate,t.child!==null||n!==null&&n.child!==null)for(e=rs(e);e!==null;){if(n=e[je])return n;e=rs(e)}return t}e=n,n=e.parentNode}return null}function rr(e){return e=e[je]||e[Ye],!e||e.tag!==5&&e.tag!==6&&e.tag!==13&&e.tag!==3?null:e}function Gt(e){if(e.tag===5||e.tag===6)return e.stateNode;throw Error(g(33))}function wo(e){return e[Xn]||null}var Bl=[],$t=-1;function gt(e){return{current:e}}function M(e){0>$t||(e.current=Bl[$t],Bl[$t]=null,$t--)}function z(e,t){$t++,Bl[$t]=e.current,e.current=t}var vt={},re=gt(vt),ce=gt(!1),Nt=vt;function on(e,t){var n=e.type.contextTypes;if(!n)return vt;var r=e.stateNode;if(r&&r.__reactInternalMemoizedUnmaskedChildContext===t)return r.__reactInternalMemoizedMaskedChildContext;var o={},l;for(l in n)o[l]=t[l];return r&&(e=e.stateNode,e.__reactInternalMemoizedUnmaskedChildContext=t,e.__reactInternalMemoizedMaskedChildContext=o),o}function de(e){return e=e.childContextTypes,e!=null}function eo(){M(ce),M(re)}function os(e,t,n){if(re.current!==vt)throw Error(g(168));z(re,t),z(ce,n)}function Na(e,t,n){var r=e.stateNode;if(t=t.childContextTypes,typeof r.getChildContext!="function")return n;r=r.getChildContext();for(var o in r)if(!(o in t))throw Error(g(108,yd(e)||"Unknown",o));return W({},n,r)}function to(e){return e=(e=e.stateNode)&&e.__reactInternalMemoizedMergedChildContext||vt,Nt=re.current,z(re,e),z(ce,ce.current),!0}function ls(e,t,n){var r=e.stateNode;if(!r)throw Error(g(169));n?(e=Na(e,t,Nt),r.__reactInternalMemoizedMergedChildContext=e,M(ce),M(re),z(re,e)):M(ce),z(ce,n)}var Be=null,Eo=!1,ul=!1;function Ra(e){Be===null?Be=[e]:Be.push(e)}function Lp(e){Eo=!0,Ra(e)}function yt(){if(!ul&&Be!==null){ul=!0;var e=0,t=A;try{var n=Be;for(A=1;e<n.length;e++){var r=n[e];do r=r(!0);while(r!==null)}Be=null,Eo=!1}catch(o){throw Be!==null&&(Be=Be.slice(e+1)),bs(vi,yt),o}finally{A=t,ul=!1}}return null}var Qt=[],Yt=0,no=null,ro=0,we=[],Ee=0,Rt=null,Ve=1,Ge="";function wt(e,t){Qt[Yt++]=ro,Qt[Yt++]=no,no=e,ro=t}function Pa(e,t,n){we[Ee++]=Ve,we[Ee++]=Ge,we[Ee++]=Rt,Rt=e;var r=Ve;e=Ge;var o=32-Oe(r)-1;r&=~(1<<o),n+=1;var l=32-Oe(t)+o;if(30<l){var i=o-o%5;l=(r&(1<<i)-1).toString(32),r>>=i,o-=i,Ve=1<<32-Oe(t)+o|n<<o|r,Ge=l+e}else Ve=1<<l|n<<o|r,Ge=e}function xi(e){e.return!==null&&(wt(e,1),Pa(e,1,0))}function _i(e){for(;e===no;)no=Qt[--Yt],Qt[Yt]=null,ro=Qt[--Yt],Qt[Yt]=null;for(;e===Rt;)Rt=we[--Ee],we[Ee]=null,Ge=we[--Ee],we[Ee]=null,Ve=we[--Ee],we[Ee]=null}var ve=null,me=null,j=!1,Ie=null;function Ia(e,t){var n=ke(5,null,null,0);n.elementType="DELETED",n.stateNode=t,n.return=e,t=e.deletions,t===null?(e.deletions=[n],e.flags|=16):t.push(n)}function is(e,t){switch(e.tag){case 5:var n=e.type;return t=t.nodeType!==1||n.toLowerCase()!==t.nodeName.toLowerCase()?null:t,t!==null?(e.stateNode=t,ve=e,me=at(t.firstChild),!0):!1;case 6:return t=e.pendingProps===""||t.nodeType!==3?null:t,t!==null?(e.stateNode=t,ve=e,me=null,!0):!1;case 13:return t=t.nodeType!==8?null:t,t!==null?(n=Rt!==null?{id:Ve,overflow:Ge}:null,e.memoizedState={dehydrated:t,treeContext:n,retryLane:1073741824},n=ke(18,null,null,0),n.stateNode=t,n.return=e,e.child=n,ve=e,me=null,!0):!1;default:return!1}}function Vl(e){return(e.mode&1)!==0&&(e.flags&128)===0}function Gl(e){if(j){var t=me;if(t){var n=t;if(!is(e,t)){if(Vl(e))throw Error(g(418));t=at(n.nextSibling);var r=ve;t&&is(e,t)?Ia(r,n):(e.flags=e.flags&-4097|2,j=!1,ve=e)}}else{if(Vl(e))throw Error(g(418));e.flags=e.flags&-4097|2,j=!1,ve=e}}}function us(e){for(e=e.return;e!==null&&e.tag!==5&&e.tag!==3&&e.tag!==13;)e=e.return;ve=e}function Ir(e){if(e!==ve)return!1;if(!j)return us(e),j=!0,!1;var t;if((t=e.tag!==3)&&!(t=e.tag!==5)&&(t=e.type,t=t!=="head"&&t!=="body"&&!Fl(e.type,e.memoizedProps)),t&&(t=me)){if(Vl(e))throw Oa(),Error(g(418));for(;t;)Ia(e,t),t=at(t.nextSibling)}if(us(e),e.tag===13){if(e=e.memoizedState,e=e!==null?e.dehydrated:null,!e)throw Error(g(317));e:{for(e=e.nextSibling,t=0;e;){if(e.nodeType===8){var n=e.data;if(n==="/$"){if(t===0){me=at(e.nextSibling);break e}t--}else n!=="$"&&n!=="$!"&&n!=="$?"||t++}e=e.nextSibling}me=null}}else me=ve?at(e.stateNode.nextSibling):null;return!0}function Oa(){for(var e=me;e;)e=at(e.nextSibling)}function ln(){me=ve=null,j=!1}function Ti(e){Ie===null?Ie=[e]:Ie.push(e)}var zp=qe.ReactCurrentBatchConfig;function En(e,t,n){if(e=n.ref,e!==null&&typeof e!="function"&&typeof e!="object"){if(n._owner){if(n=n._owner,n){if(n.tag!==1)throw Error(g(309));var r=n.stateNode}if(!r)throw Error(g(147,e));var o=r,l=""+e;return t!==null&&t.ref!==null&&typeof t.ref=="function"&&t.ref._stringRef===l?t.ref:(t=function(i){var u=o.refs;i===null?delete u[l]:u[l]=i},t._stringRef=l,t)}if(typeof e!="string")throw Error(g(284));if(!n._owner)throw Error(g(290,e))}return e}function Or(e,t){throw e=Object.prototype.toString.call(t),Error(g(31,e==="[object Object]"?"object with keys {"+Object.keys(t).join(", ")+"}":e))}function ss(e){var t=e._init;return t(e._payload)}function Aa(e){function t(d,a){if(e){var p=d.deletions;p===null?(d.deletions=[a],d.flags|=16):p.push(a)}}function n(d,a){if(!e)return null;for(;a!==null;)t(d,a),a=a.sibling;return null}function r(d,a){for(d=new Map;a!==null;)a.key!==null?d.set(a.key,a):d.set(a.index,a),a=a.sibling;return d}function o(d,a){return d=ft(d,a),d.index=0,d.sibling=null,d}function l(d,a,p){return d.index=p,e?(p=d.alternate,p!==null?(p=p.index,p<a?(d.flags|=2,a):p):(d.flags|=2,a)):(d.flags|=1048576,a)}function i(d){return e&&d.alternate===null&&(d.flags|=2),d}function u(d,a,p,y){return a===null||a.tag!==6?(a=ml(p,d.mode,y),a.return=d,a):(a=o(a,p),a.return=d,a)}function s(d,a,p,y){var x=p.type;return x===Wt?v(d,a,p.props.children,y,p.key):a!==null&&(a.elementType===x||typeof x=="object"&&x!==null&&x.$$typeof===et&&ss(x)===a.type)?(y=o(a,p.props),y.ref=En(d,a,p),y.return=d,y):(y=Gr(p.type,p.key,p.props,null,d.mode,y),y.ref=En(d,a,p),y.return=d,y)}function c(d,a,p,y){return a===null||a.tag!==4||a.stateNode.containerInfo!==p.containerInfo||a.stateNode.implementation!==p.implementation?(a=vl(p,d.mode,y),a.return=d,a):(a=o(a,p.children||[]),a.return=d,a)}function v(d,a,p,y,x){return a===null||a.tag!==7?(a=Tt(p,d.mode,y,x),a.return=d,a):(a=o(a,p),a.return=d,a)}function h(d,a,p){if(typeof a=="string"&&a!==""||typeof a=="number")return a=ml(""+a,d.mode,p),a.return=d,a;if(typeof a=="object"&&a!==null){switch(a.$$typeof){case hr:return p=Gr(a.type,a.key,a.props,null,d.mode,p),p.ref=En(d,null,a),p.return=d,p;case Ft:return a=vl(a,d.mode,p),a.return=d,a;case et:var y=a._init;return h(d,y(a._payload),p)}if(Tn(a)||gn(a))return a=Tt(a,d.mode,p,null),a.return=d,a;Or(d,a)}return null}function m(d,a,p,y){var x=a!==null?a.key:null;if(typeof p=="string"&&p!==""||typeof p=="number")return x!==null?null:u(d,a,""+p,y);if(typeof p=="object"&&p!==null){switch(p.$$typeof){case hr:return p.key===x?s(d,a,p,y):null;case Ft:return p.key===x?c(d,a,p,y):null;case et:return x=p._init,m(d,a,x(p._payload),y)}if(Tn(p)||gn(p))return x!==null?null:v(d,a,p,y,null);Or(d,p)}return null}function w(d,a,p,y,x){if(typeof y=="string"&&y!==""||typeof y=="number")return d=d.get(p)||null,u(a,d,""+y,x);if(typeof y=="object"&&y!==null){switch(y.$$typeof){case hr:return d=d.get(y.key===null?p:y.key)||null,s(a,d,y,x);case Ft:return d=d.get(y.key===null?p:y.key)||null,c(a,d,y,x);case et:var _=y._init;return w(d,a,p,_(y._payload),x)}if(Tn(y)||gn(y))return d=d.get(p)||null,v(a,d,y,x,null);Or(a,y)}return null}function k(d,a,p,y){for(var x=null,_=null,T=a,N=a=0,Y=null;T!==null&&N<p.length;N++){T.index>N?(Y=T,T=null):Y=T.sibling;var O=m(d,T,p[N],y);if(O===null){T===null&&(T=Y);break}e&&T&&O.alternate===null&&t(d,T),a=l(O,a,N),_===null?x=O:_.sibling=O,_=O,T=Y}if(N===p.length)return n(d,T),j&&wt(d,N),x;if(T===null){for(;N<p.length;N++)T=h(d,p[N],y),T!==null&&(a=l(T,a,N),_===null?x=T:_.sibling=T,_=T);return j&&wt(d,N),x}for(T=r(d,T);N<p.length;N++)Y=w(T,d,N,p[N],y),Y!==null&&(e&&Y.alternate!==null&&T.delete(Y.key===null?N:Y.key),a=l(Y,a,N),_===null?x=Y:_.sibling=Y,_=Y);return e&&T.forEach(function(Ze){return t(d,Ze)}),j&&wt(d,N),x}function C(d,a,p,y){var x=gn(p);if(typeof x!="function")throw Error(g(150));if(p=x.call(p),p==null)throw Error(g(151));for(var _=x=null,T=a,N=a=0,Y=null,O=p.next();T!==null&&!O.done;N++,O=p.next()){T.index>N?(Y=T,T=null):Y=T.sibling;var Ze=m(d,T,O.value,y);if(Ze===null){T===null&&(T=Y);break}e&&T&&Ze.alternate===null&&t(d,T),a=l(Ze,a,N),_===null?x=Ze:_.sibling=Ze,_=Ze,T=Y}if(O.done)return n(d,T),j&&wt(d,N),x;if(T===null){for(;!O.done;N++,O=p.next())O=h(d,O.value,y),O!==null&&(a=l(O,a,N),_===null?x=O:_.sibling=O,_=O);return j&&wt(d,N),x}for(T=r(d,T);!O.done;N++,O=p.next())O=w(T,d,N,O.value,y),O!==null&&(e&&O.alternate!==null&&T.delete(O.key===null?N:O.key),a=l(O,a,N),_===null?x=O:_.sibling=O,_=O);return e&&T.forEach(function(Vc){return t(d,Vc)}),j&&wt(d,N),x}function B(d,a,p,y){if(typeof p=="object"&&p!==null&&p.type===Wt&&p.key===null&&(p=p.props.children),typeof p=="object"&&p!==null){switch(p.$$typeof){case hr:e:{for(var x=p.key,_=a;_!==null;){if(_.key===x){if(x=p.type,x===Wt){if(_.tag===7){n(d,_.sibling),a=o(_,p.props.children),a.return=d,d=a;break e}}else if(_.elementType===x||typeof x=="object"&&x!==null&&x.$$typeof===et&&ss(x)===_.type){n(d,_.sibling),a=o(_,p.props),a.ref=En(d,_,p),a.return=d,d=a;break e}n(d,_);break}else t(d,_);_=_.sibling}p.type===Wt?(a=Tt(p.props.children,d.mode,y,p.key),a.return=d,d=a):(y=Gr(p.type,p.key,p.props,null,d.mode,y),y.ref=En(d,a,p),y.return=d,d=y)}return i(d);case Ft:e:{for(_=p.key;a!==null;){if(a.key===_)if(a.tag===4&&a.stateNode.containerInfo===p.containerInfo&&a.stateNode.implementation===p.implementation){n(d,a.sibling),a=o(a,p.children||[]),a.return=d,d=a;break e}else{n(d,a);break}else t(d,a);a=a.sibling}a=vl(p,d.mode,y),a.return=d,d=a}return i(d);case et:return _=p._init,B(d,a,_(p._payload),y)}if(Tn(p))return k(d,a,p,y);if(gn(p))return C(d,a,p,y);Or(d,p)}return typeof p=="string"&&p!==""||typeof p=="number"?(p=""+p,a!==null&&a.tag===6?(n(d,a.sibling),a=o(a,p),a.return=d,d=a):(n(d,a),a=ml(p,d.mode,y),a.return=d,d=a),i(d)):n(d,a)}return B}var un=Aa(!0),La=Aa(!1),oo=gt(null),lo=null,Xt=null,Ni=null;function Ri(){Ni=Xt=lo=null}function Pi(e){var t=oo.current;M(oo),e._currentValue=t}function $l(e,t,n){for(;e!==null;){var r=e.alternate;if((e.childLanes&t)!==t?(e.childLanes|=t,r!==null&&(r.childLanes|=t)):r!==null&&(r.childLanes&t)!==t&&(r.childLanes|=t),e===n)break;e=e.return}}function tn(e,t){lo=e,Ni=Xt=null,e=e.dependencies,e!==null&&e.firstContext!==null&&(e.lanes&t&&(ae=!0),e.firstContext=null)}function xe(e){var t=e._currentValue;if(Ni!==e)if(e={context:e,memoizedValue:t,next:null},Xt===null){if(lo===null)throw Error(g(308));Xt=e,lo.dependencies={lanes:0,firstContext:e}}else Xt=Xt.next=e;return t}var Ct=null;function Ii(e){Ct===null?Ct=[e]:Ct.push(e)}function za(e,t,n,r){var o=t.interleaved;return o===null?(n.next=n,Ii(t)):(n.next=o.next,o.next=n),t.interleaved=n,Xe(e,r)}function Xe(e,t){e.lanes|=t;var n=e.alternate;for(n!==null&&(n.lanes|=t),n=e,e=e.return;e!==null;)e.childLanes|=t,n=e.alternate,n!==null&&(n.childLanes|=t),n=e,e=e.return;return n.tag===3?n.stateNode:null}var tt=!1;function Oi(e){e.updateQueue={baseState:e.memoizedState,firstBaseUpdate:null,lastBaseUpdate:null,shared:{pending:null,interleaved:null,lanes:0},effects:null}}function Da(e,t){e=e.updateQueue,t.updateQueue===e&&(t.updateQueue={baseState:e.baseState,firstBaseUpdate:e.firstBaseUpdate,lastBaseUpdate:e.lastBaseUpdate,shared:e.shared,effects:e.effects})}function $e(e,t){return{eventTime:e,lane:t,tag:0,payload:null,callback:null,next:null}}function ct(e,t,n){var r=e.updateQueue;if(r===null)return null;if(r=r.shared,I&2){var o=r.pending;return o===null?t.next=t:(t.next=o.next,o.next=t),r.pending=t,Xe(e,n)}return o=r.interleaved,o===null?(t.next=t,Ii(r)):(t.next=o.next,o.next=t),r.interleaved=t,Xe(e,n)}function Ur(e,t,n){if(t=t.updateQueue,t!==null&&(t=t.shared,(n&4194240)!==0)){var r=t.lanes;r&=e.pendingLanes,n|=r,t.lanes=n,hi(e,n)}}function as(e,t){var n=e.updateQueue,r=e.alternate;if(r!==null&&(r=r.updateQueue,n===r)){var o=null,l=null;if(n=n.firstBaseUpdate,n!==null){do{var i={eventTime:n.eventTime,lane:n.lane,tag:n.tag,payload:n.payload,callback:n.callback,next:null};l===null?o=l=i:l=l.next=i,n=n.next}while(n!==null);l===null?o=l=t:l=l.next=t}else o=l=t;n={baseState:r.baseState,firstBaseUpdate:o,lastBaseUpdate:l,shared:r.shared,effects:r.effects},e.updateQueue=n;return}e=n.lastBaseUpdate,e===null?n.firstBaseUpdate=t:e.next=t,n.lastBaseUpdate=t}function io(e,t,n,r){var o=e.updateQueue;tt=!1;var l=o.firstBaseUpdate,i=o.lastBaseUpdate,u=o.shared.pending;if(u!==null){o.shared.pending=null;var s=u,c=s.next;s.next=null,i===null?l=c:i.next=c,i=s;var v=e.alternate;v!==null&&(v=v.updateQueue,u=v.lastBaseUpdate,u!==i&&(u===null?v.firstBaseUpdate=c:u.next=c,v.lastBaseUpdate=s))}if(l!==null){var h=o.baseState;i=0,v=c=s=null,u=l;do{var m=u.lane,w=u.eventTime;if((r&m)===m){v!==null&&(v=v.next={eventTime:w,lane:0,tag:u.tag,payload:u.payload,callback:u.callback,next:null});e:{var k=e,C=u;switch(m=t,w=n,C.tag){case 1:if(k=C.payload,typeof k=="function"){h=k.call(w,h,m);break e}h=k;break e;case 3:k.flags=k.flags&-65537|128;case 0:if(k=C.payload,m=typeof k=="function"?k.call(w,h,m):k,m==null)break e;h=W({},h,m);break e;case 2:tt=!0}}u.callback!==null&&u.lane!==0&&(e.flags|=64,m=o.effects,m===null?o.effects=[u]:m.push(u))}else w={eventTime:w,lane:m,tag:u.tag,payload:u.payload,callback:u.callback,next:null},v===null?(c=v=w,s=h):v=v.next=w,i|=m;if(u=u.next,u===null){if(u=o.shared.pending,u===null)break;m=u,u=m.next,m.next=null,o.lastBaseUpdate=m,o.shared.pending=null}}while(!0);if(v===null&&(s=h),o.baseState=s,o.firstBaseUpdate=c,o.lastBaseUpdate=v,t=o.shared.interleaved,t!==null){o=t;do i|=o.lane,o=o.next;while(o!==t)}else l===null&&(o.shared.lanes=0);It|=i,e.lanes=i,e.memoizedState=h}}function cs(e,t,n){if(e=t.effects,t.effects=null,e!==null)for(t=0;t<e.length;t++){var r=e[t],o=r.callback;if(o!==null){if(r.callback=null,r=n,typeof o!="function")throw Error(g(191,o));o.call(r)}}}var or={},Fe=gt(or),Kn=gt(or),qn=gt(or);function xt(e){if(e===or)throw Error(g(174));return e}function Ai(e,t){switch(z(qn,t),z(Kn,e),z(Fe,or),e=t.nodeType,e){case 9:case 11:t=(t=t.documentElement)?t.namespaceURI:_l(null,"");break;default:e=e===8?t.parentNode:t,t=e.namespaceURI||null,e=e.tagName,t=_l(t,e)}M(Fe),z(Fe,t)}function sn(){M(Fe),M(Kn),M(qn)}function Ma(e){xt(qn.current);var t=xt(Fe.current),n=_l(t,e.type);t!==n&&(z(Kn,e),z(Fe,n))}function Li(e){Kn.current===e&&(M(Fe),M(Kn))}var U=gt(0);function uo(e){for(var t=e;t!==null;){if(t.tag===13){var n=t.memoizedState;if(n!==null&&(n=n.dehydrated,n===null||n.data==="$?"||n.data==="$!"))return t}else if(t.tag===19&&t.memoizedProps.revealOrder!==void 0){if(t.flags&128)return t}else if(t.child!==null){t.child.return=t,t=t.child;continue}if(t===e)break;for(;t.sibling===null;){if(t.return===null||t.return===e)return null;t=t.return}t.sibling.return=t.return,t=t.sibling}return null}var sl=[];function zi(){for(var e=0;e<sl.length;e++)sl[e]._workInProgressVersionPrimary=null;sl.length=0}var Fr=qe.ReactCurrentDispatcher,al=qe.ReactCurrentBatchConfig,Pt=0,F=null,$=null,X=null,so=!1,zn=!1,Zn=0,Dp=0;function ee(){throw Error(g(321))}function Di(e,t){if(t===null)return!1;for(var n=0;n<t.length&&n<e.length;n++)if(!Le(e[n],t[n]))return!1;return!0}function Mi(e,t,n,r,o,l){if(Pt=l,F=t,t.memoizedState=null,t.updateQueue=null,t.lanes=0,Fr.current=e===null||e.memoizedState===null?Fp:Wp,e=n(r,o),zn){l=0;do{if(zn=!1,Zn=0,25<=l)throw Error(g(301));l+=1,X=$=null,t.updateQueue=null,Fr.current=Hp,e=n(r,o)}while(zn)}if(Fr.current=ao,t=$!==null&&$.next!==null,Pt=0,X=$=F=null,so=!1,t)throw Error(g(300));return e}function ji(){var e=Zn!==0;return Zn=0,e}function Me(){var e={memoizedState:null,baseState:null,baseQueue:null,queue:null,next:null};return X===null?F.memoizedState=X=e:X=X.next=e,X}function _e(){if($===null){var e=F.alternate;e=e!==null?e.memoizedState:null}else e=$.next;var t=X===null?F.memoizedState:X.next;if(t!==null)X=t,$=e;else{if(e===null)throw Error(g(310));$=e,e={memoizedState:$.memoizedState,baseState:$.baseState,baseQueue:$.baseQueue,queue:$.queue,next:null},X===null?F.memoizedState=X=e:X=X.next=e}return X}function Jn(e,t){return typeof t=="function"?t(e):t}function cl(e){var t=_e(),n=t.queue;if(n===null)throw Error(g(311));n.lastRenderedReducer=e;var r=$,o=r.baseQueue,l=n.pending;if(l!==null){if(o!==null){var i=o.next;o.next=l.next,l.next=i}r.baseQueue=o=l,n.pending=null}if(o!==null){l=o.next,r=r.baseState;var u=i=null,s=null,c=l;do{var v=c.lane;if((Pt&v)===v)s!==null&&(s=s.next={lane:0,action:c.action,hasEagerState:c.hasEagerState,eagerState:c.eagerState,next:null}),r=c.hasEagerState?c.eagerState:e(r,c.action);else{var h={lane:v,action:c.action,hasEagerState:c.hasEagerState,eagerState:c.eagerState,next:null};s===null?(u=s=h,i=r):s=s.next=h,F.lanes|=v,It|=v}c=c.next}while(c!==null&&c!==l);s===null?i=r:s.next=u,Le(r,t.memoizedState)||(ae=!0),t.memoizedState=r,t.baseState=i,t.baseQueue=s,n.lastRenderedState=r}if(e=n.interleaved,e!==null){o=e;do l=o.lane,F.lanes|=l,It|=l,o=o.next;while(o!==e)}else o===null&&(n.lanes=0);return[t.memoizedState,n.dispatch]}function dl(e){var t=_e(),n=t.queue;if(n===null)throw Error(g(311));n.lastRenderedReducer=e;var r=n.dispatch,o=n.pending,l=t.memoizedState;if(o!==null){n.pending=null;var i=o=o.next;do l=e(l,i.action),i=i.next;while(i!==o);Le(l,t.memoizedState)||(ae=!0),t.memoizedState=l,t.baseQueue===null&&(t.baseState=l),n.lastRenderedState=l}return[l,r]}function ja(){}function Ua(e,t){var n=F,r=_e(),o=t(),l=!Le(r.memoizedState,o);if(l&&(r.memoizedState=o,ae=!0),r=r.queue,Ui(Ha.bind(null,n,r,e),[e]),r.getSnapshot!==t||l||X!==null&&X.memoizedState.tag&1){if(n.flags|=2048,bn(9,Wa.bind(null,n,r,o,t),void 0,null),K===null)throw Error(g(349));Pt&30||Fa(n,t,o)}return o}function Fa(e,t,n){e.flags|=16384,e={getSnapshot:t,value:n},t=F.updateQueue,t===null?(t={lastEffect:null,stores:null},F.updateQueue=t,t.stores=[e]):(n=t.stores,n===null?t.stores=[e]:n.push(e))}function Wa(e,t,n,r){t.value=n,t.getSnapshot=r,Ba(t)&&Va(e)}function Ha(e,t,n){return n(function(){Ba(t)&&Va(e)})}function Ba(e){var t=e.getSnapshot;e=e.value;try{var n=t();return!Le(e,n)}catch{return!0}}function Va(e){var t=Xe(e,1);t!==null&&Ae(t,e,1,-1)}function ds(e){var t=Me();return typeof e=="function"&&(e=e()),t.memoizedState=t.baseState=e,e={pending:null,interleaved:null,lanes:0,dispatch:null,lastRenderedReducer:Jn,lastRenderedState:e},t.queue=e,e=e.dispatch=Up.bind(null,F,e),[t.memoizedState,e]}function bn(e,t,n,r){return e={tag:e,create:t,destroy:n,deps:r,next:null},t=F.updateQueue,t===null?(t={lastEffect:null,stores:null},F.updateQueue=t,t.lastEffect=e.next=e):(n=t.lastEffect,n===null?t.lastEffect=e.next=e:(r=n.next,n.next=e,e.next=r,t.lastEffect=e)),e}function Ga(){return _e().memoizedState}function Wr(e,t,n,r){var o=Me();F.flags|=e,o.memoizedState=bn(1|t,n,void 0,r===void 0?null:r)}function ko(e,t,n,r){var o=_e();r=r===void 0?null:r;var l=void 0;if($!==null){var i=$.memoizedState;if(l=i.destroy,r!==null&&Di(r,i.deps)){o.memoizedState=bn(t,n,l,r);return}}F.flags|=e,o.memoizedState=bn(1|t,n,l,r)}function ps(e,t){return Wr(8390656,8,e,t)}function Ui(e,t){return ko(2048,8,e,t)}function $a(e,t){return ko(4,2,e,t)}function Qa(e,t){return ko(4,4,e,t)}function Ya(e,t){if(typeof t=="function")return e=e(),t(e),function(){t(null)};if(t!=null)return e=e(),t.current=e,function(){t.current=null}}function Xa(e,t,n){return n=n!=null?n.concat([e]):null,ko(4,4,Ya.bind(null,t,e),n)}function Fi(){}function Ka(e,t){var n=_e();t=t===void 0?null:t;var r=n.memoizedState;return r!==null&&t!==null&&Di(t,r[1])?r[0]:(n.memoizedState=[e,t],e)}function qa(e,t){var n=_e();t=t===void 0?null:t;var r=n.memoizedState;return r!==null&&t!==null&&Di(t,r[1])?r[0]:(e=e(),n.memoizedState=[e,t],e)}function Za(e,t,n){return Pt&21?(Le(n,t)||(n=na(),F.lanes|=n,It|=n,e.baseState=!0),t):(e.baseState&&(e.baseState=!1,ae=!0),e.memoizedState=n)}function Mp(e,t){var n=A;A=n!==0&&4>n?n:4,e(!0);var r=al.transition;al.transition={};try{e(!1),t()}finally{A=n,al.transition=r}}function Ja(){return _e().memoizedState}function jp(e,t,n){var r=pt(e);if(n={lane:r,action:n,hasEagerState:!1,eagerState:null,next:null},ba(e))ec(t,n);else if(n=za(e,t,n,r),n!==null){var o=ie();Ae(n,e,r,o),tc(n,t,r)}}function Up(e,t,n){var r=pt(e),o={lane:r,action:n,hasEagerState:!1,eagerState:null,next:null};if(ba(e))ec(t,o);else{var l=e.alternate;if(e.lanes===0&&(l===null||l.lanes===0)&&(l=t.lastRenderedReducer,l!==null))try{var i=t.lastRenderedState,u=l(i,n);if(o.hasEagerState=!0,o.eagerState=u,Le(u,i)){var s=t.interleaved;s===null?(o.next=o,Ii(t)):(o.next=s.next,s.next=o),t.interleaved=o;return}}catch{}finally{}n=za(e,t,o,r),n!==null&&(o=ie(),Ae(n,e,r,o),tc(n,t,r))}}function ba(e){var t=e.alternate;return e===F||t!==null&&t===F}function ec(e,t){zn=so=!0;var n=e.pending;n===null?t.next=t:(t.next=n.next,n.next=t),e.pending=t}function tc(e,t,n){if(n&4194240){var r=t.lanes;r&=e.pendingLanes,n|=r,t.lanes=n,hi(e,n)}}var ao={readContext:xe,useCallback:ee,useContext:ee,useEffect:ee,useImperativeHandle:ee,useInsertionEffect:ee,useLayoutEffect:ee,useMemo:ee,useReducer:ee,useRef:ee,useState:ee,useDebugValue:ee,useDeferredValue:ee,useTransition:ee,useMutableSource:ee,useSyncExternalStore:ee,useId:ee,unstable_isNewReconciler:!1},Fp={readContext:xe,useCallback:function(e,t){return Me().memoizedState=[e,t===void 0?null:t],e},useContext:xe,useEffect:ps,useImperativeHandle:function(e,t,n){return n=n!=null?n.concat([e]):null,Wr(4194308,4,Ya.bind(null,t,e),n)},useLayoutEffect:function(e,t){return Wr(4194308,4,e,t)},useInsertionEffect:function(e,t){return Wr(4,2,e,t)},useMemo:function(e,t){var n=Me();return t=t===void 0?null:t,e=e(),n.memoizedState=[e,t],e},useReducer:function(e,t,n){var r=Me();return t=n!==void 0?n(t):t,r.memoizedState=r.baseState=t,e={pending:null,interleaved:null,lanes:0,dispatch:null,lastRenderedReducer:e,lastRenderedState:t},r.queue=e,e=e.dispatch=jp.bind(null,F,e),[r.memoizedState,e]},useRef:function(e){var t=Me();return e={current:e},t.memoizedState=e},useState:ds,useDebugValue:Fi,useDeferredValue:function(e){return Me().memoizedState=e},useTransition:function(){var e=ds(!1),t=e[0];return e=Mp.bind(null,e[1]),Me().memoizedState=e,[t,e]},useMutableSource:function(){},useSyncExternalStore:function(e,t,n){var r=F,o=Me();if(j){if(n===void 0)throw Error(g(407));n=n()}else{if(n=t(),K===null)throw Error(g(349));Pt&30||Fa(r,t,n)}o.memoizedState=n;var l={value:n,getSnapshot:t};return o.queue=l,ps(Ha.bind(null,r,l,e),[e]),r.flags|=2048,bn(9,Wa.bind(null,r,l,n,t),void 0,null),n},useId:function(){var e=Me(),t=K.identifierPrefix;if(j){var n=Ge,r=Ve;n=(r&~(1<<32-Oe(r)-1)).toString(32)+n,t=":"+t+"R"+n,n=Zn++,0<n&&(t+="H"+n.toString(32)),t+=":"}else n=Dp++,t=":"+t+"r"+n.toString(32)+":";return e.memoizedState=t},unstable_isNewReconciler:!1},Wp={readContext:xe,useCallback:Ka,useContext:xe,useEffect:Ui,useImperativeHandle:Xa,useInsertionEffect:$a,useLayoutEffect:Qa,useMemo:qa,useReducer:cl,useRef:Ga,useState:function(){return cl(Jn)},useDebugValue:Fi,useDeferredValue:function(e){var t=_e();return Za(t,$.memoizedState,e)},useTransition:function(){var e=cl(Jn)[0],t=_e().memoizedState;return[e,t]},useMutableSource:ja,useSyncExternalStore:Ua,useId:Ja,unstable_isNewReconciler:!1},Hp={readContext:xe,useCallback:Ka,useContext:xe,useEffect:Ui,useImperativeHandle:Xa,useInsertionEffect:$a,useLayoutEffect:Qa,useMemo:qa,useReducer:dl,useRef:Ga,useState:function(){return dl(Jn)},useDebugValue:Fi,useDeferredValue:function(e){var t=_e();return $===null?t.memoizedState=e:Za(t,$.memoizedState,e)},useTransition:function(){var e=dl(Jn)[0],t=_e().memoizedState;return[e,t]},useMutableSource:ja,useSyncExternalStore:Ua,useId:Ja,unstable_isNewReconciler:!1};function Re(e,t){if(e&&e.defaultProps){t=W({},t),e=e.defaultProps;for(var n in e)t[n]===void 0&&(t[n]=e[n]);return t}return t}function Ql(e,t,n,r){t=e.memoizedState,n=n(r,t),n=n==null?t:W({},t,n),e.memoizedState=n,e.lanes===0&&(e.updateQueue.baseState=n)}var Co={isMounted:function(e){return(e=e._reactInternals)?Lt(e)===e:!1},enqueueSetState:function(e,t,n){e=e._reactInternals;var r=ie(),o=pt(e),l=$e(r,o);l.payload=t,n!=null&&(l.callback=n),t=ct(e,l,o),t!==null&&(Ae(t,e,o,r),Ur(t,e,o))},enqueueReplaceState:function(e,t,n){e=e._reactInternals;var r=ie(),o=pt(e),l=$e(r,o);l.tag=1,l.payload=t,n!=null&&(l.callback=n),t=ct(e,l,o),t!==null&&(Ae(t,e,o,r),Ur(t,e,o))},enqueueForceUpdate:function(e,t){e=e._reactInternals;var n=ie(),r=pt(e),o=$e(n,r);o.tag=2,t!=null&&(o.callback=t),t=ct(e,o,r),t!==null&&(Ae(t,e,r,n),Ur(t,e,r))}};function fs(e,t,n,r,o,l,i){return e=e.stateNode,typeof e.shouldComponentUpdate=="function"?e.shouldComponentUpdate(r,l,i):t.prototype&&t.prototype.isPureReactComponent?!$n(n,r)||!$n(o,l):!0}function nc(e,t,n){var r=!1,o=vt,l=t.contextType;return typeof l=="object"&&l!==null?l=xe(l):(o=de(t)?Nt:re.current,r=t.contextTypes,l=(r=r!=null)?on(e,o):vt),t=new t(n,l),e.memoizedState=t.state!==null&&t.state!==void 0?t.state:null,t.updater=Co,e.stateNode=t,t._reactInternals=e,r&&(e=e.stateNode,e.__reactInternalMemoizedUnmaskedChildContext=o,e.__reactInternalMemoizedMaskedChildContext=l),t}function ms(e,t,n,r){e=t.state,typeof t.componentWillReceiveProps=="function"&&t.componentWillReceiveProps(n,r),typeof t.UNSAFE_componentWillReceiveProps=="function"&&t.UNSAFE_componentWillReceiveProps(n,r),t.state!==e&&Co.enqueueReplaceState(t,t.state,null)}function Yl(e,t,n,r){var o=e.stateNode;o.props=n,o.state=e.memoizedState,o.refs={},Oi(e);var l=t.contextType;typeof l=="object"&&l!==null?o.context=xe(l):(l=de(t)?Nt:re.current,o.context=on(e,l)),o.state=e.memoizedState,l=t.getDerivedStateFromProps,typeof l=="function"&&(Ql(e,t,l,n),o.state=e.memoizedState),typeof t.getDerivedStateFromProps=="function"||typeof o.getSnapshotBeforeUpdate=="function"||typeof o.UNSAFE_componentWillMount!="function"&&typeof o.componentWillMount!="function"||(t=o.state,typeof o.componentWillMount=="function"&&o.componentWillMount(),typeof o.UNSAFE_componentWillMount=="function"&&o.UNSAFE_componentWillMount(),t!==o.state&&Co.enqueueReplaceState(o,o.state,null),io(e,n,o,r),o.state=e.memoizedState),typeof o.componentDidMount=="function"&&(e.flags|=4194308)}function an(e,t){try{var n="",r=t;do n+=gd(r),r=r.return;while(r);var o=n}catch(l){o=`
Error generating stack: `+l.message+`
`+l.stack}return{value:e,source:t,stack:o,digest:null}}function pl(e,t,n){return{value:e,source:null,stack:n!=null?n:null,digest:t!=null?t:null}}function Xl(e,t){try{console.error(t.value)}catch(n){setTimeout(function(){throw n})}}var Bp=typeof WeakMap=="function"?WeakMap:Map;function rc(e,t,n){n=$e(-1,n),n.tag=3,n.payload={element:null};var r=t.value;return n.callback=function(){po||(po=!0,oi=r),Xl(e,t)},n}function oc(e,t,n){n=$e(-1,n),n.tag=3;var r=e.type.getDerivedStateFromError;if(typeof r=="function"){var o=t.value;n.payload=function(){return r(o)},n.callback=function(){Xl(e,t)}}var l=e.stateNode;return l!==null&&typeof l.componentDidCatch=="function"&&(n.callback=function(){Xl(e,t),typeof r!="function"&&(dt===null?dt=new Set([this]):dt.add(this));var i=t.stack;this.componentDidCatch(t.value,{componentStack:i!==null?i:""})}),n}function vs(e,t,n){var r=e.pingCache;if(r===null){r=e.pingCache=new Bp;var o=new Set;r.set(t,o)}else o=r.get(t),o===void 0&&(o=new Set,r.set(t,o));o.has(n)||(o.add(n),e=nf.bind(null,e,t,n),t.then(e,e))}function hs(e){do{var t;if((t=e.tag===13)&&(t=e.memoizedState,t=t!==null?t.dehydrated!==null:!0),t)return e;e=e.return}while(e!==null);return null}function gs(e,t,n,r,o){return e.mode&1?(e.flags|=65536,e.lanes=o,e):(e===t?e.flags|=65536:(e.flags|=128,n.flags|=131072,n.flags&=-52805,n.tag===1&&(n.alternate===null?n.tag=17:(t=$e(-1,1),t.tag=2,ct(n,t,1))),n.lanes|=1),e)}var Vp=qe.ReactCurrentOwner,ae=!1;function le(e,t,n,r){t.child=e===null?La(t,null,n,r):un(t,e.child,n,r)}function ys(e,t,n,r,o){n=n.render;var l=t.ref;return tn(t,o),r=Mi(e,t,n,r,l,o),n=ji(),e!==null&&!ae?(t.updateQueue=e.updateQueue,t.flags&=-2053,e.lanes&=~o,Ke(e,t,o)):(j&&n&&xi(t),t.flags|=1,le(e,t,r,o),t.child)}function Ss(e,t,n,r,o){if(e===null){var l=n.type;return typeof l=="function"&&!Yi(l)&&l.defaultProps===void 0&&n.compare===null&&n.defaultProps===void 0?(t.tag=15,t.type=l,lc(e,t,l,r,o)):(e=Gr(n.type,null,r,t,t.mode,o),e.ref=t.ref,e.return=t,t.child=e)}if(l=e.child,!(e.lanes&o)){var i=l.memoizedProps;if(n=n.compare,n=n!==null?n:$n,n(i,r)&&e.ref===t.ref)return Ke(e,t,o)}return t.flags|=1,e=ft(l,r),e.ref=t.ref,e.return=t,t.child=e}function lc(e,t,n,r,o){if(e!==null){var l=e.memoizedProps;if($n(l,r)&&e.ref===t.ref)if(ae=!1,t.pendingProps=r=l,(e.lanes&o)!==0)e.flags&131072&&(ae=!0);else return t.lanes=e.lanes,Ke(e,t,o)}return Kl(e,t,n,r,o)}function ic(e,t,n){var r=t.pendingProps,o=r.children,l=e!==null?e.memoizedState:null;if(r.mode==="hidden")if(!(t.mode&1))t.memoizedState={baseLanes:0,cachePool:null,transitions:null},z(qt,fe),fe|=n;else{if(!(n&1073741824))return e=l!==null?l.baseLanes|n:n,t.lanes=t.childLanes=1073741824,t.memoizedState={baseLanes:e,cachePool:null,transitions:null},t.updateQueue=null,z(qt,fe),fe|=e,null;t.memoizedState={baseLanes:0,cachePool:null,transitions:null},r=l!==null?l.baseLanes:n,z(qt,fe),fe|=r}else l!==null?(r=l.baseLanes|n,t.memoizedState=null):r=n,z(qt,fe),fe|=r;return le(e,t,o,n),t.child}function uc(e,t){var n=t.ref;(e===null&&n!==null||e!==null&&e.ref!==n)&&(t.flags|=512,t.flags|=2097152)}function Kl(e,t,n,r,o){var l=de(n)?Nt:re.current;return l=on(t,l),tn(t,o),n=Mi(e,t,n,r,l,o),r=ji(),e!==null&&!ae?(t.updateQueue=e.updateQueue,t.flags&=-2053,e.lanes&=~o,Ke(e,t,o)):(j&&r&&xi(t),t.flags|=1,le(e,t,n,o),t.child)}function ws(e,t,n,r,o){if(de(n)){var l=!0;to(t)}else l=!1;if(tn(t,o),t.stateNode===null)Hr(e,t),nc(t,n,r),Yl(t,n,r,o),r=!0;else if(e===null){var i=t.stateNode,u=t.memoizedProps;i.props=u;var s=i.context,c=n.contextType;typeof c=="object"&&c!==null?c=xe(c):(c=de(n)?Nt:re.current,c=on(t,c));var v=n.getDerivedStateFromProps,h=typeof v=="function"||typeof i.getSnapshotBeforeUpdate=="function";h||typeof i.UNSAFE_componentWillReceiveProps!="function"&&typeof i.componentWillReceiveProps!="function"||(u!==r||s!==c)&&ms(t,i,r,c),tt=!1;var m=t.memoizedState;i.state=m,io(t,r,i,o),s=t.memoizedState,u!==r||m!==s||ce.current||tt?(typeof v=="function"&&(Ql(t,n,v,r),s=t.memoizedState),(u=tt||fs(t,n,u,r,m,s,c))?(h||typeof i.UNSAFE_componentWillMount!="function"&&typeof i.componentWillMount!="function"||(typeof i.componentWillMount=="function"&&i.componentWillMount(),typeof i.UNSAFE_componentWillMount=="function"&&i.UNSAFE_componentWillMount()),typeof i.componentDidMount=="function"&&(t.flags|=4194308)):(typeof i.componentDidMount=="function"&&(t.flags|=4194308),t.memoizedProps=r,t.memoizedState=s),i.props=r,i.state=s,i.context=c,r=u):(typeof i.componentDidMount=="function"&&(t.flags|=4194308),r=!1)}else{i=t.stateNode,Da(e,t),u=t.memoizedProps,c=t.type===t.elementType?u:Re(t.type,u),i.props=c,h=t.pendingProps,m=i.context,s=n.contextType,typeof s=="object"&&s!==null?s=xe(s):(s=de(n)?Nt:re.current,s=on(t,s));var w=n.getDerivedStateFromProps;(v=typeof w=="function"||typeof i.getSnapshotBeforeUpdate=="function")||typeof i.UNSAFE_componentWillReceiveProps!="function"&&typeof i.componentWillReceiveProps!="function"||(u!==h||m!==s)&&ms(t,i,r,s),tt=!1,m=t.memoizedState,i.state=m,io(t,r,i,o);var k=t.memoizedState;u!==h||m!==k||ce.current||tt?(typeof w=="function"&&(Ql(t,n,w,r),k=t.memoizedState),(c=tt||fs(t,n,c,r,m,k,s)||!1)?(v||typeof i.UNSAFE_componentWillUpdate!="function"&&typeof i.componentWillUpdate!="function"||(typeof i.componentWillUpdate=="function"&&i.componentWillUpdate(r,k,s),typeof i.UNSAFE_componentWillUpdate=="function"&&i.UNSAFE_componentWillUpdate(r,k,s)),typeof i.componentDidUpdate=="function"&&(t.flags|=4),typeof i.getSnapshotBeforeUpdate=="function"&&(t.flags|=1024)):(typeof i.componentDidUpdate!="function"||u===e.memoizedProps&&m===e.memoizedState||(t.flags|=4),typeof i.getSnapshotBeforeUpdate!="function"||u===e.memoizedProps&&m===e.memoizedState||(t.flags|=1024),t.memoizedProps=r,t.memoizedState=k),i.props=r,i.state=k,i.context=s,r=c):(typeof i.componentDidUpdate!="function"||u===e.memoizedProps&&m===e.memoizedState||(t.flags|=4),typeof i.getSnapshotBeforeUpdate!="function"||u===e.memoizedProps&&m===e.memoizedState||(t.flags|=1024),r=!1)}return ql(e,t,n,r,l,o)}function ql(e,t,n,r,o,l){uc(e,t);var i=(t.flags&128)!==0;if(!r&&!i)return o&&ls(t,n,!1),Ke(e,t,l);r=t.stateNode,Vp.current=t;var u=i&&typeof n.getDerivedStateFromError!="function"?null:r.render();return t.flags|=1,e!==null&&i?(t.child=un(t,e.child,null,l),t.child=un(t,null,u,l)):le(e,t,u,l),t.memoizedState=r.state,o&&ls(t,n,!0),t.child}function sc(e){var t=e.stateNode;t.pendingContext?os(e,t.pendingContext,t.pendingContext!==t.context):t.context&&os(e,t.context,!1),Ai(e,t.containerInfo)}function Es(e,t,n,r,o){return ln(),Ti(o),t.flags|=256,le(e,t,n,r),t.child}var Zl={dehydrated:null,treeContext:null,retryLane:0};function Jl(e){return{baseLanes:e,cachePool:null,transitions:null}}function ac(e,t,n){var r=t.pendingProps,o=U.current,l=!1,i=(t.flags&128)!==0,u;if((u=i)||(u=e!==null&&e.memoizedState===null?!1:(o&2)!==0),u?(l=!0,t.flags&=-129):(e===null||e.memoizedState!==null)&&(o|=1),z(U,o&1),e===null)return Gl(t),e=t.memoizedState,e!==null&&(e=e.dehydrated,e!==null)?(t.mode&1?e.data==="$!"?t.lanes=8:t.lanes=1073741824:t.lanes=1,null):(i=r.children,e=r.fallback,l?(r=t.mode,l=t.child,i={mode:"hidden",children:i},!(r&1)&&l!==null?(l.childLanes=0,l.pendingProps=i):l=To(i,r,0,null),e=Tt(e,r,n,null),l.return=t,e.return=t,l.sibling=e,t.child=l,t.child.memoizedState=Jl(n),t.memoizedState=Zl,e):Wi(t,i));if(o=e.memoizedState,o!==null&&(u=o.dehydrated,u!==null))return Gp(e,t,i,r,u,o,n);if(l){l=r.fallback,i=t.mode,o=e.child,u=o.sibling;var s={mode:"hidden",children:r.children};return!(i&1)&&t.child!==o?(r=t.child,r.childLanes=0,r.pendingProps=s,t.deletions=null):(r=ft(o,s),r.subtreeFlags=o.subtreeFlags&14680064),u!==null?l=ft(u,l):(l=Tt(l,i,n,null),l.flags|=2),l.return=t,r.return=t,r.sibling=l,t.child=r,r=l,l=t.child,i=e.child.memoizedState,i=i===null?Jl(n):{baseLanes:i.baseLanes|n,cachePool:null,transitions:i.transitions},l.memoizedState=i,l.childLanes=e.childLanes&~n,t.memoizedState=Zl,r}return l=e.child,e=l.sibling,r=ft(l,{mode:"visible",children:r.children}),!(t.mode&1)&&(r.lanes=n),r.return=t,r.sibling=null,e!==null&&(n=t.deletions,n===null?(t.deletions=[e],t.flags|=16):n.push(e)),t.child=r,t.memoizedState=null,r}function Wi(e,t){return t=To({mode:"visible",children:t},e.mode,0,null),t.return=e,e.child=t}function Ar(e,t,n,r){return r!==null&&Ti(r),un(t,e.child,null,n),e=Wi(t,t.pendingProps.children),e.flags|=2,t.memoizedState=null,e}function Gp(e,t,n,r,o,l,i){if(n)return t.flags&256?(t.flags&=-257,r=pl(Error(g(422))),Ar(e,t,i,r)):t.memoizedState!==null?(t.child=e.child,t.flags|=128,null):(l=r.fallback,o=t.mode,r=To({mode:"visible",children:r.children},o,0,null),l=Tt(l,o,i,null),l.flags|=2,r.return=t,l.return=t,r.sibling=l,t.child=r,t.mode&1&&un(t,e.child,null,i),t.child.memoizedState=Jl(i),t.memoizedState=Zl,l);if(!(t.mode&1))return Ar(e,t,i,null);if(o.data==="$!"){if(r=o.nextSibling&&o.nextSibling.dataset,r)var u=r.dgst;return r=u,l=Error(g(419)),r=pl(l,r,void 0),Ar(e,t,i,r)}if(u=(i&e.childLanes)!==0,ae||u){if(r=K,r!==null){switch(i&-i){case 4:o=2;break;case 16:o=8;break;case 64:case 128:case 256:case 512:case 1024:case 2048:case 4096:case 8192:case 16384:case 32768:case 65536:case 131072:case 262144:case 524288:case 1048576:case 2097152:case 4194304:case 8388608:case 16777216:case 33554432:case 67108864:o=32;break;case 536870912:o=268435456;break;default:o=0}o=o&(r.suspendedLanes|i)?0:o,o!==0&&o!==l.retryLane&&(l.retryLane=o,Xe(e,o),Ae(r,e,o,-1))}return Qi(),r=pl(Error(g(421))),Ar(e,t,i,r)}return o.data==="$?"?(t.flags|=128,t.child=e.child,t=rf.bind(null,e),o._reactRetry=t,null):(e=l.treeContext,me=at(o.nextSibling),ve=t,j=!0,Ie=null,e!==null&&(we[Ee++]=Ve,we[Ee++]=Ge,we[Ee++]=Rt,Ve=e.id,Ge=e.overflow,Rt=t),t=Wi(t,r.children),t.flags|=4096,t)}function ks(e,t,n){e.lanes|=t;var r=e.alternate;r!==null&&(r.lanes|=t),$l(e.return,t,n)}function fl(e,t,n,r,o){var l=e.memoizedState;l===null?e.memoizedState={isBackwards:t,rendering:null,renderingStartTime:0,last:r,tail:n,tailMode:o}:(l.isBackwards=t,l.rendering=null,l.renderingStartTime=0,l.last=r,l.tail=n,l.tailMode=o)}function cc(e,t,n){var r=t.pendingProps,o=r.revealOrder,l=r.tail;if(le(e,t,r.children,n),r=U.current,r&2)r=r&1|2,t.flags|=128;else{if(e!==null&&e.flags&128)e:for(e=t.child;e!==null;){if(e.tag===13)e.memoizedState!==null&&ks(e,n,t);else if(e.tag===19)ks(e,n,t);else if(e.child!==null){e.child.return=e,e=e.child;continue}if(e===t)break e;for(;e.sibling===null;){if(e.return===null||e.return===t)break e;e=e.return}e.sibling.return=e.return,e=e.sibling}r&=1}if(z(U,r),!(t.mode&1))t.memoizedState=null;else switch(o){case"forwards":for(n=t.child,o=null;n!==null;)e=n.alternate,e!==null&&uo(e)===null&&(o=n),n=n.sibling;n=o,n===null?(o=t.child,t.child=null):(o=n.sibling,n.sibling=null),fl(t,!1,o,n,l);break;case"backwards":for(n=null,o=t.child,t.child=null;o!==null;){if(e=o.alternate,e!==null&&uo(e)===null){t.child=o;break}e=o.sibling,o.sibling=n,n=o,o=e}fl(t,!0,n,null,l);break;case"together":fl(t,!1,null,null,void 0);break;default:t.memoizedState=null}return t.child}function Hr(e,t){!(t.mode&1)&&e!==null&&(e.alternate=null,t.alternate=null,t.flags|=2)}function Ke(e,t,n){if(e!==null&&(t.dependencies=e.dependencies),It|=t.lanes,!(n&t.childLanes))return null;if(e!==null&&t.child!==e.child)throw Error(g(153));if(t.child!==null){for(e=t.child,n=ft(e,e.pendingProps),t.child=n,n.return=t;e.sibling!==null;)e=e.sibling,n=n.sibling=ft(e,e.pendingProps),n.return=t;n.sibling=null}return t.child}function $p(e,t,n){switch(t.tag){case 3:sc(t),ln();break;case 5:Ma(t);break;case 1:de(t.type)&&to(t);break;case 4:Ai(t,t.stateNode.containerInfo);break;case 10:var r=t.type._context,o=t.memoizedProps.value;z(oo,r._currentValue),r._currentValue=o;break;case 13:if(r=t.memoizedState,r!==null)return r.dehydrated!==null?(z(U,U.current&1),t.flags|=128,null):n&t.child.childLanes?ac(e,t,n):(z(U,U.current&1),e=Ke(e,t,n),e!==null?e.sibling:null);z(U,U.current&1);break;case 19:if(r=(n&t.childLanes)!==0,e.flags&128){if(r)return cc(e,t,n);t.flags|=128}if(o=t.memoizedState,o!==null&&(o.rendering=null,o.tail=null,o.lastEffect=null),z(U,U.current),r)break;return null;case 22:case 23:return t.lanes=0,ic(e,t,n)}return Ke(e,t,n)}var dc,bl,pc,fc;dc=function(e,t){for(var n=t.child;n!==null;){if(n.tag===5||n.tag===6)e.appendChild(n.stateNode);else if(n.tag!==4&&n.child!==null){n.child.return=n,n=n.child;continue}if(n===t)break;for(;n.sibling===null;){if(n.return===null||n.return===t)return;n=n.return}n.sibling.return=n.return,n=n.sibling}};bl=function(){};pc=function(e,t,n,r){var o=e.memoizedProps;if(o!==r){e=t.stateNode,xt(Fe.current);var l=null;switch(n){case"input":o=El(e,o),r=El(e,r),l=[];break;case"select":o=W({},o,{value:void 0}),r=W({},r,{value:void 0}),l=[];break;case"textarea":o=xl(e,o),r=xl(e,r),l=[];break;default:typeof o.onClick!="function"&&typeof r.onClick=="function"&&(e.onclick=br)}Tl(n,r);var i;n=null;for(c in o)if(!r.hasOwnProperty(c)&&o.hasOwnProperty(c)&&o[c]!=null)if(c==="style"){var u=o[c];for(i in u)u.hasOwnProperty(i)&&(n||(n={}),n[i]="")}else c!=="dangerouslySetInnerHTML"&&c!=="children"&&c!=="suppressContentEditableWarning"&&c!=="suppressHydrationWarning"&&c!=="autoFocus"&&(Un.hasOwnProperty(c)?l||(l=[]):(l=l||[]).push(c,null));for(c in r){var s=r[c];if(u=o!=null?o[c]:void 0,r.hasOwnProperty(c)&&s!==u&&(s!=null||u!=null))if(c==="style")if(u){for(i in u)!u.hasOwnProperty(i)||s&&s.hasOwnProperty(i)||(n||(n={}),n[i]="");for(i in s)s.hasOwnProperty(i)&&u[i]!==s[i]&&(n||(n={}),n[i]=s[i])}else n||(l||(l=[]),l.push(c,n)),n=s;else c==="dangerouslySetInnerHTML"?(s=s?s.__html:void 0,u=u?u.__html:void 0,s!=null&&u!==s&&(l=l||[]).push(c,s)):c==="children"?typeof s!="string"&&typeof s!="number"||(l=l||[]).push(c,""+s):c!=="suppressContentEditableWarning"&&c!=="suppressHydrationWarning"&&(Un.hasOwnProperty(c)?(s!=null&&c==="onScroll"&&D("scroll",e),l||u===s||(l=[])):(l=l||[]).push(c,s))}n&&(l=l||[]).push("style",n);var c=l;(t.updateQueue=c)&&(t.flags|=4)}};fc=function(e,t,n,r){n!==r&&(t.flags|=4)};function kn(e,t){if(!j)switch(e.tailMode){case"hidden":t=e.tail;for(var n=null;t!==null;)t.alternate!==null&&(n=t),t=t.sibling;n===null?e.tail=null:n.sibling=null;break;case"collapsed":n=e.tail;for(var r=null;n!==null;)n.alternate!==null&&(r=n),n=n.sibling;r===null?t||e.tail===null?e.tail=null:e.tail.sibling=null:r.sibling=null}}function te(e){var t=e.alternate!==null&&e.alternate.child===e.child,n=0,r=0;if(t)for(var o=e.child;o!==null;)n|=o.lanes|o.childLanes,r|=o.subtreeFlags&14680064,r|=o.flags&14680064,o.return=e,o=o.sibling;else for(o=e.child;o!==null;)n|=o.lanes|o.childLanes,r|=o.subtreeFlags,r|=o.flags,o.return=e,o=o.sibling;return e.subtreeFlags|=r,e.childLanes=n,t}function Qp(e,t,n){var r=t.pendingProps;switch(_i(t),t.tag){case 2:case 16:case 15:case 0:case 11:case 7:case 8:case 12:case 9:case 14:return te(t),null;case 1:return de(t.type)&&eo(),te(t),null;case 3:return r=t.stateNode,sn(),M(ce),M(re),zi(),r.pendingContext&&(r.context=r.pendingContext,r.pendingContext=null),(e===null||e.child===null)&&(Ir(t)?t.flags|=4:e===null||e.memoizedState.isDehydrated&&!(t.flags&256)||(t.flags|=1024,Ie!==null&&(ui(Ie),Ie=null))),bl(e,t),te(t),null;case 5:Li(t);var o=xt(qn.current);if(n=t.type,e!==null&&t.stateNode!=null)pc(e,t,n,r,o),e.ref!==t.ref&&(t.flags|=512,t.flags|=2097152);else{if(!r){if(t.stateNode===null)throw Error(g(166));return te(t),null}if(e=xt(Fe.current),Ir(t)){r=t.stateNode,n=t.type;var l=t.memoizedProps;switch(r[je]=t,r[Xn]=l,e=(t.mode&1)!==0,n){case"dialog":D("cancel",r),D("close",r);break;case"iframe":case"object":case"embed":D("load",r);break;case"video":case"audio":for(o=0;o<Rn.length;o++)D(Rn[o],r);break;case"source":D("error",r);break;case"img":case"image":case"link":D("error",r),D("load",r);break;case"details":D("toggle",r);break;case"input":Iu(r,l),D("invalid",r);break;case"select":r._wrapperState={wasMultiple:!!l.multiple},D("invalid",r);break;case"textarea":Au(r,l),D("invalid",r)}Tl(n,l),o=null;for(var i in l)if(l.hasOwnProperty(i)){var u=l[i];i==="children"?typeof u=="string"?r.textContent!==u&&(l.suppressHydrationWarning!==!0&&Pr(r.textContent,u,e),o=["children",u]):typeof u=="number"&&r.textContent!==""+u&&(l.suppressHydrationWarning!==!0&&Pr(r.textContent,u,e),o=["children",""+u]):Un.hasOwnProperty(i)&&u!=null&&i==="onScroll"&&D("scroll",r)}switch(n){case"input":gr(r),Ou(r,l,!0);break;case"textarea":gr(r),Lu(r);break;case"select":case"option":break;default:typeof l.onClick=="function"&&(r.onclick=br)}r=o,t.updateQueue=r,r!==null&&(t.flags|=4)}else{i=o.nodeType===9?o:o.ownerDocument,e==="http://www.w3.org/1999/xhtml"&&(e=Hs(n)),e==="http://www.w3.org/1999/xhtml"?n==="script"?(e=i.createElement("div"),e.innerHTML="<script><\/script>",e=e.removeChild(e.firstChild)):typeof r.is=="string"?e=i.createElement(n,{is:r.is}):(e=i.createElement(n),n==="select"&&(i=e,r.multiple?i.multiple=!0:r.size&&(i.size=r.size))):e=i.createElementNS(e,n),e[je]=t,e[Xn]=r,dc(e,t,!1,!1),t.stateNode=e;e:{switch(i=Nl(n,r),n){case"dialog":D("cancel",e),D("close",e),o=r;break;case"iframe":case"object":case"embed":D("load",e),o=r;break;case"video":case"audio":for(o=0;o<Rn.length;o++)D(Rn[o],e);o=r;break;case"source":D("error",e),o=r;break;case"img":case"image":case"link":D("error",e),D("load",e),o=r;break;case"details":D("toggle",e),o=r;break;case"input":Iu(e,r),o=El(e,r),D("invalid",e);break;case"option":o=r;break;case"select":e._wrapperState={wasMultiple:!!r.multiple},o=W({},r,{value:void 0}),D("invalid",e);break;case"textarea":Au(e,r),o=xl(e,r),D("invalid",e);break;default:o=r}Tl(n,o),u=o;for(l in u)if(u.hasOwnProperty(l)){var s=u[l];l==="style"?Gs(e,s):l==="dangerouslySetInnerHTML"?(s=s?s.__html:void 0,s!=null&&Bs(e,s)):l==="children"?typeof s=="string"?(n!=="textarea"||s!=="")&&Fn(e,s):typeof s=="number"&&Fn(e,""+s):l!=="suppressContentEditableWarning"&&l!=="suppressHydrationWarning"&&l!=="autoFocus"&&(Un.hasOwnProperty(l)?s!=null&&l==="onScroll"&&D("scroll",e):s!=null&&ci(e,l,s,i))}switch(n){case"input":gr(e),Ou(e,r,!1);break;case"textarea":gr(e),Lu(e);break;case"option":r.value!=null&&e.setAttribute("value",""+mt(r.value));break;case"select":e.multiple=!!r.multiple,l=r.value,l!=null?Zt(e,!!r.multiple,l,!1):r.defaultValue!=null&&Zt(e,!!r.multiple,r.defaultValue,!0);break;default:typeof o.onClick=="function"&&(e.onclick=br)}switch(n){case"button":case"input":case"select":case"textarea":r=!!r.autoFocus;break e;case"img":r=!0;break e;default:r=!1}}r&&(t.flags|=4)}t.ref!==null&&(t.flags|=512,t.flags|=2097152)}return te(t),null;case 6:if(e&&t.stateNode!=null)fc(e,t,e.memoizedProps,r);else{if(typeof r!="string"&&t.stateNode===null)throw Error(g(166));if(n=xt(qn.current),xt(Fe.current),Ir(t)){if(r=t.stateNode,n=t.memoizedProps,r[je]=t,(l=r.nodeValue!==n)&&(e=ve,e!==null))switch(e.tag){case 3:Pr(r.nodeValue,n,(e.mode&1)!==0);break;case 5:e.memoizedProps.suppressHydrationWarning!==!0&&Pr(r.nodeValue,n,(e.mode&1)!==0)}l&&(t.flags|=4)}else r=(n.nodeType===9?n:n.ownerDocument).createTextNode(r),r[je]=t,t.stateNode=r}return te(t),null;case 13:if(M(U),r=t.memoizedState,e===null||e.memoizedState!==null&&e.memoizedState.dehydrated!==null){if(j&&me!==null&&t.mode&1&&!(t.flags&128))Oa(),ln(),t.flags|=98560,l=!1;else if(l=Ir(t),r!==null&&r.dehydrated!==null){if(e===null){if(!l)throw Error(g(318));if(l=t.memoizedState,l=l!==null?l.dehydrated:null,!l)throw Error(g(317));l[je]=t}else ln(),!(t.flags&128)&&(t.memoizedState=null),t.flags|=4;te(t),l=!1}else Ie!==null&&(ui(Ie),Ie=null),l=!0;if(!l)return t.flags&65536?t:null}return t.flags&128?(t.lanes=n,t):(r=r!==null,r!==(e!==null&&e.memoizedState!==null)&&r&&(t.child.flags|=8192,t.mode&1&&(e===null||U.current&1?Q===0&&(Q=3):Qi())),t.updateQueue!==null&&(t.flags|=4),te(t),null);case 4:return sn(),bl(e,t),e===null&&Qn(t.stateNode.containerInfo),te(t),null;case 10:return Pi(t.type._context),te(t),null;case 17:return de(t.type)&&eo(),te(t),null;case 19:if(M(U),l=t.memoizedState,l===null)return te(t),null;if(r=(t.flags&128)!==0,i=l.rendering,i===null)if(r)kn(l,!1);else{if(Q!==0||e!==null&&e.flags&128)for(e=t.child;e!==null;){if(i=uo(e),i!==null){for(t.flags|=128,kn(l,!1),r=i.updateQueue,r!==null&&(t.updateQueue=r,t.flags|=4),t.subtreeFlags=0,r=n,n=t.child;n!==null;)l=n,e=r,l.flags&=14680066,i=l.alternate,i===null?(l.childLanes=0,l.lanes=e,l.child=null,l.subtreeFlags=0,l.memoizedProps=null,l.memoizedState=null,l.updateQueue=null,l.dependencies=null,l.stateNode=null):(l.childLanes=i.childLanes,l.lanes=i.lanes,l.child=i.child,l.subtreeFlags=0,l.deletions=null,l.memoizedProps=i.memoizedProps,l.memoizedState=i.memoizedState,l.updateQueue=i.updateQueue,l.type=i.type,e=i.dependencies,l.dependencies=e===null?null:{lanes:e.lanes,firstContext:e.firstContext}),n=n.sibling;return z(U,U.current&1|2),t.child}e=e.sibling}l.tail!==null&&V()>cn&&(t.flags|=128,r=!0,kn(l,!1),t.lanes=4194304)}else{if(!r)if(e=uo(i),e!==null){if(t.flags|=128,r=!0,n=e.updateQueue,n!==null&&(t.updateQueue=n,t.flags|=4),kn(l,!0),l.tail===null&&l.tailMode==="hidden"&&!i.alternate&&!j)return te(t),null}else 2*V()-l.renderingStartTime>cn&&n!==1073741824&&(t.flags|=128,r=!0,kn(l,!1),t.lanes=4194304);l.isBackwards?(i.sibling=t.child,t.child=i):(n=l.last,n!==null?n.sibling=i:t.child=i,l.last=i)}return l.tail!==null?(t=l.tail,l.rendering=t,l.tail=t.sibling,l.renderingStartTime=V(),t.sibling=null,n=U.current,z(U,r?n&1|2:n&1),t):(te(t),null);case 22:case 23:return $i(),r=t.memoizedState!==null,e!==null&&e.memoizedState!==null!==r&&(t.flags|=8192),r&&t.mode&1?fe&1073741824&&(te(t),t.subtreeFlags&6&&(t.flags|=8192)):te(t),null;case 24:return null;case 25:return null}throw Error(g(156,t.tag))}function Yp(e,t){switch(_i(t),t.tag){case 1:return de(t.type)&&eo(),e=t.flags,e&65536?(t.flags=e&-65537|128,t):null;case 3:return sn(),M(ce),M(re),zi(),e=t.flags,e&65536&&!(e&128)?(t.flags=e&-65537|128,t):null;case 5:return Li(t),null;case 13:if(M(U),e=t.memoizedState,e!==null&&e.dehydrated!==null){if(t.alternate===null)throw Error(g(340));ln()}return e=t.flags,e&65536?(t.flags=e&-65537|128,t):null;case 19:return M(U),null;case 4:return sn(),null;case 10:return Pi(t.type._context),null;case 22:case 23:return $i(),null;case 24:return null;default:return null}}var Lr=!1,ne=!1,Xp=typeof WeakSet=="function"?WeakSet:Set,E=null;function Kt(e,t){var n=e.ref;if(n!==null)if(typeof n=="function")try{n(null)}catch(r){H(e,t,r)}else n.current=null}function ei(e,t,n){try{n()}catch(r){H(e,t,r)}}var Cs=!1;function Kp(e,t){if(jl=qr,e=ya(),Ci(e)){if("selectionStart"in e)var n={start:e.selectionStart,end:e.selectionEnd};else e:{n=(n=e.ownerDocument)&&n.defaultView||window;var r=n.getSelection&&n.getSelection();if(r&&r.rangeCount!==0){n=r.anchorNode;var o=r.anchorOffset,l=r.focusNode;r=r.focusOffset;try{n.nodeType,l.nodeType}catch{n=null;break e}var i=0,u=-1,s=-1,c=0,v=0,h=e,m=null;t:for(;;){for(var w;h!==n||o!==0&&h.nodeType!==3||(u=i+o),h!==l||r!==0&&h.nodeType!==3||(s=i+r),h.nodeType===3&&(i+=h.nodeValue.length),(w=h.firstChild)!==null;)m=h,h=w;for(;;){if(h===e)break t;if(m===n&&++c===o&&(u=i),m===l&&++v===r&&(s=i),(w=h.nextSibling)!==null)break;h=m,m=h.parentNode}h=w}n=u===-1||s===-1?null:{start:u,end:s}}else n=null}n=n||{start:0,end:0}}else n=null;for(Ul={focusedElem:e,selectionRange:n},qr=!1,E=t;E!==null;)if(t=E,e=t.child,(t.subtreeFlags&1028)!==0&&e!==null)e.return=t,E=e;else for(;E!==null;){t=E;try{var k=t.alternate;if(t.flags&1024)switch(t.tag){case 0:case 11:case 15:break;case 1:if(k!==null){var C=k.memoizedProps,B=k.memoizedState,d=t.stateNode,a=d.getSnapshotBeforeUpdate(t.elementType===t.type?C:Re(t.type,C),B);d.__reactInternalSnapshotBeforeUpdate=a}break;case 3:var p=t.stateNode.containerInfo;p.nodeType===1?p.textContent="":p.nodeType===9&&p.documentElement&&p.removeChild(p.documentElement);break;case 5:case 6:case 4:case 17:break;default:throw Error(g(163))}}catch(y){H(t,t.return,y)}if(e=t.sibling,e!==null){e.return=t.return,E=e;break}E=t.return}return k=Cs,Cs=!1,k}function Dn(e,t,n){var r=t.updateQueue;if(r=r!==null?r.lastEffect:null,r!==null){var o=r=r.next;do{if((o.tag&e)===e){var l=o.destroy;o.destroy=void 0,l!==void 0&&ei(t,n,l)}o=o.next}while(o!==r)}}function xo(e,t){if(t=t.updateQueue,t=t!==null?t.lastEffect:null,t!==null){var n=t=t.next;do{if((n.tag&e)===e){var r=n.create;n.destroy=r()}n=n.next}while(n!==t)}}function ti(e){var t=e.ref;if(t!==null){var n=e.stateNode;switch(e.tag){case 5:e=n;break;default:e=n}typeof t=="function"?t(e):t.current=e}}function mc(e){var t=e.alternate;t!==null&&(e.alternate=null,mc(t)),e.child=null,e.deletions=null,e.sibling=null,e.tag===5&&(t=e.stateNode,t!==null&&(delete t[je],delete t[Xn],delete t[Hl],delete t[Op],delete t[Ap])),e.stateNode=null,e.return=null,e.dependencies=null,e.memoizedProps=null,e.memoizedState=null,e.pendingProps=null,e.stateNode=null,e.updateQueue=null}function vc(e){return e.tag===5||e.tag===3||e.tag===4}function xs(e){e:for(;;){for(;e.sibling===null;){if(e.return===null||vc(e.return))return null;e=e.return}for(e.sibling.return=e.return,e=e.sibling;e.tag!==5&&e.tag!==6&&e.tag!==18;){if(e.flags&2||e.child===null||e.tag===4)continue e;e.child.return=e,e=e.child}if(!(e.flags&2))return e.stateNode}}function ni(e,t,n){var r=e.tag;if(r===5||r===6)e=e.stateNode,t?n.nodeType===8?n.parentNode.insertBefore(e,t):n.insertBefore(e,t):(n.nodeType===8?(t=n.parentNode,t.insertBefore(e,n)):(t=n,t.appendChild(e)),n=n._reactRootContainer,n!=null||t.onclick!==null||(t.onclick=br));else if(r!==4&&(e=e.child,e!==null))for(ni(e,t,n),e=e.sibling;e!==null;)ni(e,t,n),e=e.sibling}function ri(e,t,n){var r=e.tag;if(r===5||r===6)e=e.stateNode,t?n.insertBefore(e,t):n.appendChild(e);else if(r!==4&&(e=e.child,e!==null))for(ri(e,t,n),e=e.sibling;e!==null;)ri(e,t,n),e=e.sibling}var q=null,Pe=!1;function be(e,t,n){for(n=n.child;n!==null;)hc(e,t,n),n=n.sibling}function hc(e,t,n){if(Ue&&typeof Ue.onCommitFiberUnmount=="function")try{Ue.onCommitFiberUnmount(ho,n)}catch{}switch(n.tag){case 5:ne||Kt(n,t);case 6:var r=q,o=Pe;q=null,be(e,t,n),q=r,Pe=o,q!==null&&(Pe?(e=q,n=n.stateNode,e.nodeType===8?e.parentNode.removeChild(n):e.removeChild(n)):q.removeChild(n.stateNode));break;case 18:q!==null&&(Pe?(e=q,n=n.stateNode,e.nodeType===8?il(e.parentNode,n):e.nodeType===1&&il(e,n),Vn(e)):il(q,n.stateNode));break;case 4:r=q,o=Pe,q=n.stateNode.containerInfo,Pe=!0,be(e,t,n),q=r,Pe=o;break;case 0:case 11:case 14:case 15:if(!ne&&(r=n.updateQueue,r!==null&&(r=r.lastEffect,r!==null))){o=r=r.next;do{var l=o,i=l.destroy;l=l.tag,i!==void 0&&(l&2||l&4)&&ei(n,t,i),o=o.next}while(o!==r)}be(e,t,n);break;case 1:if(!ne&&(Kt(n,t),r=n.stateNode,typeof r.componentWillUnmount=="function"))try{r.props=n.memoizedProps,r.state=n.memoizedState,r.componentWillUnmount()}catch(u){H(n,t,u)}be(e,t,n);break;case 21:be(e,t,n);break;case 22:n.mode&1?(ne=(r=ne)||n.memoizedState!==null,be(e,t,n),ne=r):be(e,t,n);break;default:be(e,t,n)}}function _s(e){var t=e.updateQueue;if(t!==null){e.updateQueue=null;var n=e.stateNode;n===null&&(n=e.stateNode=new Xp),t.forEach(function(r){var o=of.bind(null,e,r);n.has(r)||(n.add(r),r.then(o,o))})}}function Ne(e,t){var n=t.deletions;if(n!==null)for(var r=0;r<n.length;r++){var o=n[r];try{var l=e,i=t,u=i;e:for(;u!==null;){switch(u.tag){case 5:q=u.stateNode,Pe=!1;break e;case 3:q=u.stateNode.containerInfo,Pe=!0;break e;case 4:q=u.stateNode.containerInfo,Pe=!0;break e}u=u.return}if(q===null)throw Error(g(160));hc(l,i,o),q=null,Pe=!1;var s=o.alternate;s!==null&&(s.return=null),o.return=null}catch(c){H(o,t,c)}}if(t.subtreeFlags&12854)for(t=t.child;t!==null;)gc(t,e),t=t.sibling}function gc(e,t){var n=e.alternate,r=e.flags;switch(e.tag){case 0:case 11:case 14:case 15:if(Ne(t,e),De(e),r&4){try{Dn(3,e,e.return),xo(3,e)}catch(C){H(e,e.return,C)}try{Dn(5,e,e.return)}catch(C){H(e,e.return,C)}}break;case 1:Ne(t,e),De(e),r&512&&n!==null&&Kt(n,n.return);break;case 5:if(Ne(t,e),De(e),r&512&&n!==null&&Kt(n,n.return),e.flags&32){var o=e.stateNode;try{Fn(o,"")}catch(C){H(e,e.return,C)}}if(r&4&&(o=e.stateNode,o!=null)){var l=e.memoizedProps,i=n!==null?n.memoizedProps:l,u=e.type,s=e.updateQueue;if(e.updateQueue=null,s!==null)try{u==="input"&&l.type==="radio"&&l.name!=null&&Fs(o,l),Nl(u,i);var c=Nl(u,l);for(i=0;i<s.length;i+=2){var v=s[i],h=s[i+1];v==="style"?Gs(o,h):v==="dangerouslySetInnerHTML"?Bs(o,h):v==="children"?Fn(o,h):ci(o,v,h,c)}switch(u){case"input":kl(o,l);break;case"textarea":Ws(o,l);break;case"select":var m=o._wrapperState.wasMultiple;o._wrapperState.wasMultiple=!!l.multiple;var w=l.value;w!=null?Zt(o,!!l.multiple,w,!1):m!==!!l.multiple&&(l.defaultValue!=null?Zt(o,!!l.multiple,l.defaultValue,!0):Zt(o,!!l.multiple,l.multiple?[]:"",!1))}o[Xn]=l}catch(C){H(e,e.return,C)}}break;case 6:if(Ne(t,e),De(e),r&4){if(e.stateNode===null)throw Error(g(162));o=e.stateNode,l=e.memoizedProps;try{o.nodeValue=l}catch(C){H(e,e.return,C)}}break;case 3:if(Ne(t,e),De(e),r&4&&n!==null&&n.memoizedState.isDehydrated)try{Vn(t.containerInfo)}catch(C){H(e,e.return,C)}break;case 4:Ne(t,e),De(e);break;case 13:Ne(t,e),De(e),o=e.child,o.flags&8192&&(l=o.memoizedState!==null,o.stateNode.isHidden=l,!l||o.alternate!==null&&o.alternate.memoizedState!==null||(Vi=V())),r&4&&_s(e);break;case 22:if(v=n!==null&&n.memoizedState!==null,e.mode&1?(ne=(c=ne)||v,Ne(t,e),ne=c):Ne(t,e),De(e),r&8192){if(c=e.memoizedState!==null,(e.stateNode.isHidden=c)&&!v&&e.mode&1)for(E=e,v=e.child;v!==null;){for(h=E=v;E!==null;){switch(m=E,w=m.child,m.tag){case 0:case 11:case 14:case 15:Dn(4,m,m.return);break;case 1:Kt(m,m.return);var k=m.stateNode;if(typeof k.componentWillUnmount=="function"){r=m,n=m.return;try{t=r,k.props=t.memoizedProps,k.state=t.memoizedState,k.componentWillUnmount()}catch(C){H(r,n,C)}}break;case 5:Kt(m,m.return);break;case 22:if(m.memoizedState!==null){Ns(h);continue}}w!==null?(w.return=m,E=w):Ns(h)}v=v.sibling}e:for(v=null,h=e;;){if(h.tag===5){if(v===null){v=h;try{o=h.stateNode,c?(l=o.style,typeof l.setProperty=="function"?l.setProperty("display","none","important"):l.display="none"):(u=h.stateNode,s=h.memoizedProps.style,i=s!=null&&s.hasOwnProperty("display")?s.display:null,u.style.display=Vs("display",i))}catch(C){H(e,e.return,C)}}}else if(h.tag===6){if(v===null)try{h.stateNode.nodeValue=c?"":h.memoizedProps}catch(C){H(e,e.return,C)}}else if((h.tag!==22&&h.tag!==23||h.memoizedState===null||h===e)&&h.child!==null){h.child.return=h,h=h.child;continue}if(h===e)break e;for(;h.sibling===null;){if(h.return===null||h.return===e)break e;v===h&&(v=null),h=h.return}v===h&&(v=null),h.sibling.return=h.return,h=h.sibling}}break;case 19:Ne(t,e),De(e),r&4&&_s(e);break;case 21:break;default:Ne(t,e),De(e)}}function De(e){var t=e.flags;if(t&2){try{e:{for(var n=e.return;n!==null;){if(vc(n)){var r=n;break e}n=n.return}throw Error(g(160))}switch(r.tag){case 5:var o=r.stateNode;r.flags&32&&(Fn(o,""),r.flags&=-33);var l=xs(e);ri(e,l,o);break;case 3:case 4:var i=r.stateNode.containerInfo,u=xs(e);ni(e,u,i);break;default:throw Error(g(161))}}catch(s){H(e,e.return,s)}e.flags&=-3}t&4096&&(e.flags&=-4097)}function qp(e,t,n){E=e,yc(e,t,n)}function yc(e,t,n){for(var r=(e.mode&1)!==0;E!==null;){var o=E,l=o.child;if(o.tag===22&&r){var i=o.memoizedState!==null||Lr;if(!i){var u=o.alternate,s=u!==null&&u.memoizedState!==null||ne;u=Lr;var c=ne;if(Lr=i,(ne=s)&&!c)for(E=o;E!==null;)i=E,s=i.child,i.tag===22&&i.memoizedState!==null?Rs(o):s!==null?(s.return=i,E=s):Rs(o);for(;l!==null;)E=l,yc(l,t,n),l=l.sibling;E=o,Lr=u,ne=c}Ts(e,t,n)}else o.subtreeFlags&8772&&l!==null?(l.return=o,E=l):Ts(e,t,n)}}function Ts(e){for(;E!==null;){var t=E;if(t.flags&8772){var n=t.alternate;try{if(t.flags&8772)switch(t.tag){case 0:case 11:case 15:ne||xo(5,t);break;case 1:var r=t.stateNode;if(t.flags&4&&!ne)if(n===null)r.componentDidMount();else{var o=t.elementType===t.type?n.memoizedProps:Re(t.type,n.memoizedProps);r.componentDidUpdate(o,n.memoizedState,r.__reactInternalSnapshotBeforeUpdate)}var l=t.updateQueue;l!==null&&cs(t,l,r);break;case 3:var i=t.updateQueue;if(i!==null){if(n=null,t.child!==null)switch(t.child.tag){case 5:n=t.child.stateNode;break;case 1:n=t.child.stateNode}cs(t,i,n)}break;case 5:var u=t.stateNode;if(n===null&&t.flags&4){n=u;var s=t.memoizedProps;switch(t.type){case"button":case"input":case"select":case"textarea":s.autoFocus&&n.focus();break;case"img":s.src&&(n.src=s.src)}}break;case 6:break;case 4:break;case 12:break;case 13:if(t.memoizedState===null){var c=t.alternate;if(c!==null){var v=c.memoizedState;if(v!==null){var h=v.dehydrated;h!==null&&Vn(h)}}}break;case 19:case 17:case 21:case 22:case 23:case 25:break;default:throw Error(g(163))}ne||t.flags&512&&ti(t)}catch(m){H(t,t.return,m)}}if(t===e){E=null;break}if(n=t.sibling,n!==null){n.return=t.return,E=n;break}E=t.return}}function Ns(e){for(;E!==null;){var t=E;if(t===e){E=null;break}var n=t.sibling;if(n!==null){n.return=t.return,E=n;break}E=t.return}}function Rs(e){for(;E!==null;){var t=E;try{switch(t.tag){case 0:case 11:case 15:var n=t.return;try{xo(4,t)}catch(s){H(t,n,s)}break;case 1:var r=t.stateNode;if(typeof r.componentDidMount=="function"){var o=t.return;try{r.componentDidMount()}catch(s){H(t,o,s)}}var l=t.return;try{ti(t)}catch(s){H(t,l,s)}break;case 5:var i=t.return;try{ti(t)}catch(s){H(t,i,s)}}}catch(s){H(t,t.return,s)}if(t===e){E=null;break}var u=t.sibling;if(u!==null){u.return=t.return,E=u;break}E=t.return}}var Zp=Math.ceil,co=qe.ReactCurrentDispatcher,Hi=qe.ReactCurrentOwner,Ce=qe.ReactCurrentBatchConfig,I=0,K=null,G=null,Z=0,fe=0,qt=gt(0),Q=0,er=null,It=0,_o=0,Bi=0,Mn=null,se=null,Vi=0,cn=1/0,He=null,po=!1,oi=null,dt=null,zr=!1,lt=null,fo=0,jn=0,li=null,Br=-1,Vr=0;function ie(){return I&6?V():Br!==-1?Br:Br=V()}function pt(e){return e.mode&1?I&2&&Z!==0?Z&-Z:zp.transition!==null?(Vr===0&&(Vr=na()),Vr):(e=A,e!==0||(e=window.event,e=e===void 0?16:aa(e.type)),e):1}function Ae(e,t,n,r){if(50<jn)throw jn=0,li=null,Error(g(185));tr(e,n,r),(!(I&2)||e!==K)&&(e===K&&(!(I&2)&&(_o|=n),Q===4&&rt(e,Z)),pe(e,r),n===1&&I===0&&!(t.mode&1)&&(cn=V()+500,Eo&&yt()))}function pe(e,t){var n=e.callbackNode;Md(e,t);var r=Kr(e,e===K?Z:0);if(r===0)n!==null&&Mu(n),e.callbackNode=null,e.callbackPriority=0;else if(t=r&-r,e.callbackPriority!==t){if(n!=null&&Mu(n),t===1)e.tag===0?Lp(Ps.bind(null,e)):Ra(Ps.bind(null,e)),Pp(function(){!(I&6)&&yt()}),n=null;else{switch(ra(r)){case 1:n=vi;break;case 4:n=ea;break;case 16:n=Xr;break;case 536870912:n=ta;break;default:n=Xr}n=Tc(n,Sc.bind(null,e))}e.callbackPriority=t,e.callbackNode=n}}function Sc(e,t){if(Br=-1,Vr=0,I&6)throw Error(g(327));var n=e.callbackNode;if(nn()&&e.callbackNode!==n)return null;var r=Kr(e,e===K?Z:0);if(r===0)return null;if(r&30||r&e.expiredLanes||t)t=mo(e,r);else{t=r;var o=I;I|=2;var l=Ec();(K!==e||Z!==t)&&(He=null,cn=V()+500,_t(e,t));do try{ef();break}catch(u){wc(e,u)}while(!0);Ri(),co.current=l,I=o,G!==null?t=0:(K=null,Z=0,t=Q)}if(t!==0){if(t===2&&(o=Al(e),o!==0&&(r=o,t=ii(e,o))),t===1)throw n=er,_t(e,0),rt(e,r),pe(e,V()),n;if(t===6)rt(e,r);else{if(o=e.current.alternate,!(r&30)&&!Jp(o)&&(t=mo(e,r),t===2&&(l=Al(e),l!==0&&(r=l,t=ii(e,l))),t===1))throw n=er,_t(e,0),rt(e,r),pe(e,V()),n;switch(e.finishedWork=o,e.finishedLanes=r,t){case 0:case 1:throw Error(g(345));case 2:Et(e,se,He);break;case 3:if(rt(e,r),(r&130023424)===r&&(t=Vi+500-V(),10<t)){if(Kr(e,0)!==0)break;if(o=e.suspendedLanes,(o&r)!==r){ie(),e.pingedLanes|=e.suspendedLanes&o;break}e.timeoutHandle=Wl(Et.bind(null,e,se,He),t);break}Et(e,se,He);break;case 4:if(rt(e,r),(r&4194240)===r)break;for(t=e.eventTimes,o=-1;0<r;){var i=31-Oe(r);l=1<<i,i=t[i],i>o&&(o=i),r&=~l}if(r=o,r=V()-r,r=(120>r?120:480>r?480:1080>r?1080:1920>r?1920:3e3>r?3e3:4320>r?4320:1960*Zp(r/1960))-r,10<r){e.timeoutHandle=Wl(Et.bind(null,e,se,He),r);break}Et(e,se,He);break;case 5:Et(e,se,He);break;default:throw Error(g(329))}}}return pe(e,V()),e.callbackNode===n?Sc.bind(null,e):null}function ii(e,t){var n=Mn;return e.current.memoizedState.isDehydrated&&(_t(e,t).flags|=256),e=mo(e,t),e!==2&&(t=se,se=n,t!==null&&ui(t)),e}function ui(e){se===null?se=e:se.push.apply(se,e)}function Jp(e){for(var t=e;;){if(t.flags&16384){var n=t.updateQueue;if(n!==null&&(n=n.stores,n!==null))for(var r=0;r<n.length;r++){var o=n[r],l=o.getSnapshot;o=o.value;try{if(!Le(l(),o))return!1}catch{return!1}}}if(n=t.child,t.subtreeFlags&16384&&n!==null)n.return=t,t=n;else{if(t===e)break;for(;t.sibling===null;){if(t.return===null||t.return===e)return!0;t=t.return}t.sibling.return=t.return,t=t.sibling}}return!0}function rt(e,t){for(t&=~Bi,t&=~_o,e.suspendedLanes|=t,e.pingedLanes&=~t,e=e.expirationTimes;0<t;){var n=31-Oe(t),r=1<<n;e[n]=-1,t&=~r}}function Ps(e){if(I&6)throw Error(g(327));nn();var t=Kr(e,0);if(!(t&1))return pe(e,V()),null;var n=mo(e,t);if(e.tag!==0&&n===2){var r=Al(e);r!==0&&(t=r,n=ii(e,r))}if(n===1)throw n=er,_t(e,0),rt(e,t),pe(e,V()),n;if(n===6)throw Error(g(345));return e.finishedWork=e.current.alternate,e.finishedLanes=t,Et(e,se,He),pe(e,V()),null}function Gi(e,t){var n=I;I|=1;try{return e(t)}finally{I=n,I===0&&(cn=V()+500,Eo&&yt())}}function Ot(e){lt!==null&&lt.tag===0&&!(I&6)&&nn();var t=I;I|=1;var n=Ce.transition,r=A;try{if(Ce.transition=null,A=1,e)return e()}finally{A=r,Ce.transition=n,I=t,!(I&6)&&yt()}}function $i(){fe=qt.current,M(qt)}function _t(e,t){e.finishedWork=null,e.finishedLanes=0;var n=e.timeoutHandle;if(n!==-1&&(e.timeoutHandle=-1,Rp(n)),G!==null)for(n=G.return;n!==null;){var r=n;switch(_i(r),r.tag){case 1:r=r.type.childContextTypes,r!=null&&eo();break;case 3:sn(),M(ce),M(re),zi();break;case 5:Li(r);break;case 4:sn();break;case 13:M(U);break;case 19:M(U);break;case 10:Pi(r.type._context);break;case 22:case 23:$i()}n=n.return}if(K=e,G=e=ft(e.current,null),Z=fe=t,Q=0,er=null,Bi=_o=It=0,se=Mn=null,Ct!==null){for(t=0;t<Ct.length;t++)if(n=Ct[t],r=n.interleaved,r!==null){n.interleaved=null;var o=r.next,l=n.pending;if(l!==null){var i=l.next;l.next=o,r.next=i}n.pending=r}Ct=null}return e}function wc(e,t){do{var n=G;try{if(Ri(),Fr.current=ao,so){for(var r=F.memoizedState;r!==null;){var o=r.queue;o!==null&&(o.pending=null),r=r.next}so=!1}if(Pt=0,X=$=F=null,zn=!1,Zn=0,Hi.current=null,n===null||n.return===null){Q=1,er=t,G=null;break}e:{var l=e,i=n.return,u=n,s=t;if(t=Z,u.flags|=32768,s!==null&&typeof s=="object"&&typeof s.then=="function"){var c=s,v=u,h=v.tag;if(!(v.mode&1)&&(h===0||h===11||h===15)){var m=v.alternate;m?(v.updateQueue=m.updateQueue,v.memoizedState=m.memoizedState,v.lanes=m.lanes):(v.updateQueue=null,v.memoizedState=null)}var w=hs(i);if(w!==null){w.flags&=-257,gs(w,i,u,l,t),w.mode&1&&vs(l,c,t),t=w,s=c;var k=t.updateQueue;if(k===null){var C=new Set;C.add(s),t.updateQueue=C}else k.add(s);break e}else{if(!(t&1)){vs(l,c,t),Qi();break e}s=Error(g(426))}}else if(j&&u.mode&1){var B=hs(i);if(B!==null){!(B.flags&65536)&&(B.flags|=256),gs(B,i,u,l,t),Ti(an(s,u));break e}}l=s=an(s,u),Q!==4&&(Q=2),Mn===null?Mn=[l]:Mn.push(l),l=i;do{switch(l.tag){case 3:l.flags|=65536,t&=-t,l.lanes|=t;var d=rc(l,s,t);as(l,d);break e;case 1:u=s;var a=l.type,p=l.stateNode;if(!(l.flags&128)&&(typeof a.getDerivedStateFromError=="function"||p!==null&&typeof p.componentDidCatch=="function"&&(dt===null||!dt.has(p)))){l.flags|=65536,t&=-t,l.lanes|=t;var y=oc(l,u,t);as(l,y);break e}}l=l.return}while(l!==null)}Cc(n)}catch(x){t=x,G===n&&n!==null&&(G=n=n.return);continue}break}while(!0)}function Ec(){var e=co.current;return co.current=ao,e===null?ao:e}function Qi(){(Q===0||Q===3||Q===2)&&(Q=4),K===null||!(It&268435455)&&!(_o&268435455)||rt(K,Z)}function mo(e,t){var n=I;I|=2;var r=Ec();(K!==e||Z!==t)&&(He=null,_t(e,t));do try{bp();break}catch(o){wc(e,o)}while(!0);if(Ri(),I=n,co.current=r,G!==null)throw Error(g(261));return K=null,Z=0,Q}function bp(){for(;G!==null;)kc(G)}function ef(){for(;G!==null&&!Nd();)kc(G)}function kc(e){var t=_c(e.alternate,e,fe);e.memoizedProps=e.pendingProps,t===null?Cc(e):G=t,Hi.current=null}function Cc(e){var t=e;do{var n=t.alternate;if(e=t.return,t.flags&32768){if(n=Yp(n,t),n!==null){n.flags&=32767,G=n;return}if(e!==null)e.flags|=32768,e.subtreeFlags=0,e.deletions=null;else{Q=6,G=null;return}}else if(n=Qp(n,t,fe),n!==null){G=n;return}if(t=t.sibling,t!==null){G=t;return}G=t=e}while(t!==null);Q===0&&(Q=5)}function Et(e,t,n){var r=A,o=Ce.transition;try{Ce.transition=null,A=1,tf(e,t,n,r)}finally{Ce.transition=o,A=r}return null}function tf(e,t,n,r){do nn();while(lt!==null);if(I&6)throw Error(g(327));n=e.finishedWork;var o=e.finishedLanes;if(n===null)return null;if(e.finishedWork=null,e.finishedLanes=0,n===e.current)throw Error(g(177));e.callbackNode=null,e.callbackPriority=0;var l=n.lanes|n.childLanes;if(jd(e,l),e===K&&(G=K=null,Z=0),!(n.subtreeFlags&2064)&&!(n.flags&2064)||zr||(zr=!0,Tc(Xr,function(){return nn(),null})),l=(n.flags&15990)!==0,n.subtreeFlags&15990||l){l=Ce.transition,Ce.transition=null;var i=A;A=1;var u=I;I|=4,Hi.current=null,Kp(e,n),gc(n,e),Cp(Ul),qr=!!jl,Ul=jl=null,e.current=n,qp(n,e,o),Rd(),I=u,A=i,Ce.transition=l}else e.current=n;if(zr&&(zr=!1,lt=e,fo=o),l=e.pendingLanes,l===0&&(dt=null),Od(n.stateNode,r),pe(e,V()),t!==null)for(r=e.onRecoverableError,n=0;n<t.length;n++)o=t[n],r(o.value,{componentStack:o.stack,digest:o.digest});if(po)throw po=!1,e=oi,oi=null,e;return fo&1&&e.tag!==0&&nn(),l=e.pendingLanes,l&1?e===li?jn++:(jn=0,li=e):jn=0,yt(),null}function nn(){if(lt!==null){var e=ra(fo),t=Ce.transition,n=A;try{if(Ce.transition=null,A=16>e?16:e,lt===null)var r=!1;else{if(e=lt,lt=null,fo=0,I&6)throw Error(g(331));var o=I;for(I|=4,E=e.current;E!==null;){var l=E,i=l.child;if(E.flags&16){var u=l.deletions;if(u!==null){for(var s=0;s<u.length;s++){var c=u[s];for(E=c;E!==null;){var v=E;switch(v.tag){case 0:case 11:case 15:Dn(8,v,l)}var h=v.child;if(h!==null)h.return=v,E=h;else for(;E!==null;){v=E;var m=v.sibling,w=v.return;if(mc(v),v===c){E=null;break}if(m!==null){m.return=w,E=m;break}E=w}}}var k=l.alternate;if(k!==null){var C=k.child;if(C!==null){k.child=null;do{var B=C.sibling;C.sibling=null,C=B}while(C!==null)}}E=l}}if(l.subtreeFlags&2064&&i!==null)i.return=l,E=i;else e:for(;E!==null;){if(l=E,l.flags&2048)switch(l.tag){case 0:case 11:case 15:Dn(9,l,l.return)}var d=l.sibling;if(d!==null){d.return=l.return,E=d;break e}E=l.return}}var a=e.current;for(E=a;E!==null;){i=E;var p=i.child;if(i.subtreeFlags&2064&&p!==null)p.return=i,E=p;else e:for(i=a;E!==null;){if(u=E,u.flags&2048)try{switch(u.tag){case 0:case 11:case 15:xo(9,u)}}catch(x){H(u,u.return,x)}if(u===i){E=null;break e}var y=u.sibling;if(y!==null){y.return=u.return,E=y;break e}E=u.return}}if(I=o,yt(),Ue&&typeof Ue.onPostCommitFiberRoot=="function")try{Ue.onPostCommitFiberRoot(ho,e)}catch{}r=!0}return r}finally{A=n,Ce.transition=t}}return!1}function Is(e,t,n){t=an(n,t),t=rc(e,t,1),e=ct(e,t,1),t=ie(),e!==null&&(tr(e,1,t),pe(e,t))}function H(e,t,n){if(e.tag===3)Is(e,e,n);else for(;t!==null;){if(t.tag===3){Is(t,e,n);break}else if(t.tag===1){var r=t.stateNode;if(typeof t.type.getDerivedStateFromError=="function"||typeof r.componentDidCatch=="function"&&(dt===null||!dt.has(r))){e=an(n,e),e=oc(t,e,1),t=ct(t,e,1),e=ie(),t!==null&&(tr(t,1,e),pe(t,e));break}}t=t.return}}function nf(e,t,n){var r=e.pingCache;r!==null&&r.delete(t),t=ie(),e.pingedLanes|=e.suspendedLanes&n,K===e&&(Z&n)===n&&(Q===4||Q===3&&(Z&130023424)===Z&&500>V()-Vi?_t(e,0):Bi|=n),pe(e,t)}function xc(e,t){t===0&&(e.mode&1?(t=wr,wr<<=1,!(wr&130023424)&&(wr=4194304)):t=1);var n=ie();e=Xe(e,t),e!==null&&(tr(e,t,n),pe(e,n))}function rf(e){var t=e.memoizedState,n=0;t!==null&&(n=t.retryLane),xc(e,n)}function of(e,t){var n=0;switch(e.tag){case 13:var r=e.stateNode,o=e.memoizedState;o!==null&&(n=o.retryLane);break;case 19:r=e.stateNode;break;default:throw Error(g(314))}r!==null&&r.delete(t),xc(e,n)}var _c;_c=function(e,t,n){if(e!==null)if(e.memoizedProps!==t.pendingProps||ce.current)ae=!0;else{if(!(e.lanes&n)&&!(t.flags&128))return ae=!1,$p(e,t,n);ae=!!(e.flags&131072)}else ae=!1,j&&t.flags&1048576&&Pa(t,ro,t.index);switch(t.lanes=0,t.tag){case 2:var r=t.type;Hr(e,t),e=t.pendingProps;var o=on(t,re.current);tn(t,n),o=Mi(null,t,r,e,o,n);var l=ji();return t.flags|=1,typeof o=="object"&&o!==null&&typeof o.render=="function"&&o.$$typeof===void 0?(t.tag=1,t.memoizedState=null,t.updateQueue=null,de(r)?(l=!0,to(t)):l=!1,t.memoizedState=o.state!==null&&o.state!==void 0?o.state:null,Oi(t),o.updater=Co,t.stateNode=o,o._reactInternals=t,Yl(t,r,e,n),t=ql(null,t,r,!0,l,n)):(t.tag=0,j&&l&&xi(t),le(null,t,o,n),t=t.child),t;case 16:r=t.elementType;e:{switch(Hr(e,t),e=t.pendingProps,o=r._init,r=o(r._payload),t.type=r,o=t.tag=uf(r),e=Re(r,e),o){case 0:t=Kl(null,t,r,e,n);break e;case 1:t=ws(null,t,r,e,n);break e;case 11:t=ys(null,t,r,e,n);break e;case 14:t=Ss(null,t,r,Re(r.type,e),n);break e}throw Error(g(306,r,""))}return t;case 0:return r=t.type,o=t.pendingProps,o=t.elementType===r?o:Re(r,o),Kl(e,t,r,o,n);case 1:return r=t.type,o=t.pendingProps,o=t.elementType===r?o:Re(r,o),ws(e,t,r,o,n);case 3:e:{if(sc(t),e===null)throw Error(g(387));r=t.pendingProps,l=t.memoizedState,o=l.element,Da(e,t),io(t,r,null,n);var i=t.memoizedState;if(r=i.element,l.isDehydrated)if(l={element:r,isDehydrated:!1,cache:i.cache,pendingSuspenseBoundaries:i.pendingSuspenseBoundaries,transitions:i.transitions},t.updateQueue.baseState=l,t.memoizedState=l,t.flags&256){o=an(Error(g(423)),t),t=Es(e,t,r,n,o);break e}else if(r!==o){o=an(Error(g(424)),t),t=Es(e,t,r,n,o);break e}else for(me=at(t.stateNode.containerInfo.firstChild),ve=t,j=!0,Ie=null,n=La(t,null,r,n),t.child=n;n;)n.flags=n.flags&-3|4096,n=n.sibling;else{if(ln(),r===o){t=Ke(e,t,n);break e}le(e,t,r,n)}t=t.child}return t;case 5:return Ma(t),e===null&&Gl(t),r=t.type,o=t.pendingProps,l=e!==null?e.memoizedProps:null,i=o.children,Fl(r,o)?i=null:l!==null&&Fl(r,l)&&(t.flags|=32),uc(e,t),le(e,t,i,n),t.child;case 6:return e===null&&Gl(t),null;case 13:return ac(e,t,n);case 4:return Ai(t,t.stateNode.containerInfo),r=t.pendingProps,e===null?t.child=un(t,null,r,n):le(e,t,r,n),t.child;case 11:return r=t.type,o=t.pendingProps,o=t.elementType===r?o:Re(r,o),ys(e,t,r,o,n);case 7:return le(e,t,t.pendingProps,n),t.child;case 8:return le(e,t,t.pendingProps.children,n),t.child;case 12:return le(e,t,t.pendingProps.children,n),t.child;case 10:e:{if(r=t.type._context,o=t.pendingProps,l=t.memoizedProps,i=o.value,z(oo,r._currentValue),r._currentValue=i,l!==null)if(Le(l.value,i)){if(l.children===o.children&&!ce.current){t=Ke(e,t,n);break e}}else for(l=t.child,l!==null&&(l.return=t);l!==null;){var u=l.dependencies;if(u!==null){i=l.child;for(var s=u.firstContext;s!==null;){if(s.context===r){if(l.tag===1){s=$e(-1,n&-n),s.tag=2;var c=l.updateQueue;if(c!==null){c=c.shared;var v=c.pending;v===null?s.next=s:(s.next=v.next,v.next=s),c.pending=s}}l.lanes|=n,s=l.alternate,s!==null&&(s.lanes|=n),$l(l.return,n,t),u.lanes|=n;break}s=s.next}}else if(l.tag===10)i=l.type===t.type?null:l.child;else if(l.tag===18){if(i=l.return,i===null)throw Error(g(341));i.lanes|=n,u=i.alternate,u!==null&&(u.lanes|=n),$l(i,n,t),i=l.sibling}else i=l.child;if(i!==null)i.return=l;else for(i=l;i!==null;){if(i===t){i=null;break}if(l=i.sibling,l!==null){l.return=i.return,i=l;break}i=i.return}l=i}le(e,t,o.children,n),t=t.child}return t;case 9:return o=t.type,r=t.pendingProps.children,tn(t,n),o=xe(o),r=r(o),t.flags|=1,le(e,t,r,n),t.child;case 14:return r=t.type,o=Re(r,t.pendingProps),o=Re(r.type,o),Ss(e,t,r,o,n);case 15:return lc(e,t,t.type,t.pendingProps,n);case 17:return r=t.type,o=t.pendingProps,o=t.elementType===r?o:Re(r,o),Hr(e,t),t.tag=1,de(r)?(e=!0,to(t)):e=!1,tn(t,n),nc(t,r,o),Yl(t,r,o,n),ql(null,t,r,!0,e,n);case 19:return cc(e,t,n);case 22:return ic(e,t,n)}throw Error(g(156,t.tag))};function Tc(e,t){return bs(e,t)}function lf(e,t,n,r){this.tag=e,this.key=n,this.sibling=this.child=this.return=this.stateNode=this.type=this.elementType=null,this.index=0,this.ref=null,this.pendingProps=t,this.dependencies=this.memoizedState=this.updateQueue=this.memoizedProps=null,this.mode=r,this.subtreeFlags=this.flags=0,this.deletions=null,this.childLanes=this.lanes=0,this.alternate=null}function ke(e,t,n,r){return new lf(e,t,n,r)}function Yi(e){return e=e.prototype,!(!e||!e.isReactComponent)}function uf(e){if(typeof e=="function")return Yi(e)?1:0;if(e!=null){if(e=e.$$typeof,e===pi)return 11;if(e===fi)return 14}return 2}function ft(e,t){var n=e.alternate;return n===null?(n=ke(e.tag,t,e.key,e.mode),n.elementType=e.elementType,n.type=e.type,n.stateNode=e.stateNode,n.alternate=e,e.alternate=n):(n.pendingProps=t,n.type=e.type,n.flags=0,n.subtreeFlags=0,n.deletions=null),n.flags=e.flags&14680064,n.childLanes=e.childLanes,n.lanes=e.lanes,n.child=e.child,n.memoizedProps=e.memoizedProps,n.memoizedState=e.memoizedState,n.updateQueue=e.updateQueue,t=e.dependencies,n.dependencies=t===null?null:{lanes:t.lanes,firstContext:t.firstContext},n.sibling=e.sibling,n.index=e.index,n.ref=e.ref,n}function Gr(e,t,n,r,o,l){var i=2;if(r=e,typeof e=="function")Yi(e)&&(i=1);else if(typeof e=="string")i=5;else e:switch(e){case Wt:return Tt(n.children,o,l,t);case di:i=8,o|=8;break;case gl:return e=ke(12,n,t,o|2),e.elementType=gl,e.lanes=l,e;case yl:return e=ke(13,n,t,o),e.elementType=yl,e.lanes=l,e;case Sl:return e=ke(19,n,t,o),e.elementType=Sl,e.lanes=l,e;case Ms:return To(n,o,l,t);default:if(typeof e=="object"&&e!==null)switch(e.$$typeof){case zs:i=10;break e;case Ds:i=9;break e;case pi:i=11;break e;case fi:i=14;break e;case et:i=16,r=null;break e}throw Error(g(130,e==null?e:typeof e,""))}return t=ke(i,n,t,o),t.elementType=e,t.type=r,t.lanes=l,t}function Tt(e,t,n,r){return e=ke(7,e,r,t),e.lanes=n,e}function To(e,t,n,r){return e=ke(22,e,r,t),e.elementType=Ms,e.lanes=n,e.stateNode={isHidden:!1},e}function ml(e,t,n){return e=ke(6,e,null,t),e.lanes=n,e}function vl(e,t,n){return t=ke(4,e.children!==null?e.children:[],e.key,t),t.lanes=n,t.stateNode={containerInfo:e.containerInfo,pendingChildren:null,implementation:e.implementation},t}function sf(e,t,n,r,o){this.tag=t,this.containerInfo=e,this.finishedWork=this.pingCache=this.current=this.pendingChildren=null,this.timeoutHandle=-1,this.callbackNode=this.pendingContext=this.context=null,this.callbackPriority=0,this.eventTimes=Jo(0),this.expirationTimes=Jo(-1),this.entangledLanes=this.finishedLanes=this.mutableReadLanes=this.expiredLanes=this.pingedLanes=this.suspendedLanes=this.pendingLanes=0,this.entanglements=Jo(0),this.identifierPrefix=r,this.onRecoverableError=o,this.mutableSourceEagerHydrationData=null}function Xi(e,t,n,r,o,l,i,u,s){return e=new sf(e,t,n,u,s),t===1?(t=1,l===!0&&(t|=8)):t=0,l=ke(3,null,null,t),e.current=l,l.stateNode=e,l.memoizedState={element:r,isDehydrated:n,cache:null,transitions:null,pendingSuspenseBoundaries:null},Oi(l),e}function af(e,t,n){var r=3<arguments.length&&arguments[3]!==void 0?arguments[3]:null;return{$$typeof:Ft,key:r==null?null:""+r,children:e,containerInfo:t,implementation:n}}function Nc(e){if(!e)return vt;e=e._reactInternals;e:{if(Lt(e)!==e||e.tag!==1)throw Error(g(170));var t=e;do{switch(t.tag){case 3:t=t.stateNode.context;break e;case 1:if(de(t.type)){t=t.stateNode.__reactInternalMemoizedMergedChildContext;break e}}t=t.return}while(t!==null);throw Error(g(171))}if(e.tag===1){var n=e.type;if(de(n))return Na(e,n,t)}return t}function Rc(e,t,n,r,o,l,i,u,s){return e=Xi(n,r,!0,e,o,l,i,u,s),e.context=Nc(null),n=e.current,r=ie(),o=pt(n),l=$e(r,o),l.callback=t!=null?t:null,ct(n,l,o),e.current.lanes=o,tr(e,o,r),pe(e,r),e}function No(e,t,n,r){var o=t.current,l=ie(),i=pt(o);return n=Nc(n),t.context===null?t.context=n:t.pendingContext=n,t=$e(l,i),t.payload={element:e},r=r===void 0?null:r,r!==null&&(t.callback=r),e=ct(o,t,i),e!==null&&(Ae(e,o,i,l),Ur(e,o,i)),i}function vo(e){if(e=e.current,!e.child)return null;switch(e.child.tag){case 5:return e.child.stateNode;default:return e.child.stateNode}}function Os(e,t){if(e=e.memoizedState,e!==null&&e.dehydrated!==null){var n=e.retryLane;e.retryLane=n!==0&&n<t?n:t}}function Ki(e,t){Os(e,t),(e=e.alternate)&&Os(e,t)}function cf(){return null}var Pc=typeof reportError=="function"?reportError:function(e){console.error(e)};function qi(e){this._internalRoot=e}Ro.prototype.render=qi.prototype.render=function(e){var t=this._internalRoot;if(t===null)throw Error(g(409));No(e,t,null,null)};Ro.prototype.unmount=qi.prototype.unmount=function(){var e=this._internalRoot;if(e!==null){this._internalRoot=null;var t=e.containerInfo;Ot(function(){No(null,e,null,null)}),t[Ye]=null}};function Ro(e){this._internalRoot=e}Ro.prototype.unstable_scheduleHydration=function(e){if(e){var t=ia();e={blockedOn:null,target:e,priority:t};for(var n=0;n<nt.length&&t!==0&&t<nt[n].priority;n++);nt.splice(n,0,e),n===0&&sa(e)}};function Zi(e){return!(!e||e.nodeType!==1&&e.nodeType!==9&&e.nodeType!==11)}function Po(e){return!(!e||e.nodeType!==1&&e.nodeType!==9&&e.nodeType!==11&&(e.nodeType!==8||e.nodeValue!==" react-mount-point-unstable "))}function As(){}function df(e,t,n,r,o){if(o){if(typeof r=="function"){var l=r;r=function(){var c=vo(i);l.call(c)}}var i=Rc(t,r,e,0,null,!1,!1,"",As);return e._reactRootContainer=i,e[Ye]=i.current,Qn(e.nodeType===8?e.parentNode:e),Ot(),i}for(;o=e.lastChild;)e.removeChild(o);if(typeof r=="function"){var u=r;r=function(){var c=vo(s);u.call(c)}}var s=Xi(e,0,!1,null,null,!1,!1,"",As);return e._reactRootContainer=s,e[Ye]=s.current,Qn(e.nodeType===8?e.parentNode:e),Ot(function(){No(t,s,n,r)}),s}function Io(e,t,n,r,o){var l=n._reactRootContainer;if(l){var i=l;if(typeof o=="function"){var u=o;o=function(){var s=vo(i);u.call(s)}}No(t,i,e,o)}else i=df(n,t,e,o,r);return vo(i)}oa=function(e){switch(e.tag){case 3:var t=e.stateNode;if(t.current.memoizedState.isDehydrated){var n=Nn(t.pendingLanes);n!==0&&(hi(t,n|1),pe(t,V()),!(I&6)&&(cn=V()+500,yt()))}break;case 13:Ot(function(){var r=Xe(e,1);if(r!==null){var o=ie();Ae(r,e,1,o)}}),Ki(e,1)}};gi=function(e){if(e.tag===13){var t=Xe(e,134217728);if(t!==null){var n=ie();Ae(t,e,134217728,n)}Ki(e,134217728)}};la=function(e){if(e.tag===13){var t=pt(e),n=Xe(e,t);if(n!==null){var r=ie();Ae(n,e,t,r)}Ki(e,t)}};ia=function(){return A};ua=function(e,t){var n=A;try{return A=e,t()}finally{A=n}};Pl=function(e,t,n){switch(t){case"input":if(kl(e,n),t=n.name,n.type==="radio"&&t!=null){for(n=e;n.parentNode;)n=n.parentNode;for(n=n.querySelectorAll("input[name="+JSON.stringify(""+t)+'][type="radio"]'),t=0;t<n.length;t++){var r=n[t];if(r!==e&&r.form===e.form){var o=wo(r);if(!o)throw Error(g(90));Us(r),kl(r,o)}}}break;case"textarea":Ws(e,n);break;case"select":t=n.value,t!=null&&Zt(e,!!n.multiple,t,!1)}};Ys=Gi;Xs=Ot;var pf={usingClientEntryPoint:!1,Events:[rr,Gt,wo,$s,Qs,Gi]},Cn={findFiberByHostInstance:kt,bundleType:0,version:"18.3.1",rendererPackageName:"react-dom"},ff={bundleType:Cn.bundleType,version:Cn.version,rendererPackageName:Cn.rendererPackageName,rendererConfig:Cn.rendererConfig,overrideHookState:null,overrideHookStateDeletePath:null,overrideHookStateRenamePath:null,overrideProps:null,overridePropsDeletePath:null,overridePropsRenamePath:null,setErrorHandler:null,setSuspenseHandler:null,scheduleUpdate:null,currentDispatcherRef:qe.ReactCurrentDispatcher,findHostInstanceByFiber:function(e){return e=Zs(e),e===null?null:e.stateNode},findFiberByHostInstance:Cn.findFiberByHostInstance||cf,findHostInstancesForRefresh:null,scheduleRefresh:null,scheduleRoot:null,setRefreshHandler:null,getCurrentFiber:null,reconcilerVersion:"18.3.1-next-f1338f8080-20240426"};if(typeof __REACT_DEVTOOLS_GLOBAL_HOOK__!="undefined"&&(xn=__REACT_DEVTOOLS_GLOBAL_HOOK__,!xn.isDisabled&&xn.supportsFiber))try{ho=xn.inject(ff),Ue=xn}catch{}var xn;ye.__SECRET_INTERNALS_DO_NOT_USE_OR_YOU_WILL_BE_FIRED=pf;ye.createPortal=function(e,t){var n=2<arguments.length&&arguments[2]!==void 0?arguments[2]:null;if(!Zi(t))throw Error(g(200));return af(e,t,null,n)};ye.createRoot=function(e,t){if(!Zi(e))throw Error(g(299));var n=!1,r="",o=Pc;return t!=null&&(t.unstable_strictMode===!0&&(n=!0),t.identifierPrefix!==void 0&&(r=t.identifierPrefix),t.onRecoverableError!==void 0&&(o=t.onRecoverableError)),t=Xi(e,1,!1,null,null,n,!1,r,o),e[Ye]=t.current,Qn(e.nodeType===8?e.parentNode:e),new qi(t)};ye.findDOMNode=function(e){if(e==null)return null;if(e.nodeType===1)return e;var t=e._reactInternals;if(t===void 0)throw typeof e.render=="function"?Error(g(188)):(e=Object.keys(e).join(","),Error(g(268,e)));return e=Zs(t),e=e===null?null:e.stateNode,e};ye.flushSync=function(e){return Ot(e)};ye.hydrate=function(e,t,n){if(!Po(t))throw Error(g(200));return Io(null,e,t,!0,n)};ye.hydrateRoot=function(e,t,n){if(!Zi(e))throw Error(g(405));var r=n!=null&&n.hydratedSources||null,o=!1,l="",i=Pc;if(n!=null&&(n.unstable_strictMode===!0&&(o=!0),n.identifierPrefix!==void 0&&(l=n.identifierPrefix),n.onRecoverableError!==void 0&&(i=n.onRecoverableError)),t=Rc(t,null,e,1,n!=null?n:null,o,!1,l,i),e[Ye]=t.current,Qn(e),r)for(e=0;e<r.length;e++)n=r[e],o=n._getVersion,o=o(n._source),t.mutableSourceEagerHydrationData==null?t.mutableSourceEagerHydrationData=[n,o]:t.mutableSourceEagerHydrationData.push(n,o);return new Ro(t)};ye.render=function(e,t,n){if(!Po(t))throw Error(g(200));return Io(null,e,t,!1,n)};ye.unmountComponentAtNode=function(e){if(!Po(e))throw Error(g(40));return e._reactRootContainer?(Ot(function(){Io(null,null,e,!1,function(){e._reactRootContainer=null,e[Ye]=null})}),!0):!1};ye.unstable_batchedUpdates=Gi;ye.unstable_renderSubtreeIntoContainer=function(e,t,n,r){if(!Po(n))throw Error(g(200));if(e==null||e._reactInternals===void 0)throw Error(g(38));return Io(e,t,n,!1,r)};ye.version="18.3.1-next-f1338f8080-20240426"});var Lc=We((Df,Ac)=>{"use strict";function Oc(){if(!(typeof __REACT_DEVTOOLS_GLOBAL_HOOK__=="undefined"||typeof __REACT_DEVTOOLS_GLOBAL_HOOK__.checkDCE!="function"))try{__REACT_DEVTOOLS_GLOBAL_HOOK__.checkDCE(Oc)}catch(e){console.error(e)}}Oc(),Ac.exports=Ic()});var Dc=We(Ji=>{"use strict";var zc=Lc();Ji.createRoot=zc.createRoot,Ji.hydrateRoot=zc.hydrateRoot;var Mf});var jc=We(Oo=>{"use strict";var mf=cr(),vf=Symbol.for("react.element"),hf=Symbol.for("react.fragment"),gf=Object.prototype.hasOwnProperty,yf=mf.__SECRET_INTERNALS_DO_NOT_USE_OR_YOU_WILL_BE_FIRED.ReactCurrentOwner,Sf={key:!0,ref:!0,__self:!0,__source:!0};function Mc(e,t,n){var r,o={},l=null,i=null;n!==void 0&&(l=""+n),t.key!==void 0&&(l=""+t.key),t.ref!==void 0&&(i=t.ref);for(r in t)gf.call(t,r)&&!Sf.hasOwnProperty(r)&&(o[r]=t[r]);if(e&&e.defaultProps)for(r in t=e.defaultProps,t)o[r]===void 0&&(o[r]=t[r]);return{$$typeof:vf,type:e,key:l,ref:i,props:o,_owner:yf.current}}Oo.Fragment=hf;Oo.jsx=Mc;Oo.jsxs=Mc});var lr=We((Ff,Uc)=>{"use strict";Uc.exports=jc()});var Hc=Dt(Dc(),1);var Lo=Dt(cr(),1),f=Dt(lr(),1),S={bg:"#07090f",panel:"#0d1117",border:"#1c2333",borderHi:"#2a3a55",cyan:"#38bdf8",cyanDim:"#0e3a52",green:"#4ade80",greenDim:"#0e2e1a",amber:"#fbbf24",amberDim:"#2e1f05",purple:"#a78bfa",purpleDim:"#1e1535",red:"#f87171",redDim:"#2e1010",text:"#e2e8f0",muted:"#64748b",faint:"#1e2535"},zt='"JetBrains Mono", "Fira Code", "Cascadia Code", monospace',Fc='"DM Sans", "Plus Jakarta Sans", system-ui, sans-serif',R={root:{background:S.bg,minHeight:"100vh",fontFamily:Fc,color:S.text,fontSize:14},header:{background:"linear-gradient(135deg, #0a1628 0%, #07090f 60%)",borderBottom:`1px solid ${S.border}`,padding:"28px 40px 24px",position:"sticky",top:0,zIndex:50,backdropFilter:"blur(12px)"},badge:e=>({display:"inline-block",padding:"2px 10px",borderRadius:4,fontSize:11,fontWeight:700,letterSpacing:"0.08em",textTransform:"uppercase",background:e+"22",color:e,border:`1px solid ${e}44`}),tab:e=>({padding:"9px 18px",borderRadius:6,cursor:"pointer",fontFamily:Fc,fontSize:13,fontWeight:e?600:400,color:e?S.cyan:S.muted,background:e?S.cyanDim:"transparent",border:`1px solid ${e?S.cyan+"55":"transparent"}`,transition:"all 0.15s",whiteSpace:"nowrap"}),card:{background:S.panel,border:`1px solid ${S.border}`,borderRadius:10,padding:24,marginBottom:20},codeBlock:{background:"#050709",border:`1px solid ${S.border}`,borderRadius:8,padding:"16px 20px",fontFamily:zt,fontSize:12.5,lineHeight:1.7,overflowX:"auto",whiteSpace:"pre",color:"#c9d1d9"},sectionTitle:{fontSize:18,fontWeight:700,color:S.text,marginBottom:6,letterSpacing:"-0.02em"},label:{fontSize:11,fontWeight:700,letterSpacing:"0.1em",textTransform:"uppercase",color:S.muted,marginBottom:8},pill:e=>({display:"inline-flex",alignItems:"center",gap:5,padding:"4px 12px",borderRadius:20,fontSize:12,fontWeight:600,background:e+"18",color:e,border:`1px solid ${e}33`,margin:"3px 4px 3px 0"}),stepCircle:e=>({width:32,height:32,borderRadius:"50%",background:e+"22",border:`2px solid ${e}`,display:"flex",alignItems:"center",justifyContent:"center",color:e,fontWeight:800,fontSize:13,flexShrink:0})},wf=[{re:/^(\/\/.*)$/,color:"#6a737d"},{re:/^(apoc\.[a-zA-Z][a-zA-Z0-9.]*)/,color:"#79c0ff"},{re:/^(db\.[a-zA-Z][a-zA-Z0-9.]*)/,color:"#79c0ff"},{re:/^(CALL|YIELD|RETURN|WITH|WHERE|MATCH|CREATE|MERGE|SET|DETACH DELETE|UNWIND|FOREACH|OPTIONAL MATCH|ORDER BY|LIMIT|SKIP|DISTINCT|AS|IN|IS|NOT|AND|OR|CASE|WHEN|THEN|ELSE|END|ON CREATE SET|ON MATCH SET)(?=[^a-zA-Z_]|$)/,color:"#ff7b72"},{re:/^(true|false|null)(?=[^a-zA-Z_]|$)/,color:"#ffa657"},{re:/^('[^']*')/,color:"#a5d6ff"},{re:/^("(?:[^"\\]|\\.)*")/,color:"#a5d6ff"},{re:/^(`[^`]*`)/,color:"#a5d6ff"},{re:/^(\d+\.?\d*)/,color:"#f2cc60"},{re:/^([{}[\]])/,color:"#e3b341"}],Ef=[{re:/^(#.*)/,color:"#6a737d"},{re:/^(f"""[\s\S]*?"""|f'''[\s\S]*?'''|"""[\s\S]*?"""|'''[\s\S]*?''')/,color:"#a5d6ff"},{re:/^(f"(?:[^"\\]|\\.)*"|f'(?:[^'\\]|\\.)*')/,color:"#a5d6ff"},{re:/^("(?:[^"\\]|\\.)*"|'(?:[^'\\]|\\.)*')/,color:"#a5d6ff"},{re:/^(import|from|def|class|return|for|in|if|else|elif|with|as|try|except|async|await|not|and|or|True|False|None|lambda|yield|pass|break|continue|raise|global|nonlocal)(?=[^a-zA-Z0-9_]|$)/,color:"#ff7b72"},{re:/^([a-z_][a-zA-Z_0-9]*)(?=\s*\()/,color:"#d2a8ff"},{re:/^([A-Z][a-zA-Z_0-9]*)(?=[^a-zA-Z0-9_(]|$)/,color:"#ffa657"},{re:/^(\d+\.?\d*)/,color:"#f2cc60"}];function kf(e,t){let n=t==="python"?Ef:wf,r=[],o=e;for(;o.length>0;){let l=!1;for(let{re:i,color:u}of n){let s=o.match(i);if(s){r.push({v:s[1]!==void 0?s[1]:s[0],c:u}),o=o.slice(s[0].length),l=!0;break}}l||(r.length>0&&r[r.length-1].c==="#c9d1d9"?r[r.length-1].v+=o[0]:r.push({v:o[0],c:"#c9d1d9"}),o=o.slice(1))}return r}function ir({code:e,lang:t="cypher"}){let n=e.split(`
`);return(0,f.jsx)("div",{style:R.codeBlock,children:n.map((r,o)=>{let l=kf(r,t);return(0,f.jsx)("div",{style:{minHeight:"1.5em"},children:l.length===0?(0,f.jsx)("span",{children:"\xA0"}):l.map((i,u)=>(0,f.jsx)("span",{style:{color:i.c},children:i.v},u))},o)})})}var Ao={title:"E-Commerce Intelligence Graph",subtitle:"Supply Chain \xB7 Customer 360 \xB7 Semantic Search",description:"A unified knowledge graph connecting customers, products, orders, suppliers and reviews \u2014 enriched with vector embeddings to power GraphRAG-style semantic retrieval and recommendation.",nodes:[{label:"Customer",color:S.cyan,props:["id","name","email","segment","region"],count:"~500K"},{label:"Product",color:S.green,props:["sku","name","description","price","embedding"],count:"~80K"},{label:"Category",color:S.amber,props:["id","name","level","path"],count:"~1.2K"},{label:"Order",color:S.purple,props:["orderId","date","status","total"],count:"~3M"},{label:"Review",color:S.red,props:["reviewId","rating","text","embedding"],count:"~2M"},{label:"Supplier",color:"#34d399",props:["id","name","country","tier"],count:"~5K"},{label:"Warehouse",color:"#fb923c",props:["id","location","capacity"],count:"~200"}],edges:[{from:"Customer",to:"Order",type:"PLACED",props:["at"]},{from:"Order",to:"Product",type:"CONTAINS",props:["qty","unitPrice"]},{from:"Customer",to:"Review",type:"WROTE",props:["at"]},{from:"Review",to:"Product",type:"ABOUT",props:[]},{from:"Product",to:"Category",type:"BELONGS_TO",props:["primary"]},{from:"Supplier",to:"Product",type:"SUPPLIES",props:["leadDays","cost"]},{from:"Supplier",to:"Warehouse",type:"SHIPS_TO",props:["frequency"]},{from:"Product",to:"Product",type:"SIMILAR_TO",props:["score"]},{from:"Customer",to:"Customer",type:"REFERRED",props:["code"]}]},Cf=[{id:1,title:"Schema Bootstrap & Config",color:S.cyan,apoc:["apoc.schema.assert","apoc.config.list"],desc:"Create indexes, constraints, and verify APOC config before loading.",code:`// \u2500\u2500 Step 1: Schema Bootstrap \u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500
// Create uniqueness constraints & full-text indexes

CALL apoc.schema.assert(
  {
    Product:  ['sku'],
    Customer: ['id'],
    Order:    ['orderId'],
    Supplier: ['id'],
    Review:   ['reviewId']
  },
  {
    Product:  [['sku']],
    Customer: [['id']],
    Order:    [['orderId']]
  }
) YIELD label, key, action
RETURN label, key, action;

// Full-text index for semantic pre-filtering
CREATE FULLTEXT INDEX product_search IF NOT EXISTS
FOR (p:Product) ON EACH [p.name, p.description];

CREATE FULLTEXT INDEX review_search IF NOT EXISTS
FOR (r:Review) ON EACH [r.text];

// Verify APOC availability
CALL apoc.config.list()
YIELD key, value
WHERE key STARTS WITH 'apoc.import'
RETURN key, value;`,lang:"cypher"},{id:2,title:"Load Products from JSON",color:S.green,apoc:["apoc.load.json","apoc.periodic.iterate","apoc.merge.node"],desc:"Stream product JSON, batch-merge nodes with dynamic properties.",code:`// \u2500\u2500 Step 2: Load Products \u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500
// Source: REST API / S3 JSON export

CALL apoc.periodic.iterate(
  // \u2460 Data source query \u2014 paginated JSON endpoint
  "CALL apoc.load.json(
     'https://data.mystore.com/api/products?page={page}&size=500'
   ) YIELD value AS row",

  // \u2461 Inner write query \u2014 merge + set props atomically
  "MERGE (p:Product {sku: row.sku})
   ON CREATE SET
     p.name        = row.name,
     p.description = row.description,
     p.price       = toFloat(row.price),
     p.brand       = row.brand,
     p.createdAt   = apoc.date.parse(row.created_at, 'ms', 'yyyy-MM-dd'),
     p.active      = row.active
   ON MATCH SET
     p.price       = toFloat(row.price),
     p.active      = row.active
   WITH p, row
   // \u2462 Attach Category node inline
   MERGE (c:Category {id: row.category_id})
     ON CREATE SET c.name = row.category_name
   MERGE (p)-[:BELONGS_TO {primary: true}]->(c)",

  // \u2463 Batch config
  {batchSize: 500, parallel: false, retries: 3,
   params: {page: 0}, iterateList: false}
) YIELD batches, total, errorMessages
RETURN batches, total, errorMessages;`,lang:"cypher"},{id:3,title:"Load Customers from CSV",color:S.amber,apoc:["apoc.load.csv","apoc.periodic.iterate","apoc.merge.node"],desc:"Ingest CSV customer exports using streaming, skipping headers automatically.",code:`// \u2500\u2500 Step 3: Load Customers (CSV) \u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500
// Assumes CSV columns: id, name, email, segment, region, referrer_id

CALL apoc.periodic.iterate(
  "CALL apoc.load.csv(
     'file:///import/customers_2025.csv',
     {header: true, sep: ',', quoteChar: '"',
      nullValues: ['', 'NULL', 'null']}
   ) YIELD map AS row",

  "MERGE (c:Customer {id: row.id})
   ON CREATE SET
     c.name      = row.name,
     c.email     = toLower(row.email),
     c.segment   = row.segment,
     c.region    = row.region,
     c.createdAt = apoc.date.parse(row.signup_date,'ms','yyyy-MM-dd')
   ON MATCH SET
     c.segment = row.segment,
     c.region  = row.region
   // Referral relationship (self-edge)
   WITH c, row
   WHERE row.referrer_id IS NOT NULL
   MERGE (ref:Customer {id: row.referrer_id})
   MERGE (ref)-[:REFERRED {code: row.referral_code}]->(c)",

  {batchSize: 1000, parallel: false, retries: 2}
) YIELD batches, total, timeTaken, errorMessages
RETURN batches, total,
       apoc.number.format(timeTaken / 1000.0, '#.##') + 's' AS duration,
       errorMessages;`,lang:"cypher"},{id:4,title:"Load Orders & Line Items",color:S.purple,apoc:["apoc.load.json","apoc.periodic.iterate","apoc.create.relationship"],desc:"Reconstruct order graph: Customer \u2192 Order \u2192 Products with quantities.",code:`// \u2500\u2500 Step 4: Orders + Line Items \u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500

CALL apoc.periodic.iterate(
  // Orders JSON (nested line items)
  "CALL apoc.load.json('file:///import/orders_batch.jsonl')
   YIELD value AS order",

  "// Create Order node
   MERGE (o:Order {orderId: order.id})
   ON CREATE SET
     o.date   = apoc.date.parse(order.placed_at,'ms',"yyyy-MM-dd'T'HH:mm:ss"),
     o.status = order.status,
     o.total  = toFloat(order.total_amount),
     o.currency = order.currency

   // Link Customer \u2192 Order
   WITH o, order
   MATCH (c:Customer {id: order.customer_id})
   MERGE (c)-[:PLACED {at: o.date}]->(o)

   // Expand line items
   WITH o, order
   UNWIND order.items AS item
   MATCH (p:Product {sku: item.sku})
   MERGE (o)-[r:CONTAINS]->(p)
   ON CREATE SET
     r.qty       = toInteger(item.quantity),
     r.unitPrice = toFloat(item.unit_price),
     r.discount  = toFloat(coalesce(item.discount, 0))",

  {batchSize: 200, parallel: false, retries: 3}
) YIELD batches, total, errorMessages
RETURN batches, total, errorMessages;`,lang:"cypher"},{id:5,title:"Load Suppliers & Inventory",color:"#34d399",apoc:["apoc.load.json","apoc.periodic.iterate","apoc.merge.relationship"],desc:"Connect Suppliers \u2192 Products \u2192 Warehouses with lead-time attributes.",code:`// \u2500\u2500 Step 5: Suppliers & Warehouse Inventory \u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500

// 5a. Create Supplier nodes
CALL apoc.load.json('file:///import/suppliers.json')
YIELD value AS s
MERGE (sup:Supplier {id: s.supplier_id})
ON CREATE SET
  sup.name    = s.name,
  sup.country = s.country,
  sup.tier    = s.tier,
  sup.contact = s.contact_email;

// 5b. Supplier \u2192 Product supply edges (batch)
CALL apoc.periodic.iterate(
  "CALL apoc.load.json('file:///import/supply_catalog.json')
   YIELD value AS row",

  "MATCH (sup:Supplier {id: row.supplier_id})
   MATCH (p:Product   {sku: row.product_sku})
   MERGE (sup)-[r:SUPPLIES]->(p)
   ON CREATE SET
     r.leadDays  = toInteger(row.lead_days),
     r.unitCost  = toFloat(row.unit_cost),
     r.moq       = toInteger(row.min_order_qty)
   // Warehouse shipping routes
   WITH sup, row
   UNWIND row.warehouses AS wh
   MERGE (w:Warehouse {id: wh.id})
     ON CREATE SET w.location = wh.location, w.capacity = wh.capacity
   MERGE (sup)-[:SHIPS_TO {frequency: wh.frequency}]->(w)",

  {batchSize: 300, parallel: false}
) YIELD batches, total
RETURN batches, total;`,lang:"cypher"},{id:6,title:"Load Reviews & Sentiment",color:S.red,apoc:["apoc.load.csv","apoc.periodic.iterate","apoc.create.node"],desc:"Ingest review text, rating, and pre-computed sentiment score.",code:`// \u2500\u2500 Step 6: Reviews \u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500

CALL apoc.periodic.iterate(
  "CALL apoc.load.csv('file:///import/reviews.csv',
     {header: true, sep: ',', nullValues: ['']})
   YIELD map AS row
   WHERE row.review_id IS NOT NULL",

  "MERGE (r:Review {reviewId: row.review_id})
   ON CREATE SET
     r.rating    = toInteger(row.rating),
     r.text      = row.review_text,
     r.sentiment = toFloat(row.sentiment_score),   // pre-computed externally
     r.helpful   = toInteger(coalesce(row.helpful_votes, '0')),
     r.createdAt = apoc.date.parse(row.created_at,'ms','yyyy-MM-dd')

   // Review \u2192 Product
   WITH r, row
   MATCH (p:Product  {sku:  row.product_sku})
   MERGE (r)-[:ABOUT]->(p)

   // Customer \u2192 Review
   WITH r, row
   MATCH (c:Customer {id: row.customer_id})
   MERGE (c)-[:WROTE {at: r.createdAt}]->(r)",

  {batchSize: 500, parallel: false, retries: 2}
) YIELD batches, total, errorMessages
RETURN batches, total, errorMessages;`,lang:"cypher"},{id:7,title:"Post-Load Validation & Stats",color:S.cyan,apoc:["apoc.meta.stats","apoc.meta.schema","apoc.util.validate"],desc:"Introspect the loaded graph and assert data quality invariants.",code:`// \u2500\u2500 Step 7: Validation \u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500

// 7a. Node & relationship counts per label
CALL apoc.meta.stats()
YIELD labels, relTypesCount, nodeCount, relCount
RETURN labels, relTypesCount, nodeCount, relCount;

// 7b. Full schema snapshot (labels, prop types, rel types)
CALL apoc.meta.schema()
YIELD value
RETURN value;

// 7c. Orphan check \u2014 Orders without a Customer
MATCH (o:Order)
WHERE NOT ()-[:PLACED]->(o)
CALL apoc.util.validate(
  count(o) > 0,
  'Found %d orphaned Orders \u2014 check customer load!',
  [count(o)]
)
RETURN count(o) AS orphanedOrders;

// 7d. Data freshness check
MATCH (o:Order)
WITH max(o.date) AS latestOrder
CALL apoc.util.validate(
  latestOrder < apoc.date.add(apoc.date.currentTimestamp(), 'ms', -2, 'd'),
  'Order data may be stale \u2014 latest: %s',
  [apoc.date.format(latestOrder,'ms','yyyy-MM-dd HH:mm')]
)
RETURN apoc.date.format(latestOrder,'ms','yyyy-MM-dd HH:mm') AS latestOrderDate;`,lang:"cypher"},{id:8,title:"Export Graph for Embedding",color:S.amber,apoc:["apoc.export.json.query","apoc.path.subgraphAll"],desc:"Export Product & Review nodes enriched with graph context for vectorisation.",code:`// \u2500\u2500 Step 8: Export Nodes for Embedding \u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500
// Builds a rich text context per Product by pulling in adjacent graph data

CALL apoc.export.json.query(
  "MATCH (p:Product)
   // Aggregate categories, top review snippets, supplier names
   OPTIONAL MATCH (p)-[:BELONGS_TO]->(c:Category)
   OPTIONAL MATCH (r:Review)-[:ABOUT]->(p)
   OPTIONAL MATCH (sup:Supplier)-[:SUPPLIES]->(p)
   WITH p,
        collect(DISTINCT c.name)   AS categories,
        collect(DISTINCT sup.name) AS suppliers,
        [rv IN collect(r) WHERE rv.rating >= 4 | rv.text][..3] AS topReviews,
        avg(r.rating) AS avgRating
   RETURN p.sku           AS id,
          p.name          AS name,
          p.description   AS description,
          p.price         AS price,
          avgRating,
          categories,
          suppliers,
          topReviews,
          // Combined text blob for embedding
          p.name + '. ' +
          coalesce(p.description,'') + ' ' +
          apoc.text.join(categories, ', ') + '. ' +
          apoc.text.join(topReviews, ' ')  AS embedText",

  'file:///export/products_for_embedding.json',
  {stream: false, batchSize: 1000}
) YIELD file, source, format, nodes, rels, properties, time
RETURN file, nodes, properties, time;`,lang:"cypher"}],bi={embed:`# embed_products.py
# PURPOSE: Read graph-enriched JSONL exported by APOC (Step 8), generate
#          OpenAI vector embeddings, persist them to Weaviate (HNSW search)
#          AND back to Neo4j Product nodes (native vector index queries).
# FLOW:  load_products -> embed_batch -> upsert_weaviate
#                                     -> write_embeddings_to_neo4j

import json, asyncio, httpx
from openai import AsyncOpenAI   # async client for concurrent embedding calls
import weaviate                   # Weaviate v4 Python client
from neo4j import AsyncGraphDatabase  # async Neo4j driver for non-blocking writes

# ---- Configuration constants --------------------------------------------
# text-embedding-3-large: OpenAI's highest-quality model (1536 dims).
# Produces better semantic clusters than ada-002 for product descriptions.
EMBEDDING_MODEL = "text-embedding-3-large"

# Neo4j Bolt URI -- update to your AuraDB connection string for cloud.
NEO4J_URI       = "bolt://localhost:7687"
NEO4J_USER, NEO4J_PASS = "neo4j", "password"

# Weaviate defaults to port 8080; run with Docker: -p 8080:8080.
WEAVIATE_URL    = "http://localhost:8080"

# 100 texts per OpenAI API call is a safe default.
# Increase to 300 if your rate limits allow higher throughput.
BATCH_SIZE      = 100

# ---- Initialise clients once at module level (reused across all batches) -
openai_client   = AsyncOpenAI()           # reads OPENAI_API_KEY from env var
weaviate_client = weaviate.connect_to_local()  # connects to localhost:8080

# ---- 1. Read JSONL export produced by APOC Step 8 ----------------------
# apoc.export.json.query writes one JSON object per line (JSONL format).
# We skip blank lines defensively to avoid json.loads errors.
def load_products(path: str) -> list[dict]:
    with open(path) as f:
        return [json.loads(line) for line in f if line.strip()]

# ---- 2. Generate embeddings for a batch of texts -----------------------
# Sends all texts in ONE API request -- far more efficient than one call
# per product. The API returns embeddings in the same order as the input,
# so zip(products, embeddings) is safe and correct.
async def embed_batch(texts: list[str]) -> list[list[float]]:
    response = await openai_client.embeddings.create(
        model=EMBEDDING_MODEL,
        input=texts,      # list[str] -- one entry per product
        dimensions=1536,  # must match Weaviate and Neo4j vector index dims
    )
    # response.data is a list of Embedding objects; extract raw float lists
    return [item.embedding for item in response.data]

# ---- 3. Upsert product vectors into Weaviate ----------------------------
# weaviate.util.generate_uuid5(sku) creates a deterministic UUID from the
# product SKU. This makes re-runs idempotent: the same SKU overwrites its
# Weaviate object rather than creating a duplicate entry.
def upsert_weaviate(collection, products: list[dict], embeddings: list):
    # collection.batch.dynamic() auto-flushes when its internal buffer fills,
    # batching HTTP requests to Weaviate efficiently without manual tuning.
    with collection.batch.dynamic() as batch:
        for product, vector in zip(products, embeddings):
            batch.add_object(
                properties={
                    "sku":         product["id"],
                    "name":        product["name"],
                    "description": product.get("description", ""),
                    "categories":  product.get("categories", []),
                    "suppliers":   product.get("suppliers", []),
                    "price":       float(product.get("price", 0)),
                    "avgRating":   float(product.get("avgRating") or 0),
                    # embedText stores the full input string for traceability
                    # and allows re-embedding checks without re-querying Neo4j
                    "embedText":   product["embedText"],
                },
                vector=vector,  # the 1536-dim float list from OpenAI
                uuid=weaviate.util.generate_uuid5(product["id"]),  # deterministic
            )

# ---- 4. Write embedding vectors back onto Neo4j Product nodes ----------
# Storing the vector in Neo4j enables native Cypher vector index queries
# (db.index.vector.queryNodes) without going through Weaviate -- useful
# for hybrid Cypher + vector queries in a single database hop.
# UNWIND batches all rows into one transaction instead of N round-trips.
async def write_embeddings_to_neo4j(session, products, embeddings):
    await session.run(
        """
        UNWIND $rows AS row
        MATCH (p:Product {sku: row.sku})
        SET p.embedding      = row.vector,
            p.embeddedAt     = timestamp(),
            p.embeddingModel = $model
        """,
        rows=[{"sku": p["id"], "vector": v}
              for p, v in zip(products, embeddings)],
        model=EMBEDDING_MODEL,
    )

# ---- 5. Main pipeline orchestrator -------------------------------------
# Iterates over products in BATCH_SIZE chunks: embed -> write Weaviate
# -> write Neo4j. Progress is printed after each batch. Both the Weaviate
# client and Neo4j driver are closed on exit to avoid connection leaks.
async def run():
    products   = load_products("export/products_for_embedding.json")
    collection = weaviate_client.collections.get("Product")
    neo4j_driver = AsyncGraphDatabase.driver(NEO4J_URI,
                       auth=(NEO4J_USER, NEO4J_PASS))

    async with neo4j_driver.session() as session:
        for i in range(0, len(products), BATCH_SIZE):
            batch      = products[i : i + BATCH_SIZE]
            texts      = [p["embedText"] for p in batch]  # extract text blobs
            embeddings = await embed_batch(texts)          # call OpenAI API

            upsert_weaviate(collection, batch, embeddings)          # -> Weaviate
            await write_embeddings_to_neo4j(session, batch, embeddings)  # -> Neo4j
            print(f"  Processed {min(i+BATCH_SIZE, len(products))}/{len(products)}")

    weaviate_client.close()   # release Weaviate HTTP connection pool
    await neo4j_driver.close()  # release Neo4j Bolt connection pool
    print("Embedding pipeline complete.")

if __name__ == "__main__":
    asyncio.run(run())`,schema:`# weaviate_schema.py
# PURPOSE: Create Weaviate collections for Product and Review nodes.
#          Run ONCE before the embedding pipeline (embed_products.py).
#          Re-running on an existing schema raises CollectionExists --
#          wrap in try/except for idempotent deployments.
#
# DESIGN DECISIONS:
#   vectorizer_config = none()  -->  we supply external OpenAI vectors;
#   Weaviate does NOT call any embedding service itself. This gives us full
#   control over the embedding model and avoids double-billing.
#
#   HNSW index: ef_construction=256, max_connections=32 is tuned for
#   >0.99 recall at moderate query speed. Lower ef_construction to speed
#   up index builds on large datasets at the cost of slight recall loss.
#
#   distance_metric = COSINE  -->  standard for OpenAI embedding vectors.
#   OpenAI normalises embeddings to unit length, so cosine = dot product.

import weaviate
import weaviate.classes as wvc  # shorthand for weaviate config classes

# Connect to local Weaviate instance (Docker: -p 8080:8080)
client = weaviate.connect_to_local()

# ---- Product Collection -------------------------------------------------
# Each Weaviate object = one Product node in Neo4j.
# The stored vector is the 1536-dim OpenAI embedding of embedText
# (name + description + categories + top reviews -- graph-enriched context).
client.collections.create(
    name="Product",

    # none() = we supply pre-computed vectors; Weaviate does NOT embed.
    # This decouples Weaviate from any specific embedding provider.
    vectorizer_config=wvc.config.Configure.Vectorizer.none(),

    # Properties mirror Neo4j node properties + what we filter in queries.
    # TEXT_ARRAY properties allow 'where categories contains X' filtering.
    properties=[
        wvc.config.Property(name="sku",         data_type=wvc.config.DataType.TEXT),
        wvc.config.Property(name="name",        data_type=wvc.config.DataType.TEXT),
        wvc.config.Property(name="description", data_type=wvc.config.DataType.TEXT),
        wvc.config.Property(name="categories",  data_type=wvc.config.DataType.TEXT_ARRAY),
        wvc.config.Property(name="suppliers",   data_type=wvc.config.DataType.TEXT_ARRAY),
        wvc.config.Property(name="price",       data_type=wvc.config.DataType.NUMBER),
        wvc.config.Property(name="avgRating",   data_type=wvc.config.DataType.NUMBER),
        wvc.config.Property(name="embedText",   data_type=wvc.config.DataType.TEXT),
    ],

    # HNSW vector index configuration:
    #   ef_construction=256  -- build quality; 2x default; more accurate graph edges
    #   max_connections=32   -- degree per node; sweet-spot for 1536-dim vectors
    #   COSINE similarity    -- normalised dot product; best for OpenAI embeddings
    vector_index_config=wvc.config.Configure.VectorIndex.hnsw(
        distance_metric=wvc.config.VectorDistances.COSINE,
        ef_construction=256,
        max_connections=32,
    ),
)

# ---- Review Collection --------------------------------------------------
# Reviews are embedded separately so we can do per-review semantic search
# e.g. "find all reviews mentioning battery life" independent of product
# similarity. The productSku property links back to Neo4j for graph joins.
client.collections.create(
    name="Review",
    vectorizer_config=wvc.config.Configure.Vectorizer.none(),
    properties=[
        wvc.config.Property(name="reviewId",   data_type=wvc.config.DataType.TEXT),
        wvc.config.Property(name="productSku", data_type=wvc.config.DataType.TEXT),
        wvc.config.Property(name="rating",     data_type=wvc.config.DataType.INT),
        # Pre-computed sentiment: -1.0 (very negative) to +1.0 (very positive)
        wvc.config.Property(name="sentiment",  data_type=wvc.config.DataType.NUMBER),
        wvc.config.Property(name="text",       data_type=wvc.config.DataType.TEXT),
    ],
)

print("Weaviate schema created: Product + Review collections ready.")
client.close()  # release the underlying HTTP connection pool`,rag:`# graphrag_retriever.py
# PURPOSE: Implements the full GraphRAG (Graph Retrieval-Augmented Generation)
#          query pipeline. Combines Weaviate vector search with Neo4j graph
#          traversal to produce richer context than plain RAG can provide.
#
# PIPELINE (5 steps):
#   1. embed_query()    -- embed the user question (same model as products)
#   2. vector_search()  -- Weaviate HNSW: find top-K semantically similar SKUs
#   3. graph_enrich()   -- Neo4j: traverse 1-2 hops to get categories,
#                          suppliers, reviews, co-purchased products
#   4. build_prompt()   -- assemble a structured LLM prompt with all context
#   5. graphrag_query() -- call GPT-4o and return the grounded answer
#
# WHY GraphRAG > Plain RAG:
#   Plain RAG stops at step 2 and feeds only matching text snippets to the LLM.
#   GraphRAG step 3 adds graph context (suppliers, co-purchases, category
#   hierarchy, review sentiment) that is NOT in the product text but is
#   essential for accurate, trustworthy answers.

import json
from openai import OpenAI    # synchronous client for request-response flow
import weaviate
from neo4j import GraphDatabase

openai  = OpenAI()                  # reads OPENAI_API_KEY from environment
wv      = weaviate.connect_to_local()  # Weaviate at localhost:8080
driver  = GraphDatabase.driver("bolt://localhost:7687",
                               auth=("neo4j", "password"))

# Must match the model used in embed_products.py!
# Vectors from different models are NOT comparable -- changing the model
# requires re-embedding ALL products before queries will work correctly.
EMBEDDING_MODEL = "text-embedding-3-large"
CHAT_MODEL      = "gpt-4o"   # GPT-4o: best instruction-following + reasoning

# ---- 1. Embed the user question -----------------------------------------
# We use the SAME model as the product embeddings so the vector spaces are
# aligned. Cosine similarity between the question vector and product vectors
# is then a meaningful semantic measure.
def embed_query(text: str) -> list[float]:
    r = openai.embeddings.create(model=EMBEDDING_MODEL, input=text)
    return r.data[0].embedding  # 1536-dim float list

# ---- 2. Weaviate vector search --> top-K candidate product SKUs ---------
# near_vector() runs approximate nearest-neighbour search on the HNSW index.
# We only retrieve SKUs here -- the full enrichment happens in Neo4j (step 3)
# because the graph contains context that Weaviate's schema does not store.
# top_k=8 is a balance: enough candidates for diverse results, few enough
# that Neo4j graph traversal stays fast.
def vector_search(query_vec: list[float], top_k: int = 8) -> list[str]:
    collection = wv.collections.get("Product")
    results = collection.query.near_vector(
        near_vector=query_vec,
        limit=top_k,
        return_properties=["sku", "name", "avgRating"],
        return_metadata=weaviate.classes.query.MetadataQuery(distance=True),
    )
    return [obj.properties["sku"] for obj in results.objects]

# ---- 3. Neo4j graph traversal -- enrich candidates with graph context ---
# This is what distinguishes GraphRAG from plain RAG. For each candidate SKU
# we traverse up to 2 hops in the knowledge graph to collect:
#   - Categories      (topical context: "Electronics > Audio > Headphones")
#   - Suppliers       (sourcing context: "Available from TechDistrib, GlobalParts")
#   - Top reviews     (4-5 star verbatim reviews: real customer voice)
#   - Co-purchased    (collaborative filter: "people also bought X with this")
# All of this is invisible to vector similarity but essential for good answers.
GRAPH_ENRICHMENT = """
MATCH (p:Product)
WHERE p.sku IN $skus

OPTIONAL MATCH (p)-[:BELONGS_TO]->(c:Category)
OPTIONAL MATCH (sup:Supplier)-[:SUPPLIES]->(p)

OPTIONAL MATCH (r:Review)-[:ABOUT]->(p)
  WHERE r.rating >= 4

OPTIONAL MATCH (o:Order)-[:CONTAINS]->(p)
OPTIONAL MATCH (o)-[:CONTAINS]->(co:Product)
  WHERE co.sku <> p.sku

WITH p,
     collect(DISTINCT c.name)   AS categories,
     collect(DISTINCT sup.name) AS suppliers,
     [rv IN collect(DISTINCT r) | rv.text][..2] AS topReviews,
     avg(r.rating) AS avgRating,
     collect(DISTINCT co.name)[..4] AS coPurchased

RETURN p.sku        AS sku,
       p.name       AS name,
       p.price      AS price,
       categories,
       suppliers,
       topReviews,
       round(avgRating, 1)  AS avgRating,
       coPurchased
"""

def graph_enrich(skus: list[str]) -> list[dict]:
    # Run the enrichment query with the SKU list as a Cypher parameter.
    # Using $skus prevents injection and allows Neo4j to plan the query once
    # and execute it for all SKUs in a single database round-trip.
    with driver.session() as session:
        result = session.run(GRAPH_ENRICHMENT, skus=skus)
        return [dict(r) for r in result]

# ---- 4. Build the LLM prompt with structured graph context --------------
# Each product is formatted as an indented block with all graph context.
# The system instruction restricts the LLM to the retrieved context ONLY --
# this is the key "grounding" mechanism that prevents hallucination.
# temperature=0.2 (set in step 5) further reduces creative invention.
def build_prompt(question: str, graph_context: list[dict]) -> str:
    ctx_blocks = []
    for p in graph_context:
        block = (
            f"Product: {p['name']} (SKU: {p['sku']}, \${p['price']:.2f})
"
            f"  Categories : {chr(44).join(p['categories'])}
"
            f"  Suppliers  : {chr(44).join(p['suppliers'])}
"
            f"  Avg Rating : {p['avgRating']}
"
            f"  Top Reviews: {chr(124).join(p['topReviews'])}
"
            f"  Often Bought With: {chr(44).join(p['coPurchased'])}
"
        )
        ctx_blocks.append(block)

    return ("You are a helpful e-commerce assistant with access to a product
"
            "knowledge graph. Use ONLY the context below to answer the question.
"
            "Cite product names and ratings when relevant.

"
            "=== GRAPH CONTEXT ===
"
            + "".join(ctx_blocks)
            + "=== USER QUESTION ===
"
            + question)

# ---- 5. End-to-end GraphRAG entry point --------------------------------
# Single function that orchestrates all four steps.
# temperature=0.2 keeps answers factual and reproducible across runs.
def graphrag_query(question: str) -> str:
    query_vec      = embed_query(question)           # step 1: embed
    candidate_skus = vector_search(query_vec, top_k=8)  # step 2: vector search
    graph_context  = graph_enrich(candidate_skus)   # step 3: graph traversal
    prompt         = build_prompt(question, graph_context)  # step 4: prompt

    response = openai.chat.completions.create(
        model=CHAT_MODEL,
        messages=[{"role": "user", "content": prompt}],
        temperature=0.2,  # low = factual, high = creative; 0.2 reduces hallucination
    )
    return response.choices[0].message.content

# ---- Example ------------------------------------------------------------
if __name__ == "__main__":
    q = "What are the best-rated eco-friendly products under $50?"
    print("Question:", q)
    print()
    print(graphrag_query(q))`};function xf({node:e}){return(0,f.jsxs)("div",{style:{background:S.panel,border:`1px solid ${e.color}33`,borderTop:`3px solid ${e.color}`,borderRadius:8,padding:16,minWidth:170},children:[(0,f.jsxs)("div",{style:{display:"flex",justifyContent:"space-between",alignItems:"center",marginBottom:8},children:[(0,f.jsx)("span",{style:{fontWeight:700,color:e.color,fontSize:14},children:e.label}),(0,f.jsx)("span",{style:{...R.badge(e.color),fontSize:10},children:e.count})]}),(0,f.jsx)("div",{style:R.label,children:"Properties"}),e.props.map(t=>(0,f.jsxs)("div",{style:{fontFamily:zt,fontSize:11,color:S.muted,lineHeight:1.7},children:["\xB7 ",t]},t))]})}function _f({edge:e}){return(0,f.jsxs)("div",{style:{display:"flex",alignItems:"center",gap:10,padding:"10px 16px",borderBottom:`1px solid ${S.faint}`,flexWrap:"wrap"},children:[(0,f.jsx)("span",{style:R.pill(S.cyan),children:e.from}),(0,f.jsx)("span",{style:{color:S.muted,fontFamily:zt,fontSize:11},children:"\u2500\u2500"}),(0,f.jsx)("span",{style:R.pill(S.amber),children:e.type}),(0,f.jsx)("span",{style:{color:S.muted,fontFamily:zt,fontSize:11},children:"\u2500\u2500\u25B6"}),(0,f.jsx)("span",{style:R.pill(S.green),children:e.to}),e.props.length>0&&(0,f.jsxs)("span",{style:{color:S.muted,fontFamily:zt,fontSize:11,marginLeft:4},children:["[",e.props.join(", "),"]"]})]})}function Tf({step:e,isOpen:t,onToggle:n}){return(0,f.jsxs)("div",{style:{...R.card,padding:0,overflow:"hidden"},children:[(0,f.jsxs)("button",{onClick:n,style:{width:"100%",padding:"18px 24px",display:"flex",alignItems:"center",gap:16,background:"transparent",border:"none",cursor:"pointer",color:S.text,textAlign:"left"},children:[(0,f.jsx)("div",{style:R.stepCircle(e.color),children:e.id}),(0,f.jsxs)("div",{style:{flex:1},children:[(0,f.jsx)("div",{style:{fontWeight:700,fontSize:15},children:e.title}),(0,f.jsx)("div",{style:{color:S.muted,fontSize:12,marginTop:2},children:e.desc})]}),(0,f.jsx)("div",{style:{display:"flex",gap:6,flexWrap:"wrap",justifyContent:"flex-end"},children:e.apoc.map(r=>(0,f.jsx)("span",{style:{...R.badge(e.color),fontSize:10},children:r},r))}),(0,f.jsx)("div",{style:{color:S.muted,fontSize:18,marginLeft:8,flexShrink:0},children:t?"\u25B2":"\u25BC"})]}),t&&(0,f.jsx)("div",{style:{padding:"0 24px 24px"},children:(0,f.jsx)(ir,{code:e.code,lang:e.lang})})]})}function Nf(){let e=[{label:"Raw Data Sources",sub:"CSV \xB7 JSON \xB7 REST API \xB7 RDBMS",color:S.muted,x:0},{label:"APOC Data Pipeline",sub:`apoc.load \xB7 apoc.periodic.iterate
apoc.merge \xB7 apoc.schema.assert`,color:S.cyan,x:1},{label:"Neo4j Knowledge Graph",sub:`Nodes \xB7 Relationships
Indexes \xB7 Constraints`,color:S.green,x:2},{label:"Embedding Service",sub:`OpenAI text-embedding-3
or local model`,color:S.amber,x:3},{label:"Weaviate Vector DB",sub:`HNSW Index
Near-vector search`,color:S.purple,x:4},{label:"GraphRAG Retriever",sub:`Vector search \u2192 Graph traversal
\u2192 LLM generation`,color:S.red,x:5}];return(0,f.jsx)("div",{style:{overflowX:"auto",paddingBottom:8},children:(0,f.jsx)("div",{style:{display:"flex",alignItems:"stretch",gap:0,minWidth:900},children:e.map((t,n)=>(0,f.jsxs)("div",{style:{display:"flex",alignItems:"center",flex:1},children:[(0,f.jsxs)("div",{style:{flex:1,background:t.color+"14",border:`1px solid ${t.color}44`,borderRadius:8,padding:"16px 14px",textAlign:"center",minHeight:90,display:"flex",flexDirection:"column",alignItems:"center",justifyContent:"center"},children:[(0,f.jsx)("div",{style:{color:t.color,fontWeight:700,fontSize:13,marginBottom:4},children:t.label}),(0,f.jsx)("div",{style:{color:S.muted,fontSize:11,fontFamily:zt,whiteSpace:"pre-line",lineHeight:1.5},children:t.sub})]}),n<e.length-1&&(0,f.jsx)("div",{style:{color:S.muted,fontSize:18,padding:"0 4px",flexShrink:0},children:"\u2192"})]},t.label))})})}var Rf=["Overview","Graph Schema","APOC Pipeline","Vector Embedding","GraphRAG Query"];function eu(){let[e,t]=(0,Lo.useState)(0),[n,r]=(0,Lo.useState)({1:!0}),[o,l]=(0,Lo.useState)(0),i=u=>r(s=>({...s,[u]:!s[u]}));return(0,f.jsxs)("div",{style:R.root,children:[(0,f.jsxs)("div",{style:R.header,children:[(0,f.jsx)("div",{style:{display:"flex",alignItems:"flex-start",justifyContent:"space-between",flexWrap:"wrap",gap:16},children:(0,f.jsxs)("div",{children:[(0,f.jsxs)("div",{style:{display:"flex",alignItems:"center",gap:10,marginBottom:4},children:[(0,f.jsx)("span",{style:R.badge(S.cyan),children:"GraphRAG"}),(0,f.jsx)("span",{style:R.badge(S.green),children:"Neo4j + APOC"}),(0,f.jsx)("span",{style:R.badge(S.purple),children:"Weaviate"})]}),(0,f.jsx)("h1",{style:{fontSize:22,fontWeight:800,margin:0,letterSpacing:"-0.03em",color:S.text},children:"E-Commerce Intelligence Graph"}),(0,f.jsx)("p",{style:{color:S.muted,margin:"4px 0 0",fontSize:13},children:"APOC Data Pipeline \xB7 Knowledge Graph \xB7 Vector Search \xB7 GraphRAG"})]})}),(0,f.jsx)("div",{style:{display:"flex",gap:6,marginTop:20,flexWrap:"wrap"},children:Rf.map((u,s)=>(0,f.jsx)("button",{onClick:()=>t(s),style:R.tab(e===s),children:u},u))})]}),(0,f.jsxs)("div",{style:{padding:"28px 40px",maxWidth:1100,margin:"0 auto"},children:[e===0&&(0,f.jsxs)("div",{children:[(0,f.jsxs)("div",{style:R.card,children:[(0,f.jsx)("div",{style:R.label,children:"Business Use Case"}),(0,f.jsx)("div",{style:R.sectionTitle,children:Ao.title}),(0,f.jsx)("p",{style:{color:S.muted,margin:"8px 0 20px",lineHeight:1.7,fontSize:13},children:Ao.description}),(0,f.jsx)("div",{style:R.label,children:"Business Goals"}),[{icon:"\u{1F50D}",t:"Semantic Product Search",d:"Natural-language queries resolved via vector + graph context"},{icon:"\u{1F6D2}",t:"Co-Purchase Recommendations",d:"Graph-traversal over ORDER\u2192CONTAINS to surface affinity pairs"},{icon:"\u{1F69A}",t:"Supply Chain Risk Analysis",d:"Trace SUPPLIER\u2192PRODUCT paths; identify single-source dependencies"},{icon:"\u2B50",t:"Review Intelligence",d:"Aggregate review embeddings per product for sentiment-aware retrieval"},{icon:"\u{1F464}",t:"Customer 360",d:"Full view of each customer's orders, reviews, referrals and segment"}].map(u=>(0,f.jsxs)("div",{style:{display:"flex",gap:14,padding:"12px 0",borderBottom:`1px solid ${S.faint}`},children:[(0,f.jsx)("span",{style:{fontSize:20},children:u.icon}),(0,f.jsxs)("div",{children:[(0,f.jsx)("div",{style:{fontWeight:700,fontSize:13,marginBottom:2},children:u.t}),(0,f.jsx)("div",{style:{color:S.muted,fontSize:12},children:u.d})]})]},u.t))]}),(0,f.jsxs)("div",{style:R.card,children:[(0,f.jsx)("div",{style:R.label,children:"End-to-End Architecture"}),(0,f.jsx)(Nf,{})]}),(0,f.jsxs)("div",{style:R.card,children:[(0,f.jsx)("div",{style:R.label,children:"Tech Stack"}),(0,f.jsx)("div",{style:{display:"flex",flexWrap:"wrap",gap:8,marginTop:4},children:[["Neo4j 5.x",S.cyan],["APOC Core 2025",S.cyan],["Weaviate v4",S.purple],["OpenAI Embeddings",S.amber],["GPT-4o",S.amber],["Python 3.12",S.green],["neo4j-driver",S.green],["weaviate-client v4",S.purple],["openai-python",S.amber],["asyncio",S.muted]].map(([u,s])=>(0,f.jsx)("span",{style:R.pill(s),children:u},u))})]})]}),e===1&&(0,f.jsxs)("div",{children:[(0,f.jsxs)("div",{style:R.card,children:[(0,f.jsx)("div",{style:R.label,children:"Node Labels"}),(0,f.jsx)("div",{style:{display:"flex",flexWrap:"wrap",gap:12,marginTop:8},children:Ao.nodes.map(u=>(0,f.jsx)(xf,{node:u},u.label))})]}),(0,f.jsxs)("div",{style:R.card,children:[(0,f.jsx)("div",{style:R.label,children:"Relationship Types"}),(0,f.jsx)("div",{style:{marginTop:8,border:`1px solid ${S.border}`,borderRadius:8,overflow:"hidden"},children:Ao.edges.map(u=>(0,f.jsx)(_f,{edge:u},u.type+u.from))})]}),(0,f.jsxs)("div",{style:R.card,children:[(0,f.jsx)("div",{style:R.label,children:"Cypher Schema Definition"}),(0,f.jsx)(ir,{lang:"cypher",code:`// Constraints
CREATE CONSTRAINT product_sku   IF NOT EXISTS FOR (p:Product)  REQUIRE p.sku      IS UNIQUE;
CREATE CONSTRAINT customer_id   IF NOT EXISTS FOR (c:Customer) REQUIRE c.id       IS UNIQUE;
CREATE CONSTRAINT order_id      IF NOT EXISTS FOR (o:Order)    REQUIRE o.orderId  IS UNIQUE;
CREATE CONSTRAINT supplier_id   IF NOT EXISTS FOR (s:Supplier) REQUIRE s.id       IS UNIQUE;
CREATE CONSTRAINT review_id     IF NOT EXISTS FOR (r:Review)   REQUIRE r.reviewId IS UNIQUE;

// Indexes for frequent lookups
CREATE INDEX product_price      IF NOT EXISTS FOR (p:Product)  ON (p.price);
CREATE INDEX order_status       IF NOT EXISTS FOR (o:Order)    ON (o.status);
CREATE INDEX customer_segment   IF NOT EXISTS FOR (c:Customer) ON (c.segment);
CREATE INDEX review_rating      IF NOT EXISTS FOR (r:Review)   ON (r.rating);

// Vector index (Neo4j 5.15+)
CREATE VECTOR INDEX product_embedding IF NOT EXISTS
FOR (p:Product) ON (p.embedding)
OPTIONS {indexConfig: {
  \`vector.dimensions\`: 1536,
  \`vector.similarity_function\`: 'cosine'
}};`})]})]}),e===2&&(0,f.jsxs)("div",{children:[(0,f.jsx)("div",{style:{...R.card,background:S.cyanDim,border:`1px solid ${S.cyan}33`},children:(0,f.jsxs)("div",{style:{display:"flex",gap:12,alignItems:"flex-start"},children:[(0,f.jsx)("span",{style:{fontSize:22},children:"\u26A1"}),(0,f.jsxs)("div",{children:[(0,f.jsx)("div",{style:{fontWeight:700,color:S.cyan,marginBottom:4},children:"APOC-Powered ETL Pipeline \u2014 8 Steps"}),(0,f.jsxs)("div",{style:{color:S.muted,fontSize:12,lineHeight:1.7},children:["Each step is idempotent using ",(0,f.jsx)("code",{style:{fontFamily:zt,color:S.cyan},children:"MERGE"}),". Run the full pipeline on first load, then re-run individual steps for incremental updates. Click any step to expand its Cypher code."]})]})]})}),Cf.map(u=>(0,f.jsx)(Tf,{step:u,isOpen:!!n[u.id],onToggle:()=>i(u.id)},u.id))]}),e===3&&(0,f.jsxs)("div",{children:[(0,f.jsxs)("div",{style:R.card,children:[(0,f.jsx)("div",{style:R.label,children:"Embedding Strategy"}),(0,f.jsx)("div",{style:R.sectionTitle,children:"Graph-Enriched Text Embeddings"}),(0,f.jsx)("p",{style:{color:S.muted,fontSize:13,lineHeight:1.7,margin:"8px 0 20px"},children:"Each Product's embedding is generated from a concatenated text blob that includes its name, description, category hierarchy, top-rated review snippets, and supplier names \u2014 all pulled via graph traversal before embedding. This gives vectors richer context than plain description text."}),(0,f.jsx)("div",{style:{display:"flex",gap:16,flexWrap:"wrap",marginBottom:20},children:[{label:"Model",val:"text-embedding-3-large",color:S.amber},{label:"Dimensions",val:"1536",color:S.cyan},{label:"Index Type",val:"HNSW (cosine)",color:S.purple},{label:"Batch Size",val:"100 / call",color:S.green},{label:"Storage",val:"Weaviate + Neo4j",color:S.red}].map(u=>(0,f.jsxs)("div",{style:{background:u.color+"14",border:`1px solid ${u.color}33`,borderRadius:8,padding:"12px 18px",textAlign:"center"},children:[(0,f.jsx)("div",{style:{color:u.color,fontWeight:700,fontSize:15},children:u.val}),(0,f.jsx)("div",{style:{color:S.muted,fontSize:11,marginTop:2},children:u.label})]},u.label))})]}),(0,f.jsx)("div",{style:{display:"flex",gap:8,marginBottom:16,flexWrap:"wrap"},children:["Embedding Pipeline","Weaviate Schema"].map((u,s)=>(0,f.jsx)("button",{onClick:()=>l(s),style:R.tab(o===s),children:u},u))}),(0,f.jsx)("div",{style:R.card,children:(0,f.jsx)(ir,{lang:"python",code:o===0?bi.embed:bi.schema})})]}),e===4&&(0,f.jsxs)("div",{children:[(0,f.jsxs)("div",{style:R.card,children:[(0,f.jsx)("div",{style:R.label,children:"GraphRAG Query Flow"}),(0,f.jsx)("div",{style:R.sectionTitle,children:"Vector Search \u2295 Graph Traversal \u2295 LLM Generation"}),(0,f.jsx)("p",{style:{color:S.muted,fontSize:13,lineHeight:1.7,margin:"8px 0 20px"},children:"A user question is embedded \u2192 Weaviate finds semantically similar products \u2192 Neo4j enriches each candidate with its graph neighbourhood (categories, suppliers, co-purchased items, reviews) \u2192 the enriched context is passed to GPT-4o for generation."}),(0,f.jsx)("div",{style:{display:"flex",gap:0,overflowX:"auto",paddingBottom:8},children:[{n:"1",label:"User Query",color:S.cyan,icon:"\u{1F4AC}"},{n:"2",label:"Embed Query",color:S.amber,icon:"\u{1F522}"},{n:"3",label:`Vector Search
(Weaviate)`,color:S.purple,icon:"\u{1F50D}"},{n:"4",label:`Graph Enrich
(Neo4j APOC)`,color:S.green,icon:"\u{1F578}\uFE0F"},{n:"5",label:`LLM Generate
(GPT-4o)`,color:S.red,icon:"\u2728"}].map((u,s,c)=>(0,f.jsxs)("div",{style:{display:"flex",alignItems:"center"},children:[(0,f.jsxs)("div",{style:{textAlign:"center",minWidth:130},children:[(0,f.jsx)("div",{style:{width:52,height:52,borderRadius:"50%",background:u.color+"22",border:`2px solid ${u.color}`,display:"flex",alignItems:"center",justifyContent:"center",fontSize:22,margin:"0 auto 8px"},children:u.icon}),(0,f.jsx)("div",{style:{color:u.color,fontWeight:700,fontSize:12,whiteSpace:"pre-line"},children:u.label})]}),s<c.length-1&&(0,f.jsx)("div",{style:{color:S.muted,fontSize:20,padding:"0 6px",marginBottom:20},children:"\u2192"})]},u.n))})]}),(0,f.jsxs)("div",{style:R.card,children:[(0,f.jsx)("div",{style:R.label,children:"GraphRAG Retriever \u2014 Full Code"}),(0,f.jsx)(ir,{lang:"python",code:bi.rag})]}),(0,f.jsxs)("div",{style:R.card,children:[(0,f.jsx)("div",{style:R.label,children:"Example GraphRAG Cypher Queries"}),(0,f.jsx)("div",{style:{marginBottom:12,fontWeight:600,fontSize:13},children:"Native Neo4j vector similarity (5.15+)"}),(0,f.jsx)(ir,{lang:"cypher",code:`// Find products similar to a given SKU using the built-in vector index
MATCH (base:Product {sku: 'ECO-1042'})
CALL db.index.vector.queryNodes(
  'product_embedding',  // index name
  10,                   // top-K
  base.embedding        // query vector
) YIELD node AS similar, score
WHERE score > 0.82
MATCH (similar)-[:BELONGS_TO]->(c:Category)
OPTIONAL MATCH (sup:Supplier)-[:SUPPLIES]->(similar)
RETURN similar.sku, similar.name, similar.price,
       score,
       collect(DISTINCT c.name)   AS categories,
       collect(DISTINCT sup.name) AS suppliers
ORDER BY score DESC;

// \u2500\u2500 Hybrid: vector candidates + graph filter \u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500
// "Find eco-friendly products under $50, often bought with camping gear"
MATCH (base:Product)-[:BELONGS_TO]->(c:Category {name: 'Camping'})
WITH collect(base)[..3] AS seeds
UNWIND seeds AS seed
CALL db.index.vector.queryNodes('product_embedding', 5, seed.embedding)
YIELD node AS candidate, score
WHERE candidate.price < 50 AND score > 0.78
MATCH (o:Order)-[:CONTAINS]->(seed)
MATCH (o)-[:CONTAINS]->(candidate)   // co-purchased filter
RETURN DISTINCT candidate.name, candidate.price, round(score,3) AS similarity
ORDER BY similarity DESC LIMIT 10;`})]}),(0,f.jsx)("div",{style:{...R.card,background:S.purpleDim,border:`1px solid ${S.purple}33`},children:(0,f.jsxs)("div",{style:{display:"flex",gap:12},children:[(0,f.jsx)("span",{style:{fontSize:22},children:"\u{1F680}"}),(0,f.jsxs)("div",{children:[(0,f.jsx)("div",{style:{fontWeight:700,color:S.purple,marginBottom:6},children:"GraphRAG vs. Plain RAG"}),(0,f.jsx)("div",{style:{display:"grid",gridTemplateColumns:"1fr 1fr",gap:8},children:[["Plain RAG","Vector similarity only \u2014 misses graph structure, relationships, and multi-hop context",S.muted],["GraphRAG","Vector search seeds candidates, graph traversal adds suppliers, co-purchases, category hierarchy and reviews \u2014 richer, more accurate answers",S.purple]].map(([u,s,c])=>(0,f.jsxs)("div",{style:{background:S.panel,borderRadius:6,padding:14},children:[(0,f.jsx)("div",{style:{color:c,fontWeight:700,marginBottom:4,fontSize:13},children:u}),(0,f.jsx)("div",{style:{color:S.muted,fontSize:12,lineHeight:1.6},children:s})]},u))})]})]})})]})]})]})}var Bc=Dt(lr(),1),Wc=document.getElementById("root");Wc&&(0,Hc.createRoot)(Wc).render((0,Bc.jsx)(eu,{}));})();
